/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const GPUREG_VSH_CODETRANSFER_CONFIG: u32 = 715;
pub const GPUREG_VSH_CODETRANSFER_DATA: u32 = 716;
pub const GPUREG_02D4: u32 = 724;
pub const GPUREG_VSH_OPDESCS_CONFIG: u32 = 725;
pub const GPUREG_VSH_OPDESCS_DATA: u32 = 726;
pub const GPUREG_02DE: u32 = 734;
pub const GPUREG_02DF: u32 = 735;
pub const GPUREG_02E0: u32 = 736;
pub const GPUREG_02E1: u32 = 737;
pub const GPUREG_02E2: u32 = 738;
pub const GPUREG_02E3: u32 = 739;
pub const GPUREG_02E4: u32 = 740;
pub const GPUREG_02E5: u32 = 741;
pub const GPUREG_02E6: u32 = 742;
pub const GPUREG_02E7: u32 = 743;
pub const GPUREG_02E8: u32 = 744;
pub const GPUREG_02E9: u32 = 745;
pub const GPUREG_02EA: u32 = 746;
pub const GPUREG_02EB: u32 = 747;
pub const GPUREG_02EC: u32 = 748;
pub const GPUREG_02ED: u32 = 749;
pub const GPUREG_02EE: u32 = 750;
pub const GPUREG_02EF: u32 = 751;
pub const GPUREG_02F0: u32 = 752;
pub const GPUREG_02F1: u32 = 753;
pub const GPUREG_02F2: u32 = 754;
pub const GPUREG_02F3: u32 = 755;
pub const GPUREG_02F4: u32 = 756;
pub const GPUREG_02F5: u32 = 757;
pub const GPUREG_02F6: u32 = 758;
pub const GPUREG_02F7: u32 = 759;
pub const GPUREG_02F8: u32 = 760;
pub const GPUREG_02F9: u32 = 761;
pub const GPUREG_02FA: u32 = 762;
pub const GPUREG_02FB: u32 = 763;
pub const GPUREG_02FC: u32 = 764;
pub const GPUREG_02FD: u32 = 765;
pub const GPUREG_02FE: u32 = 766;
pub const GPUREG_02FF: u32 = 767;
pub const NDSP_SAMPLE_RATE: f64 = 32728.498046875;
pub const SWKBD_MAX_WORD_LEN: u32 = 40;
pub const SWKBD_MAX_BUTTON_TEXT_LEN: u32 = 16;
pub const SWKBD_MAX_HINT_TEXT_LEN: u32 = 64;
pub const SWKBD_MAX_CALLBACK_MSG_LEN: u32 = 256;
pub const MIISELECTOR_MAGIC: u32 = 333326543;
pub const MIISELECTOR_TITLE_LEN: u32 = 64;
pub const MIISELECTOR_GUESTMII_SLOTS: u32 = 6;
pub const MIISELECTOR_USERMII_SLOTS: u32 = 100;
pub const MIISELECTOR_GUESTMII_NAME_LEN: u32 = 12;
pub const ARCHIVE_DIRITER_MAGIC: u32 = 1751347809;
pub const LINK3DS_COMM_PORT: u32 = 17491;
pub type __uint32_t = ::libc::c_uint;
pub type __int_least64_t = ::libc::c_longlong;
pub type u8_ = u8;
pub type u16_ = u16;
pub type u32_ = u32;
pub type u64_ = u64;
pub type s8 = i8;
pub type s16 = i16;
pub type s32 = i32;
pub type s64 = i64;
pub type vu8 = u8_;
pub type vu16 = u16_;
pub type vu32 = u32_;
pub type vu64 = u64_;
pub type vs8 = s8;
pub type vs16 = s16;
pub type vs32 = s32;
pub type vs64 = s64;
pub type Handle = u32_;
pub type Result = s32;
pub type ThreadFunc = ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::libc::c_void)>;
pub type voidfn = ::core::option::Option<unsafe extern "C" fn()>;
#[doc = "Structure representing CPU registers"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CpuRegisters {
    #[doc = "< r0-r12."]
    pub r: [u32_; 13usize],
    #[doc = "< sp."]
    pub sp: u32_,
    #[doc = "< lr."]
    pub lr: u32_,
    #[doc = "< pc. May need to be adjusted."]
    pub pc: u32_,
    #[doc = "< cpsr."]
    pub cpsr: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CpuRegisters"][::core::mem::size_of::<CpuRegisters>() - 68usize];
    ["Alignment of CpuRegisters"][::core::mem::align_of::<CpuRegisters>() - 4usize];
    ["Offset of field: CpuRegisters::r"][::core::mem::offset_of!(CpuRegisters, r) - 0usize];
    ["Offset of field: CpuRegisters::sp"][::core::mem::offset_of!(CpuRegisters, sp) - 52usize];
    ["Offset of field: CpuRegisters::lr"][::core::mem::offset_of!(CpuRegisters, lr) - 56usize];
    ["Offset of field: CpuRegisters::pc"][::core::mem::offset_of!(CpuRegisters, pc) - 60usize];
    ["Offset of field: CpuRegisters::cpsr"][::core::mem::offset_of!(CpuRegisters, cpsr) - 64usize];
};
#[doc = "Structure representing FPU registers"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct FpuRegisters {
    pub __bindgen_anon_1: FpuRegisters__bindgen_ty_1,
    #[doc = "< fpscr."]
    pub fpscr: u32_,
    #[doc = "< fpexc."]
    pub fpexc: u32_,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union FpuRegisters__bindgen_ty_1 {
    pub __bindgen_anon_1: FpuRegisters__bindgen_ty_1__bindgen_ty_1,
    #[doc = "< s0-s31."]
    pub s: [f32; 32usize],
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FpuRegisters__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< d0-d15."]
    pub d: [f64; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FpuRegisters__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<FpuRegisters__bindgen_ty_1__bindgen_ty_1>() - 128usize];
    ["Alignment of FpuRegisters__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<FpuRegisters__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    ["Offset of field: FpuRegisters__bindgen_ty_1__bindgen_ty_1::d"]
        [::core::mem::offset_of!(FpuRegisters__bindgen_ty_1__bindgen_ty_1, d) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FpuRegisters__bindgen_ty_1"]
        [::core::mem::size_of::<FpuRegisters__bindgen_ty_1>() - 128usize];
    ["Alignment of FpuRegisters__bindgen_ty_1"]
        [::core::mem::align_of::<FpuRegisters__bindgen_ty_1>() - 4usize];
    ["Offset of field: FpuRegisters__bindgen_ty_1::s"]
        [::core::mem::offset_of!(FpuRegisters__bindgen_ty_1, s) - 0usize];
};
impl Default for FpuRegisters__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FpuRegisters"][::core::mem::size_of::<FpuRegisters>() - 136usize];
    ["Alignment of FpuRegisters"][::core::mem::align_of::<FpuRegisters>() - 4usize];
    ["Offset of field: FpuRegisters::fpscr"]
        [::core::mem::offset_of!(FpuRegisters, fpscr) - 128usize];
    ["Offset of field: FpuRegisters::fpexc"]
        [::core::mem::offset_of!(FpuRegisters, fpexc) - 132usize];
};
impl Default for FpuRegisters {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const RL_SUCCESS: _bindgen_ty_1 = 0;
pub const RL_INFO: _bindgen_ty_1 = 1;
pub const RL_FATAL: _bindgen_ty_1 = 31;
pub const RL_RESET: _bindgen_ty_1 = 30;
pub const RL_REINITIALIZE: _bindgen_ty_1 = 29;
pub const RL_USAGE: _bindgen_ty_1 = 28;
pub const RL_PERMANENT: _bindgen_ty_1 = 27;
pub const RL_TEMPORARY: _bindgen_ty_1 = 26;
pub const RL_STATUS: _bindgen_ty_1 = 25;
#[doc = "Result code level values."]
pub type _bindgen_ty_1 = ::libc::c_uchar;
pub const RS_SUCCESS: _bindgen_ty_2 = 0;
pub const RS_NOP: _bindgen_ty_2 = 1;
pub const RS_WOULDBLOCK: _bindgen_ty_2 = 2;
pub const RS_OUTOFRESOURCE: _bindgen_ty_2 = 3;
pub const RS_NOTFOUND: _bindgen_ty_2 = 4;
pub const RS_INVALIDSTATE: _bindgen_ty_2 = 5;
pub const RS_NOTSUPPORTED: _bindgen_ty_2 = 6;
pub const RS_INVALIDARG: _bindgen_ty_2 = 7;
pub const RS_WRONGARG: _bindgen_ty_2 = 8;
pub const RS_CANCELED: _bindgen_ty_2 = 9;
pub const RS_STATUSCHANGED: _bindgen_ty_2 = 10;
pub const RS_INTERNAL: _bindgen_ty_2 = 11;
pub const RS_INVALIDRESVAL: _bindgen_ty_2 = 63;
#[doc = "Result code summary values."]
pub type _bindgen_ty_2 = ::libc::c_uchar;
pub const RM_COMMON: _bindgen_ty_3 = 0;
pub const RM_KERNEL: _bindgen_ty_3 = 1;
pub const RM_UTIL: _bindgen_ty_3 = 2;
pub const RM_FILE_SERVER: _bindgen_ty_3 = 3;
pub const RM_LOADER_SERVER: _bindgen_ty_3 = 4;
pub const RM_TCB: _bindgen_ty_3 = 5;
pub const RM_OS: _bindgen_ty_3 = 6;
pub const RM_DBG: _bindgen_ty_3 = 7;
pub const RM_DMNT: _bindgen_ty_3 = 8;
pub const RM_PDN: _bindgen_ty_3 = 9;
pub const RM_GSP: _bindgen_ty_3 = 10;
pub const RM_I2C: _bindgen_ty_3 = 11;
pub const RM_GPIO: _bindgen_ty_3 = 12;
pub const RM_DD: _bindgen_ty_3 = 13;
pub const RM_CODEC: _bindgen_ty_3 = 14;
pub const RM_SPI: _bindgen_ty_3 = 15;
pub const RM_PXI: _bindgen_ty_3 = 16;
pub const RM_FS: _bindgen_ty_3 = 17;
pub const RM_DI: _bindgen_ty_3 = 18;
pub const RM_HID: _bindgen_ty_3 = 19;
pub const RM_CAM: _bindgen_ty_3 = 20;
pub const RM_PI: _bindgen_ty_3 = 21;
pub const RM_PM: _bindgen_ty_3 = 22;
pub const RM_PM_LOW: _bindgen_ty_3 = 23;
pub const RM_FSI: _bindgen_ty_3 = 24;
pub const RM_SRV: _bindgen_ty_3 = 25;
pub const RM_NDM: _bindgen_ty_3 = 26;
pub const RM_NWM: _bindgen_ty_3 = 27;
pub const RM_SOC: _bindgen_ty_3 = 28;
pub const RM_LDR: _bindgen_ty_3 = 29;
pub const RM_ACC: _bindgen_ty_3 = 30;
pub const RM_ROMFS: _bindgen_ty_3 = 31;
pub const RM_AM: _bindgen_ty_3 = 32;
pub const RM_HIO: _bindgen_ty_3 = 33;
pub const RM_UPDATER: _bindgen_ty_3 = 34;
pub const RM_MIC: _bindgen_ty_3 = 35;
pub const RM_FND: _bindgen_ty_3 = 36;
pub const RM_MP: _bindgen_ty_3 = 37;
pub const RM_MPWL: _bindgen_ty_3 = 38;
pub const RM_AC: _bindgen_ty_3 = 39;
pub const RM_HTTP: _bindgen_ty_3 = 40;
pub const RM_DSP: _bindgen_ty_3 = 41;
pub const RM_SND: _bindgen_ty_3 = 42;
pub const RM_DLP: _bindgen_ty_3 = 43;
pub const RM_HIO_LOW: _bindgen_ty_3 = 44;
pub const RM_CSND: _bindgen_ty_3 = 45;
pub const RM_SSL: _bindgen_ty_3 = 46;
pub const RM_AM_LOW: _bindgen_ty_3 = 47;
pub const RM_NEX: _bindgen_ty_3 = 48;
pub const RM_FRIENDS: _bindgen_ty_3 = 49;
pub const RM_RDT: _bindgen_ty_3 = 50;
pub const RM_APPLET: _bindgen_ty_3 = 51;
pub const RM_NIM: _bindgen_ty_3 = 52;
pub const RM_PTM: _bindgen_ty_3 = 53;
pub const RM_MIDI: _bindgen_ty_3 = 54;
pub const RM_MC: _bindgen_ty_3 = 55;
pub const RM_SWC: _bindgen_ty_3 = 56;
pub const RM_FATFS: _bindgen_ty_3 = 57;
pub const RM_NGC: _bindgen_ty_3 = 58;
pub const RM_CARD: _bindgen_ty_3 = 59;
pub const RM_CARDNOR: _bindgen_ty_3 = 60;
pub const RM_SDMC: _bindgen_ty_3 = 61;
pub const RM_BOSS: _bindgen_ty_3 = 62;
pub const RM_DBM: _bindgen_ty_3 = 63;
pub const RM_CONFIG: _bindgen_ty_3 = 64;
pub const RM_PS: _bindgen_ty_3 = 65;
pub const RM_CEC: _bindgen_ty_3 = 66;
pub const RM_IR: _bindgen_ty_3 = 67;
pub const RM_UDS: _bindgen_ty_3 = 68;
pub const RM_PL: _bindgen_ty_3 = 69;
pub const RM_CUP: _bindgen_ty_3 = 70;
pub const RM_GYROSCOPE: _bindgen_ty_3 = 71;
pub const RM_MCU: _bindgen_ty_3 = 72;
pub const RM_NS: _bindgen_ty_3 = 73;
pub const RM_NEWS: _bindgen_ty_3 = 74;
pub const RM_RO: _bindgen_ty_3 = 75;
pub const RM_GD: _bindgen_ty_3 = 76;
pub const RM_CARD_SPI: _bindgen_ty_3 = 77;
pub const RM_EC: _bindgen_ty_3 = 78;
pub const RM_WEB_BROWSER: _bindgen_ty_3 = 79;
pub const RM_TEST: _bindgen_ty_3 = 80;
pub const RM_ENC: _bindgen_ty_3 = 81;
pub const RM_PIA: _bindgen_ty_3 = 82;
pub const RM_ACT: _bindgen_ty_3 = 83;
pub const RM_VCTL: _bindgen_ty_3 = 84;
pub const RM_OLV: _bindgen_ty_3 = 85;
pub const RM_NEIA: _bindgen_ty_3 = 86;
pub const RM_NPNS: _bindgen_ty_3 = 87;
pub const RM_AVD: _bindgen_ty_3 = 90;
pub const RM_L2B: _bindgen_ty_3 = 91;
pub const RM_MVD: _bindgen_ty_3 = 92;
pub const RM_NFC: _bindgen_ty_3 = 93;
pub const RM_UART: _bindgen_ty_3 = 94;
pub const RM_SPM: _bindgen_ty_3 = 95;
pub const RM_QTM: _bindgen_ty_3 = 96;
pub const RM_NFP: _bindgen_ty_3 = 97;
pub const RM_APPLICATION: _bindgen_ty_3 = 254;
pub const RM_INVALIDRESVAL: _bindgen_ty_3 = 255;
#[doc = "Result code module values."]
pub type _bindgen_ty_3 = ::libc::c_uchar;
pub const RD_SUCCESS: _bindgen_ty_4 = 0;
pub const RD_INVALID_RESULT_VALUE: _bindgen_ty_4 = 1023;
pub const RD_TIMEOUT: _bindgen_ty_4 = 1022;
pub const RD_OUT_OF_RANGE: _bindgen_ty_4 = 1021;
pub const RD_ALREADY_EXISTS: _bindgen_ty_4 = 1020;
pub const RD_CANCEL_REQUESTED: _bindgen_ty_4 = 1019;
pub const RD_NOT_FOUND: _bindgen_ty_4 = 1018;
pub const RD_ALREADY_INITIALIZED: _bindgen_ty_4 = 1017;
pub const RD_NOT_INITIALIZED: _bindgen_ty_4 = 1016;
pub const RD_INVALID_HANDLE: _bindgen_ty_4 = 1015;
pub const RD_INVALID_POINTER: _bindgen_ty_4 = 1014;
pub const RD_INVALID_ADDRESS: _bindgen_ty_4 = 1013;
pub const RD_NOT_IMPLEMENTED: _bindgen_ty_4 = 1012;
pub const RD_OUT_OF_MEMORY: _bindgen_ty_4 = 1011;
pub const RD_MISALIGNED_SIZE: _bindgen_ty_4 = 1010;
pub const RD_MISALIGNED_ADDRESS: _bindgen_ty_4 = 1009;
pub const RD_BUSY: _bindgen_ty_4 = 1008;
pub const RD_NO_DATA: _bindgen_ty_4 = 1007;
pub const RD_INVALID_COMBINATION: _bindgen_ty_4 = 1006;
pub const RD_INVALID_ENUM_VALUE: _bindgen_ty_4 = 1005;
pub const RD_INVALID_SIZE: _bindgen_ty_4 = 1004;
pub const RD_ALREADY_DONE: _bindgen_ty_4 = 1003;
pub const RD_NOT_AUTHORIZED: _bindgen_ty_4 = 1002;
pub const RD_TOO_LARGE: _bindgen_ty_4 = 1001;
pub const RD_INVALID_SELECTION: _bindgen_ty_4 = 1000;
#[doc = "Result code generic description values."]
pub type _bindgen_ty_4 = ::libc::c_ushort;
#[doc = "< Readable"]
pub const IPC_BUFFER_R: IPC_BufferRights = 2;
#[doc = "< Writable"]
pub const IPC_BUFFER_W: IPC_BufferRights = 4;
#[doc = "< Readable and Writable"]
pub const IPC_BUFFER_RW: IPC_BufferRights = 6;
#[doc = "IPC buffer access rights."]
pub type IPC_BufferRights = ::libc::c_uchar;
unsafe extern "C" {
    #[doc = "Creates a command header to be used for IPC\n # Arguments\n\n* `command_id` - ID of the command to create a header for.\n * `normal_params` - Size of the normal parameters in words. Up to 63.\n * `translate_params` - Size of the translate parameters in words. Up to 63.\n # Returns\n\nThe created IPC header.\n\n Normal parameters are sent directly to the process while the translate parameters might go through modifications and checks by the kernel.\n The translate parameters are described by headers generated with the IPC_Desc_* functions.\n\n > **Note:** While #normal_params is equivalent to the number of normal parameters, #translate_params includes the size occupied by the translate parameters headers."]
    #[link_name = "IPC_MakeHeader__extern"]
    pub fn IPC_MakeHeader(
        command_id: u16_,
        normal_params: ::libc::c_uint,
        translate_params: ::libc::c_uint,
    ) -> u32_;
}
unsafe extern "C" {
    #[doc = "Creates a header to share handles\n # Arguments\n\n* `number` - The number of handles following this header. Max 64.\n # Returns\n\nThe created shared handles header.\n\n The #number next values are handles that will be shared between the two processes.\n\n > **Note:** Zero values will have no effect."]
    #[link_name = "IPC_Desc_SharedHandles__extern"]
    pub fn IPC_Desc_SharedHandles(number: ::libc::c_uint) -> u32_;
}
unsafe extern "C" {
    #[doc = "Creates the header to transfer handle ownership\n # Arguments\n\n* `number` - The number of handles following this header. Max 64.\n # Returns\n\nThe created handle transfer header.\n\n The #number next values are handles that will be duplicated and closed by the other process.\n\n > **Note:** Zero values will have no effect."]
    #[link_name = "IPC_Desc_MoveHandles__extern"]
    pub fn IPC_Desc_MoveHandles(number: ::libc::c_uint) -> u32_;
}
unsafe extern "C" {
    #[doc = "Returns the code to ask the kernel to fill the handle with the current process ID.\n # Returns\n\nThe code to request the current process ID.\n\n The next value is a placeholder that will be replaced by the current process ID by the kernel."]
    #[link_name = "IPC_Desc_CurProcessId__extern"]
    pub fn IPC_Desc_CurProcessId() -> u32_;
}
unsafe extern "C" {
    #[link_name = "IPC_Desc_CurProcessHandle__extern"]
    pub fn IPC_Desc_CurProcessHandle() -> u32_;
}
unsafe extern "C" {
    #[doc = "Creates a header describing a static buffer.\n # Arguments\n\n* `size` - Size of the buffer. Max ?0x03FFFF?.\n * `buffer_id` - The Id of the buffer. Max 0xF.\n # Returns\n\nThe created static buffer header.\n\n The next value is a pointer to the buffer. It will be copied to TLS offset 0x180 + static_buffer_id*8."]
    #[link_name = "IPC_Desc_StaticBuffer__extern"]
    pub fn IPC_Desc_StaticBuffer(size: usize, buffer_id: ::libc::c_uint) -> u32_;
}
unsafe extern "C" {
    #[doc = "Creates a header describing a buffer to be sent over PXI.\n # Arguments\n\n* `size` - Size of the buffer. Max 0x00FFFFFF.\n * `buffer_id` - The Id of the buffer. Max 0xF.\n * `is_read_only` - true if the buffer is read-only. If false, the buffer is considered to have read-write access.\n # Returns\n\nThe created PXI buffer header.\n\n The next value is a phys-address of a table located in the BASE memregion."]
    #[link_name = "IPC_Desc_PXIBuffer__extern"]
    pub fn IPC_Desc_PXIBuffer(size: usize, buffer_id: ::libc::c_uint, is_read_only: bool) -> u32_;
}
unsafe extern "C" {
    #[doc = "Creates a header describing a buffer from the main memory.\n # Arguments\n\n* `size` - Size of the buffer. Max 0x0FFFFFFF.\n * `rights` - The rights of the buffer for the destination process.\n # Returns\n\nThe created buffer header.\n\n The next value is a pointer to the buffer."]
    #[link_name = "IPC_Desc_Buffer__extern"]
    pub fn IPC_Desc_Buffer(size: usize, rights: IPC_BufferRights) -> u32_;
}
#[doc = "< Memory un-mapping"]
pub const MEMOP_FREE: MemOp = 1;
#[doc = "< Reserve memory"]
pub const MEMOP_RESERVE: MemOp = 2;
#[doc = "< Memory mapping"]
pub const MEMOP_ALLOC: MemOp = 3;
#[doc = "< Mirror mapping"]
pub const MEMOP_MAP: MemOp = 4;
#[doc = "< Mirror unmapping"]
pub const MEMOP_UNMAP: MemOp = 5;
#[doc = "< Change protection"]
pub const MEMOP_PROT: MemOp = 6;
#[doc = "< APPLICATION memory region."]
pub const MEMOP_REGION_APP: MemOp = 256;
#[doc = "< SYSTEM memory region."]
pub const MEMOP_REGION_SYSTEM: MemOp = 512;
#[doc = "< BASE memory region."]
pub const MEMOP_REGION_BASE: MemOp = 768;
#[doc = "< Operation bitmask."]
pub const MEMOP_OP_MASK: MemOp = 255;
#[doc = "< Region bitmask."]
pub const MEMOP_REGION_MASK: MemOp = 3840;
#[doc = "< Flag for linear memory operations"]
pub const MEMOP_LINEAR_FLAG: MemOp = 65536;
#[doc = "< Allocates linear memory."]
pub const MEMOP_ALLOC_LINEAR: MemOp = 65539;
#[doc = "svcControlMemory operation flags\n\n The lowest 8 bits are the operation"]
pub type MemOp = ::libc::c_uint;
#[doc = "< Free memory"]
pub const MEMSTATE_FREE: MemState = 0;
#[doc = "< Reserved memory"]
pub const MEMSTATE_RESERVED: MemState = 1;
#[doc = "< I/O memory"]
pub const MEMSTATE_IO: MemState = 2;
#[doc = "< Static memory"]
pub const MEMSTATE_STATIC: MemState = 3;
#[doc = "< Code memory"]
pub const MEMSTATE_CODE: MemState = 4;
#[doc = "< Private memory"]
pub const MEMSTATE_PRIVATE: MemState = 5;
#[doc = "< Shared memory"]
pub const MEMSTATE_SHARED: MemState = 6;
#[doc = "< Continuous memory"]
pub const MEMSTATE_CONTINUOUS: MemState = 7;
#[doc = "< Aliased memory"]
pub const MEMSTATE_ALIASED: MemState = 8;
#[doc = "< Alias memory"]
pub const MEMSTATE_ALIAS: MemState = 9;
#[doc = "< Aliased code memory"]
pub const MEMSTATE_ALIASCODE: MemState = 10;
#[doc = "< Locked memory"]
pub const MEMSTATE_LOCKED: MemState = 11;
#[doc = "The state of a memory block."]
pub type MemState = ::libc::c_uchar;
#[doc = "< Readable"]
pub const MEMPERM_READ: MemPerm = 1;
#[doc = "< Writable"]
pub const MEMPERM_WRITE: MemPerm = 2;
#[doc = "< Executable"]
pub const MEMPERM_EXECUTE: MemPerm = 4;
#[doc = "< Readable and writable"]
pub const MEMPERM_READWRITE: MemPerm = 3;
#[doc = "< Readable and executable"]
pub const MEMPERM_READEXECUTE: MemPerm = 5;
#[doc = "< Don't care"]
pub const MEMPERM_DONTCARE: MemPerm = 268435456;
#[doc = "Memory permission flags"]
pub type MemPerm = ::libc::c_uint;
#[doc = "< All regions."]
pub const MEMREGION_ALL: MemRegion = 0;
#[doc = "< APPLICATION memory."]
pub const MEMREGION_APPLICATION: MemRegion = 1;
#[doc = "< SYSTEM memory."]
pub const MEMREGION_SYSTEM: MemRegion = 2;
#[doc = "< BASE memory."]
pub const MEMREGION_BASE: MemRegion = 3;
#[doc = "Memory regions."]
pub type MemRegion = ::libc::c_uchar;
#[doc = "Memory information."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MemInfo {
    #[doc = "< Base address."]
    pub base_addr: u32_,
    #[doc = "< Size."]
    pub size: u32_,
    #[doc = "< Memory permissions. See MemPerm"]
    pub perm: u32_,
    #[doc = "< Memory state. See MemState"]
    pub state: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MemInfo"][::core::mem::size_of::<MemInfo>() - 16usize];
    ["Alignment of MemInfo"][::core::mem::align_of::<MemInfo>() - 4usize];
    ["Offset of field: MemInfo::base_addr"][::core::mem::offset_of!(MemInfo, base_addr) - 0usize];
    ["Offset of field: MemInfo::size"][::core::mem::offset_of!(MemInfo, size) - 4usize];
    ["Offset of field: MemInfo::perm"][::core::mem::offset_of!(MemInfo, perm) - 8usize];
    ["Offset of field: MemInfo::state"][::core::mem::offset_of!(MemInfo, state) - 12usize];
};
#[doc = "Memory page information."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PageInfo {
    #[doc = "< Page flags."]
    pub flags: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PageInfo"][::core::mem::size_of::<PageInfo>() - 4usize];
    ["Alignment of PageInfo"][::core::mem::align_of::<PageInfo>() - 4usize];
    ["Offset of field: PageInfo::flags"][::core::mem::offset_of!(PageInfo, flags) - 0usize];
};
#[doc = "< Signal #value threads for wake-up."]
pub const ARBITRATION_SIGNAL: ArbitrationType = 0;
#[doc = "< If the memory at the address is strictly lower than #value, then wait for signal."]
pub const ARBITRATION_WAIT_IF_LESS_THAN: ArbitrationType = 1;
#[doc = "< If the memory at the address is strictly lower than #value, then decrement it and wait for signal."]
pub const ARBITRATION_DECREMENT_AND_WAIT_IF_LESS_THAN: ArbitrationType = 2;
#[doc = "< If the memory at the address is strictly lower than #value, then wait for signal or timeout."]
pub const ARBITRATION_WAIT_IF_LESS_THAN_TIMEOUT: ArbitrationType = 3;
#[doc = "< If the memory at the address is strictly lower than #value, then decrement it and wait for signal or timeout."]
pub const ARBITRATION_DECREMENT_AND_WAIT_IF_LESS_THAN_TIMEOUT: ArbitrationType = 4;
#[doc = "Arbitration modes."]
pub type ArbitrationType = ::libc::c_uchar;
#[doc = "< When the primitive is signaled, it will wake up exactly one thread and will clear itself automatically."]
pub const RESET_ONESHOT: ResetType = 0;
#[doc = "< When the primitive is signaled, it will wake up all threads and it won't clear itself automatically."]
pub const RESET_STICKY: ResetType = 1;
#[doc = "< Only meaningful for timers: same as ONESHOT but it will periodically signal the timer instead of just once."]
pub const RESET_PULSE: ResetType = 2;
#[doc = "Reset types (for use with events and timers)"]
pub type ResetType = ::libc::c_uchar;
#[doc = "< Unknown."]
pub const THREADINFO_TYPE_UNKNOWN: ThreadInfoType = 0;
#[doc = "Types of thread info."]
pub type ThreadInfoType = ::libc::c_uchar;
#[doc = "< Thread priority"]
pub const RESLIMIT_PRIORITY: ResourceLimitType = 0;
#[doc = "< Quantity of allocatable memory"]
pub const RESLIMIT_COMMIT: ResourceLimitType = 1;
#[doc = "< Number of threads"]
pub const RESLIMIT_THREAD: ResourceLimitType = 2;
#[doc = "< Number of events"]
pub const RESLIMIT_EVENT: ResourceLimitType = 3;
#[doc = "< Number of mutexes"]
pub const RESLIMIT_MUTEX: ResourceLimitType = 4;
#[doc = "< Number of semaphores"]
pub const RESLIMIT_SEMAPHORE: ResourceLimitType = 5;
#[doc = "< Number of timers"]
pub const RESLIMIT_TIMER: ResourceLimitType = 6;
#[doc = "< Number of shared memory objects, see svcCreateMemoryBlock"]
pub const RESLIMIT_SHAREDMEMORY: ResourceLimitType = 7;
#[doc = "< Number of address arbiters"]
pub const RESLIMIT_ADDRESSARBITER: ResourceLimitType = 8;
#[doc = "< CPU time. Value expressed in percentage regular until it reaches 90."]
pub const RESLIMIT_CPUTIME: ResourceLimitType = 9;
#[doc = "< Forces enum size to be 32 bits"]
pub const RESLIMIT_BIT: ResourceLimitType = 2147483648;
#[doc = "Types of resource limit"]
pub type ResourceLimitType = ::libc::c_uint;
#[doc = "< DMA transfer involving at least one device is starting and has not reached DMAWFP yet."]
pub const DMASTATE_STARTING: DmaState = 0;
#[doc = "< DMA channel is in WFP state for the destination device (2nd loop iteration onwards)."]
pub const DMASTATE_WFP_DST: DmaState = 1;
#[doc = "< DMA channel is in WFP state for the source device (2nd loop iteration onwards)."]
pub const DMASTATE_WFP_SRC: DmaState = 2;
#[doc = "< DMA transfer is running."]
pub const DMASTATE_RUNNING: DmaState = 3;
#[doc = "< DMA transfer is done."]
pub const DMASTATE_DONE: DmaState = 4;
#[doc = "DMA transfer state."]
pub type DmaState = ::libc::c_uchar;
#[doc = "< DMA source is a device/peripheral. Address will not auto-increment."]
pub const DMACFG_SRC_IS_DEVICE: _bindgen_ty_5 = 1;
#[doc = "< DMA destination is a device/peripheral. Address will not auto-increment."]
pub const DMACFG_DST_IS_DEVICE: _bindgen_ty_5 = 2;
#[doc = "< Make svcStartInterProcessDma wait for the channel to be unlocked."]
pub const DMACFG_WAIT_AVAILABLE: _bindgen_ty_5 = 4;
#[doc = "< Keep the channel locked after the transfer. Required for svcRestartDma."]
pub const DMACFG_KEEP_LOCKED: _bindgen_ty_5 = 8;
#[doc = "< Use the provided source device configuration even if the DMA source is not a device."]
pub const DMACFG_USE_SRC_CONFIG: _bindgen_ty_5 = 64;
#[doc = "< Use the provided destination device configuration even if the DMA destination is not a device."]
pub const DMACFG_USE_DST_CONFIG: _bindgen_ty_5 = 128;
#[doc = "Configuration flags for DmaConfig."]
pub type _bindgen_ty_5 = ::libc::c_uchar;
#[doc = "< Unlock the channel after transfer."]
pub const DMARST_UNLOCK: _bindgen_ty_6 = 1;
#[doc = "< Replace DMAFLUSHP instructions by NOP (they may not be regenerated even if this flag is not set)."]
pub const DMARST_RESUME_DEVICE: _bindgen_ty_6 = 2;
#[doc = "Configuration flags for svcRestartDma."]
pub type _bindgen_ty_6 = ::libc::c_uchar;
#[doc = "Device configuration structure, part of DmaConfig.\n > **Note:** - if (and only if) src/dst is a device, then src/dst won't be auto-incremented.\n - the kernel uses DMAMOV instead of DMAADNH, when having to decrement (possibly working around an erratum);\n this forces all loops to be unrolled -- you need to keep that in mind when using negative increments, as the kernel\n uses a limit of 100 DMA instruction bytes per channel."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DmaDeviceConfig {
    #[doc = "< DMA device ID."]
    pub deviceId: s8,
    #[doc = "< Mask of allowed access alignments (8, 4, 2, 1)."]
    pub allowedAlignments: s8,
    #[doc = "< Number of bytes transferred in a burst loop. Can be 0 (in which case the max allowed alignment is used as unit)."]
    pub burstSize: s16,
    #[doc = "< Number of bytes transferred in a \"transfer\" loop (made of burst loops)."]
    pub transferSize: s16,
    #[doc = "< Burst loop stride, can be <= 0."]
    pub burstStride: s16,
    #[doc = "< \"Transfer\" loop stride, can be <= 0."]
    pub transferStride: s16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DmaDeviceConfig"][::core::mem::size_of::<DmaDeviceConfig>() - 10usize];
    ["Alignment of DmaDeviceConfig"][::core::mem::align_of::<DmaDeviceConfig>() - 2usize];
    ["Offset of field: DmaDeviceConfig::deviceId"]
        [::core::mem::offset_of!(DmaDeviceConfig, deviceId) - 0usize];
    ["Offset of field: DmaDeviceConfig::allowedAlignments"]
        [::core::mem::offset_of!(DmaDeviceConfig, allowedAlignments) - 1usize];
    ["Offset of field: DmaDeviceConfig::burstSize"]
        [::core::mem::offset_of!(DmaDeviceConfig, burstSize) - 2usize];
    ["Offset of field: DmaDeviceConfig::transferSize"]
        [::core::mem::offset_of!(DmaDeviceConfig, transferSize) - 4usize];
    ["Offset of field: DmaDeviceConfig::burstStride"]
        [::core::mem::offset_of!(DmaDeviceConfig, burstStride) - 6usize];
    ["Offset of field: DmaDeviceConfig::transferStride"]
        [::core::mem::offset_of!(DmaDeviceConfig, transferStride) - 8usize];
};
#[doc = "Configuration stucture for svcStartInterProcessDma."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DmaConfig {
    #[doc = "< Channel ID (Arm11: 0-7, Arm9: 0-1). Use -1 to auto-assign to a free channel (Arm11: 3-7, Arm9: 0-1)."]
    pub channelId: s8,
    #[doc = "< Endian swap size (can be 0)."]
    pub endianSwapSize: s8,
    #[doc = "< DMACFG_* flags."]
    pub flags: u8_,
    pub _padding: u8_,
    #[doc = "< Source device configuration, read if DMACFG_SRC_IS_DEVICE and/or DMACFG_USE_SRC_CONFIG are set."]
    pub srcCfg: DmaDeviceConfig,
    #[doc = "< Destination device configuration, read if DMACFG_SRC_IS_DEVICE and/or DMACFG_USE_SRC_CONFIG are set."]
    pub dstCfg: DmaDeviceConfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DmaConfig"][::core::mem::size_of::<DmaConfig>() - 24usize];
    ["Alignment of DmaConfig"][::core::mem::align_of::<DmaConfig>() - 2usize];
    ["Offset of field: DmaConfig::channelId"]
        [::core::mem::offset_of!(DmaConfig, channelId) - 0usize];
    ["Offset of field: DmaConfig::endianSwapSize"]
        [::core::mem::offset_of!(DmaConfig, endianSwapSize) - 1usize];
    ["Offset of field: DmaConfig::flags"][::core::mem::offset_of!(DmaConfig, flags) - 2usize];
    ["Offset of field: DmaConfig::_padding"][::core::mem::offset_of!(DmaConfig, _padding) - 3usize];
    ["Offset of field: DmaConfig::srcCfg"][::core::mem::offset_of!(DmaConfig, srcCfg) - 4usize];
    ["Offset of field: DmaConfig::dstCfg"][::core::mem::offset_of!(DmaConfig, dstCfg) - 14usize];
};
#[doc = "< Enable and lock perfmon. functionality."]
pub const PERFCOUNTEROP_ENABLE: PerfCounterOperation = 0;
#[doc = "< Disable and forcibly unlock perfmon. functionality."]
pub const PERFCOUNTEROP_DISABLE: PerfCounterOperation = 1;
#[doc = "< Get the value of a counter register."]
pub const PERFCOUNTEROP_GET_VALUE: PerfCounterOperation = 2;
#[doc = "< Set the value of a counter register."]
pub const PERFCOUNTEROP_SET_VALUE: PerfCounterOperation = 3;
#[doc = "< Get the overflow flags for all CP15 and SCU counters."]
pub const PERFCOUNTEROP_GET_OVERFLOW_FLAGS: PerfCounterOperation = 4;
#[doc = "< Reset the value and/or overflow flags of selected counters."]
pub const PERFCOUNTEROP_RESET: PerfCounterOperation = 5;
#[doc = "< Get the event ID associated to a particular counter."]
pub const PERFCOUNTEROP_GET_EVENT: PerfCounterOperation = 6;
#[doc = "< Set the event ID associated to a paritcular counter."]
pub const PERFCOUNTEROP_SET_EVENT: PerfCounterOperation = 7;
#[doc = "< (Dis)allow the kernel to track counter overflows and to use 64-bit counter values."]
pub const PERFCOUNTEROP_SET_VIRTUAL_COUNTER_ENABLED: PerfCounterOperation = 8;
#[doc = "Operations for svcControlPerformanceCounter"]
pub type PerfCounterOperation = ::libc::c_uchar;
pub const PERFCOUNTERREG_CORE_BASE: PerfCounterRegister = 0;
#[doc = "< CP15 PMN0."]
pub const PERFCOUNTERREG_CORE_COUNT_REG_0: PerfCounterRegister = 0;
#[doc = "< CP15 PMN1."]
pub const PERFCOUNTERREG_CORE_COUNT_REG_1: PerfCounterRegister = 1;
#[doc = "< CP15 CCNT."]
pub const PERFCOUNTERREG_CORE_CYCLE_COUNTER: PerfCounterRegister = 2;
pub const PERFCOUNTERREG_SCU_BASE: PerfCounterRegister = 16;
#[doc = "< SCU MN0."]
pub const PERFCOUNTERREG_SCU_0: PerfCounterRegister = 16;
#[doc = "< SCU MN1."]
pub const PERFCOUNTERREG_SCU_1: PerfCounterRegister = 17;
#[doc = "< SCU MN2."]
pub const PERFCOUNTERREG_SCU_2: PerfCounterRegister = 18;
#[doc = "< SCU MN3."]
pub const PERFCOUNTERREG_SCU_3: PerfCounterRegister = 19;
#[doc = "< SCU MN4. Prod-N3DS only. IRQ line missing."]
pub const PERFCOUNTERREG_SCU_4: PerfCounterRegister = 20;
#[doc = "< SCU MN5. Prod-N3DS only. IRQ line missing."]
pub const PERFCOUNTERREG_SCU_5: PerfCounterRegister = 21;
#[doc = "< SCU MN6. Prod-N3DS only. IRQ line missing."]
pub const PERFCOUNTERREG_SCU_6: PerfCounterRegister = 22;
#[doc = "< SCU MN7. Prod-N3DS only. IRQ line missing."]
pub const PERFCOUNTERREG_SCU_7: PerfCounterRegister = 23;
#[doc = "Performance counter register IDs (CP15 and SCU)."]
pub type PerfCounterRegister = ::libc::c_uchar;
pub const PERFCOUNTEREVT_CORE_BASE: PerfCounterEvent = 0;
pub const PERFCOUNTEREVT_CORE_INST_CACHE_MISS: PerfCounterEvent = 0;
pub const PERFCOUNTEREVT_CORE_STALL_BY_LACK_OF_INST: PerfCounterEvent = 1;
pub const PERFCOUNTEREVT_CORE_STALL_BY_DATA_HAZARD: PerfCounterEvent = 2;
pub const PERFCOUNTEREVT_CORE_INST_MICRO_TLB_MISS: PerfCounterEvent = 3;
pub const PERFCOUNTEREVT_CORE_DATA_MICRO_TLB_MISS: PerfCounterEvent = 4;
pub const PERFCOUNTEREVT_CORE_BRANCH_INST: PerfCounterEvent = 5;
pub const PERFCOUNTEREVT_CORE_BRANCH_NOT_PREDICTED: PerfCounterEvent = 6;
pub const PERFCOUNTEREVT_CORE_BRANCH_MISS_PREDICTED: PerfCounterEvent = 7;
pub const PERFCOUNTEREVT_CORE_INST_EXECUTED: PerfCounterEvent = 8;
pub const PERFCOUNTEREVT_CORE_FOLDED_INST_EXECUTED: PerfCounterEvent = 9;
pub const PERFCOUNTEREVT_CORE_DATA_CACHE_READ: PerfCounterEvent = 10;
pub const PERFCOUNTEREVT_CORE_DATA_CACHE_READ_MISS: PerfCounterEvent = 11;
pub const PERFCOUNTEREVT_CORE_DATA_CACHE_WRITE: PerfCounterEvent = 12;
pub const PERFCOUNTEREVT_CORE_DATA_CACHE_WRITE_MISS: PerfCounterEvent = 13;
pub const PERFCOUNTEREVT_CORE_DATA_CACHE_LINE_EVICTION: PerfCounterEvent = 14;
pub const PERFCOUNTEREVT_CORE_PC_CHANGED: PerfCounterEvent = 15;
pub const PERFCOUNTEREVT_CORE_MAIN_TLB_MISS: PerfCounterEvent = 16;
pub const PERFCOUNTEREVT_CORE_EXTERNAL_REQUEST: PerfCounterEvent = 17;
pub const PERFCOUNTEREVT_CORE_STALL_BY_LSU_FULL: PerfCounterEvent = 18;
pub const PERFCOUNTEREVT_CORE_STORE_BUFFER_DRAIN: PerfCounterEvent = 19;
pub const PERFCOUNTEREVT_CORE_MERGE_IN_STORE_BUFFER: PerfCounterEvent = 20;
#[doc = "< One cycle elapsed."]
pub const PERFCOUNTEREVT_CORE_CYCLE_COUNT: PerfCounterEvent = 255;
#[doc = "< 64 cycles elapsed."]
pub const PERFCOUNTEREVT_CORE_CYCLE_COUNT_64: PerfCounterEvent = 4095;
pub const PERFCOUNTEREVT_SCU_BASE: PerfCounterEvent = 4096;
pub const PERFCOUNTEREVT_SCU_DISABLED: PerfCounterEvent = 4096;
pub const PERFCOUNTEREVT_SCU_LINEFILL_MISS_FROM_CORE0: PerfCounterEvent = 4097;
pub const PERFCOUNTEREVT_SCU_LINEFILL_MISS_FROM_CORE1: PerfCounterEvent = 4098;
pub const PERFCOUNTEREVT_SCU_LINEFILL_MISS_FROM_CORE2: PerfCounterEvent = 4099;
pub const PERFCOUNTEREVT_SCU_LINEFILL_MISS_FROM_CORE3: PerfCounterEvent = 4100;
pub const PERFCOUNTEREVT_SCU_LINEFILL_HIT_FROM_CORE0: PerfCounterEvent = 4101;
pub const PERFCOUNTEREVT_SCU_LINEFILL_HIT_FROM_CORE1: PerfCounterEvent = 4102;
pub const PERFCOUNTEREVT_SCU_LINEFILL_HIT_FROM_CORE2: PerfCounterEvent = 4103;
pub const PERFCOUNTEREVT_SCU_LINEFILL_HIT_FROM_CORE3: PerfCounterEvent = 4104;
pub const PERFCOUNTEREVT_SCU_LINE_MISSING_FROM_CORE0: PerfCounterEvent = 4105;
pub const PERFCOUNTEREVT_SCU_LINE_MISSING_FROM_CORE1: PerfCounterEvent = 4106;
pub const PERFCOUNTEREVT_SCU_LINE_MISSING_FROM_CORE2: PerfCounterEvent = 4107;
pub const PERFCOUNTEREVT_SCU_LINE_MISSING_FROM_CORE3: PerfCounterEvent = 4108;
pub const PERFCOUNTEREVT_SCU_LINE_MIGRATION: PerfCounterEvent = 4109;
pub const PERFCOUNTEREVT_SCU_READ_BUSY_PORT0: PerfCounterEvent = 4110;
pub const PERFCOUNTEREVT_SCU_READ_BUSY_PORT1: PerfCounterEvent = 4111;
pub const PERFCOUNTEREVT_SCU_WRITE_BUSY_PORT0: PerfCounterEvent = 4112;
pub const PERFCOUNTEREVT_SCU_WRITE_BUSY_PORT1: PerfCounterEvent = 4113;
pub const PERFCOUNTEREVT_SCU_EXTERNAL_READ: PerfCounterEvent = 4114;
pub const PERFCOUNTEREVT_SCU_EXTERNAL_WRITE: PerfCounterEvent = 4115;
pub const PERFCOUNTEREVT_SCU_CYCLE_COUNT: PerfCounterEvent = 4127;
#[doc = "Performance counter event IDs (CP15 or SCU).\n\n > **Note:** Refer to:\n - CP15: https://developer.arm.com/documentation/ddi0360/e/control-coprocessor-cp15/register-descriptions/c15--performance-monitor-control-register--pmnc-\n - SCU: https://developer.arm.com/documentation/ddi0360/e/mpcore-private-memory-region/about-the-mpcore-private-memory-region/performance-monitor-event-registers"]
pub type PerfCounterEvent = ::libc::c_ushort;
#[doc = "Event relating to the attachment of a process."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct AttachProcessEvent {
    #[doc = "< ID of the program."]
    pub program_id: u64_,
    #[doc = "< Name of the process."]
    pub process_name: [::libc::c_char; 8usize],
    #[doc = "< ID of the process."]
    pub process_id: u32_,
    #[doc = "< Always 0"]
    pub other_flags: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AttachProcessEvent"][::core::mem::size_of::<AttachProcessEvent>() - 24usize];
    ["Alignment of AttachProcessEvent"][::core::mem::align_of::<AttachProcessEvent>() - 8usize];
    ["Offset of field: AttachProcessEvent::program_id"]
        [::core::mem::offset_of!(AttachProcessEvent, program_id) - 0usize];
    ["Offset of field: AttachProcessEvent::process_name"]
        [::core::mem::offset_of!(AttachProcessEvent, process_name) - 8usize];
    ["Offset of field: AttachProcessEvent::process_id"]
        [::core::mem::offset_of!(AttachProcessEvent, process_id) - 16usize];
    ["Offset of field: AttachProcessEvent::other_flags"]
        [::core::mem::offset_of!(AttachProcessEvent, other_flags) - 20usize];
};
#[doc = "< Process exited either normally or due to an uncaught exception."]
pub const EXITPROCESS_EVENT_EXIT: ExitProcessEventReason = 0;
#[doc = "< Process has been terminated by svcTerminateProcess."]
pub const EXITPROCESS_EVENT_TERMINATE: ExitProcessEventReason = 1;
#[doc = "< Process has been terminated by svcTerminateDebugProcess."]
pub const EXITPROCESS_EVENT_DEBUG_TERMINATE: ExitProcessEventReason = 2;
#[doc = "Reasons for an exit process event."]
pub type ExitProcessEventReason = ::libc::c_uchar;
#[doc = "Event relating to the exiting of a process."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExitProcessEvent {
    #[doc = "< Reason for exiting. See ExitProcessEventReason"]
    pub reason: ExitProcessEventReason,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExitProcessEvent"][::core::mem::size_of::<ExitProcessEvent>() - 1usize];
    ["Alignment of ExitProcessEvent"][::core::mem::align_of::<ExitProcessEvent>() - 1usize];
    ["Offset of field: ExitProcessEvent::reason"]
        [::core::mem::offset_of!(ExitProcessEvent, reason) - 0usize];
};
impl Default for ExitProcessEvent {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "Event relating to the attachment of a thread."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct AttachThreadEvent {
    #[doc = "< ID of the creating thread."]
    pub creator_thread_id: u32_,
    #[doc = "< Thread local storage."]
    pub thread_local_storage: u32_,
    #[doc = "< Entry point of the thread."]
    pub entry_point: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AttachThreadEvent"][::core::mem::size_of::<AttachThreadEvent>() - 12usize];
    ["Alignment of AttachThreadEvent"][::core::mem::align_of::<AttachThreadEvent>() - 4usize];
    ["Offset of field: AttachThreadEvent::creator_thread_id"]
        [::core::mem::offset_of!(AttachThreadEvent, creator_thread_id) - 0usize];
    ["Offset of field: AttachThreadEvent::thread_local_storage"]
        [::core::mem::offset_of!(AttachThreadEvent, thread_local_storage) - 4usize];
    ["Offset of field: AttachThreadEvent::entry_point"]
        [::core::mem::offset_of!(AttachThreadEvent, entry_point) - 8usize];
};
#[doc = "< Thread exited."]
pub const EXITTHREAD_EVENT_EXIT: ExitThreadEventReason = 0;
#[doc = "< Thread terminated."]
pub const EXITTHREAD_EVENT_TERMINATE: ExitThreadEventReason = 1;
#[doc = "< Process exited either normally or due to an uncaught exception."]
pub const EXITTHREAD_EVENT_EXIT_PROCESS: ExitThreadEventReason = 2;
#[doc = "< Process has been terminated by svcTerminateProcess."]
pub const EXITTHREAD_EVENT_TERMINATE_PROCESS: ExitThreadEventReason = 3;
#[doc = "Reasons for an exit thread event."]
pub type ExitThreadEventReason = ::libc::c_uchar;
#[doc = "Event relating to the exiting of a thread."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExitThreadEvent {
    #[doc = "< Reason for exiting. See ExitThreadEventReason"]
    pub reason: ExitThreadEventReason,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExitThreadEvent"][::core::mem::size_of::<ExitThreadEvent>() - 1usize];
    ["Alignment of ExitThreadEvent"][::core::mem::align_of::<ExitThreadEvent>() - 1usize];
    ["Offset of field: ExitThreadEvent::reason"]
        [::core::mem::offset_of!(ExitThreadEvent, reason) - 0usize];
};
impl Default for ExitThreadEvent {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "< Panic."]
pub const USERBREAK_PANIC: UserBreakType = 0;
#[doc = "< Assertion failed."]
pub const USERBREAK_ASSERT: UserBreakType = 1;
#[doc = "< User related."]
pub const USERBREAK_USER: UserBreakType = 2;
#[doc = "< Load RO."]
pub const USERBREAK_LOAD_RO: UserBreakType = 3;
#[doc = "< Unload RO."]
pub const USERBREAK_UNLOAD_RO: UserBreakType = 4;
#[doc = "Reasons for a user break."]
pub type UserBreakType = ::libc::c_uchar;
#[doc = "< Undefined instruction."]
pub const EXCEVENT_UNDEFINED_INSTRUCTION: ExceptionEventType = 0;
#[doc = "< Prefetch abort."]
pub const EXCEVENT_PREFETCH_ABORT: ExceptionEventType = 1;
#[doc = "< Data abort (other than the below kind)."]
pub const EXCEVENT_DATA_ABORT: ExceptionEventType = 2;
#[doc = "< Unaligned data access."]
pub const EXCEVENT_UNALIGNED_DATA_ACCESS: ExceptionEventType = 3;
#[doc = "< Attached break."]
pub const EXCEVENT_ATTACH_BREAK: ExceptionEventType = 4;
#[doc = "< Stop point reached."]
pub const EXCEVENT_STOP_POINT: ExceptionEventType = 5;
#[doc = "< User break occurred."]
pub const EXCEVENT_USER_BREAK: ExceptionEventType = 6;
#[doc = "< Debugger break occurred."]
pub const EXCEVENT_DEBUGGER_BREAK: ExceptionEventType = 7;
#[doc = "< Undefined syscall."]
pub const EXCEVENT_UNDEFINED_SYSCALL: ExceptionEventType = 8;
#[doc = "Reasons for an exception event."]
pub type ExceptionEventType = ::libc::c_uchar;
#[doc = "Event relating to fault exceptions (CPU exceptions other than stop points and undefined syscalls)."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FaultExceptionEvent {
    #[doc = "< FAR (for DATA ABORT / UNALIGNED DATA ACCESS), attempted syscall or 0"]
    pub fault_information: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FaultExceptionEvent"][::core::mem::size_of::<FaultExceptionEvent>() - 4usize];
    ["Alignment of FaultExceptionEvent"][::core::mem::align_of::<FaultExceptionEvent>() - 4usize];
    ["Offset of field: FaultExceptionEvent::fault_information"]
        [::core::mem::offset_of!(FaultExceptionEvent, fault_information) - 0usize];
};
#[doc = "< See SVC_STOP_POINT."]
pub const STOPPOINT_SVC_FF: StopPointType = 0;
#[doc = "< Breakpoint."]
pub const STOPPOINT_BREAKPOINT: StopPointType = 1;
#[doc = "< Watchpoint."]
pub const STOPPOINT_WATCHPOINT: StopPointType = 2;
#[doc = "Stop point types"]
pub type StopPointType = ::libc::c_uchar;
#[doc = "Event relating to stop points"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StopPointExceptionEvent {
    #[doc = "< Stop point type, see StopPointType."]
    pub type_: StopPointType,
    #[doc = "< FAR for Watchpoints, otherwise 0."]
    pub fault_information: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StopPointExceptionEvent"][::core::mem::size_of::<StopPointExceptionEvent>() - 8usize];
    ["Alignment of StopPointExceptionEvent"]
        [::core::mem::align_of::<StopPointExceptionEvent>() - 4usize];
    ["Offset of field: StopPointExceptionEvent::type_"]
        [::core::mem::offset_of!(StopPointExceptionEvent, type_) - 0usize];
    ["Offset of field: StopPointExceptionEvent::fault_information"]
        [::core::mem::offset_of!(StopPointExceptionEvent, fault_information) - 4usize];
};
impl Default for StopPointExceptionEvent {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "Event relating to svcBreak"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UserBreakExceptionEvent {
    #[doc = "< User break type, see UserBreakType."]
    pub type_: UserBreakType,
    #[doc = "< For LOAD_RO and UNLOAD_RO."]
    pub croInfo: u32_,
    #[doc = "< For LOAD_RO and UNLOAD_RO."]
    pub croInfoSize: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UserBreakExceptionEvent"]
        [::core::mem::size_of::<UserBreakExceptionEvent>() - 12usize];
    ["Alignment of UserBreakExceptionEvent"]
        [::core::mem::align_of::<UserBreakExceptionEvent>() - 4usize];
    ["Offset of field: UserBreakExceptionEvent::type_"]
        [::core::mem::offset_of!(UserBreakExceptionEvent, type_) - 0usize];
    ["Offset of field: UserBreakExceptionEvent::croInfo"]
        [::core::mem::offset_of!(UserBreakExceptionEvent, croInfo) - 4usize];
    ["Offset of field: UserBreakExceptionEvent::croInfoSize"]
        [::core::mem::offset_of!(UserBreakExceptionEvent, croInfoSize) - 8usize];
};
impl Default for UserBreakExceptionEvent {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "Event relating to svcBreakDebugProcess"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DebuggerBreakExceptionEvent {
    #[doc = "< IDs of the attached process's threads that were running on each core at the time of the svcBreakDebugProcess call, or -1 (only the first 2 values are meaningful on O3DS)."]
    pub thread_ids: [s32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DebuggerBreakExceptionEvent"]
        [::core::mem::size_of::<DebuggerBreakExceptionEvent>() - 16usize];
    ["Alignment of DebuggerBreakExceptionEvent"]
        [::core::mem::align_of::<DebuggerBreakExceptionEvent>() - 4usize];
    ["Offset of field: DebuggerBreakExceptionEvent::thread_ids"]
        [::core::mem::offset_of!(DebuggerBreakExceptionEvent, thread_ids) - 0usize];
};
#[doc = "Event relating to exceptions."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ExceptionEvent {
    #[doc = "< Type of event. See ExceptionEventType."]
    pub type_: ExceptionEventType,
    #[doc = "< Address of the exception."]
    pub address: u32_,
    pub __bindgen_anon_1: ExceptionEvent__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ExceptionEvent__bindgen_ty_1 {
    #[doc = "< Fault exception event data."]
    pub fault: FaultExceptionEvent,
    #[doc = "< Stop point exception event data."]
    pub stop_point: StopPointExceptionEvent,
    #[doc = "< User break exception event data."]
    pub user_break: UserBreakExceptionEvent,
    #[doc = "< Debugger break exception event data"]
    pub debugger_break: DebuggerBreakExceptionEvent,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExceptionEvent__bindgen_ty_1"]
        [::core::mem::size_of::<ExceptionEvent__bindgen_ty_1>() - 16usize];
    ["Alignment of ExceptionEvent__bindgen_ty_1"]
        [::core::mem::align_of::<ExceptionEvent__bindgen_ty_1>() - 4usize];
    ["Offset of field: ExceptionEvent__bindgen_ty_1::fault"]
        [::core::mem::offset_of!(ExceptionEvent__bindgen_ty_1, fault) - 0usize];
    ["Offset of field: ExceptionEvent__bindgen_ty_1::stop_point"]
        [::core::mem::offset_of!(ExceptionEvent__bindgen_ty_1, stop_point) - 0usize];
    ["Offset of field: ExceptionEvent__bindgen_ty_1::user_break"]
        [::core::mem::offset_of!(ExceptionEvent__bindgen_ty_1, user_break) - 0usize];
    ["Offset of field: ExceptionEvent__bindgen_ty_1::debugger_break"]
        [::core::mem::offset_of!(ExceptionEvent__bindgen_ty_1, debugger_break) - 0usize];
};
impl Default for ExceptionEvent__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExceptionEvent"][::core::mem::size_of::<ExceptionEvent>() - 24usize];
    ["Alignment of ExceptionEvent"][::core::mem::align_of::<ExceptionEvent>() - 4usize];
    ["Offset of field: ExceptionEvent::type_"]
        [::core::mem::offset_of!(ExceptionEvent, type_) - 0usize];
    ["Offset of field: ExceptionEvent::address"]
        [::core::mem::offset_of!(ExceptionEvent, address) - 4usize];
};
impl Default for ExceptionEvent {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "Event relating to the scheduler."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ScheduleInOutEvent {
    #[doc = "< Clock tick that the event occurred."]
    pub clock_tick: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScheduleInOutEvent"][::core::mem::size_of::<ScheduleInOutEvent>() - 8usize];
    ["Alignment of ScheduleInOutEvent"][::core::mem::align_of::<ScheduleInOutEvent>() - 8usize];
    ["Offset of field: ScheduleInOutEvent::clock_tick"]
        [::core::mem::offset_of!(ScheduleInOutEvent, clock_tick) - 0usize];
};
#[doc = "Event relating to syscalls."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SyscallInOutEvent {
    #[doc = "< Clock tick that the event occurred."]
    pub clock_tick: u64_,
    #[doc = "< Syscall sent/received."]
    pub syscall: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SyscallInOutEvent"][::core::mem::size_of::<SyscallInOutEvent>() - 16usize];
    ["Alignment of SyscallInOutEvent"][::core::mem::align_of::<SyscallInOutEvent>() - 8usize];
    ["Offset of field: SyscallInOutEvent::clock_tick"]
        [::core::mem::offset_of!(SyscallInOutEvent, clock_tick) - 0usize];
    ["Offset of field: SyscallInOutEvent::syscall"]
        [::core::mem::offset_of!(SyscallInOutEvent, syscall) - 8usize];
};
#[doc = "Event relating to debug output."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct OutputStringEvent {
    #[doc = "< Address of the outputted string."]
    pub string_addr: u32_,
    #[doc = "< Size of the outputted string."]
    pub string_size: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OutputStringEvent"][::core::mem::size_of::<OutputStringEvent>() - 8usize];
    ["Alignment of OutputStringEvent"][::core::mem::align_of::<OutputStringEvent>() - 4usize];
    ["Offset of field: OutputStringEvent::string_addr"]
        [::core::mem::offset_of!(OutputStringEvent, string_addr) - 0usize];
    ["Offset of field: OutputStringEvent::string_size"]
        [::core::mem::offset_of!(OutputStringEvent, string_size) - 4usize];
};
#[doc = "Event relating to the mapping of memory."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MapEvent {
    #[doc = "< Mapped address."]
    pub mapped_addr: u32_,
    #[doc = "< Mapped size."]
    pub mapped_size: u32_,
    #[doc = "< Memory permissions. See MemPerm."]
    pub memperm: MemPerm,
    #[doc = "< Memory state. See MemState."]
    pub memstate: MemState,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MapEvent"][::core::mem::size_of::<MapEvent>() - 16usize];
    ["Alignment of MapEvent"][::core::mem::align_of::<MapEvent>() - 4usize];
    ["Offset of field: MapEvent::mapped_addr"]
        [::core::mem::offset_of!(MapEvent, mapped_addr) - 0usize];
    ["Offset of field: MapEvent::mapped_size"]
        [::core::mem::offset_of!(MapEvent, mapped_size) - 4usize];
    ["Offset of field: MapEvent::memperm"][::core::mem::offset_of!(MapEvent, memperm) - 8usize];
    ["Offset of field: MapEvent::memstate"][::core::mem::offset_of!(MapEvent, memstate) - 12usize];
};
impl Default for MapEvent {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "< Process attached event."]
pub const DBGEVENT_ATTACH_PROCESS: DebugEventType = 0;
#[doc = "< Thread attached event."]
pub const DBGEVENT_ATTACH_THREAD: DebugEventType = 1;
#[doc = "< Thread exit event."]
pub const DBGEVENT_EXIT_THREAD: DebugEventType = 2;
#[doc = "< Process exit event."]
pub const DBGEVENT_EXIT_PROCESS: DebugEventType = 3;
#[doc = "< Exception event."]
pub const DBGEVENT_EXCEPTION: DebugEventType = 4;
#[doc = "< DLL load event."]
pub const DBGEVENT_DLL_LOAD: DebugEventType = 5;
#[doc = "< DLL unload event."]
pub const DBGEVENT_DLL_UNLOAD: DebugEventType = 6;
#[doc = "< Schedule in event."]
pub const DBGEVENT_SCHEDULE_IN: DebugEventType = 7;
#[doc = "< Schedule out event."]
pub const DBGEVENT_SCHEDULE_OUT: DebugEventType = 8;
#[doc = "< Syscall in event."]
pub const DBGEVENT_SYSCALL_IN: DebugEventType = 9;
#[doc = "< Syscall out event."]
pub const DBGEVENT_SYSCALL_OUT: DebugEventType = 10;
#[doc = "< Output string event."]
pub const DBGEVENT_OUTPUT_STRING: DebugEventType = 11;
#[doc = "< Map event."]
pub const DBGEVENT_MAP: DebugEventType = 12;
#[doc = "Debug event type."]
pub type DebugEventType = ::libc::c_uchar;
#[doc = "Information about a debug event."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DebugEventInfo {
    #[doc = "< Type of event. See DebugEventType"]
    pub type_: DebugEventType,
    #[doc = "< ID of the thread."]
    pub thread_id: u32_,
    #[doc = "< Flags. Bit0 means that svcContinueDebugEvent needs to be called for this event (except for EXIT PROCESS events, where this flag is disregarded)."]
    pub flags: u32_,
    #[doc = "< Always 0."]
    pub remnants: [u8_; 4usize],
    pub __bindgen_anon_1: DebugEventInfo__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DebugEventInfo__bindgen_ty_1 {
    #[doc = "< Process attachment event data."]
    pub attach_process: AttachProcessEvent,
    #[doc = "< Thread attachment event data."]
    pub attach_thread: AttachThreadEvent,
    #[doc = "< Thread exit event data."]
    pub exit_thread: ExitThreadEvent,
    #[doc = "< Process exit event data."]
    pub exit_process: ExitProcessEvent,
    #[doc = "< Exception event data."]
    pub exception: ExceptionEvent,
    #[doc = "< Schedule in/out event data."]
    pub scheduler: ScheduleInOutEvent,
    #[doc = "< Syscall in/out event data."]
    pub syscall: SyscallInOutEvent,
    #[doc = "< Output string event data."]
    pub output_string: OutputStringEvent,
    #[doc = "< Map event data."]
    pub map: MapEvent,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DebugEventInfo__bindgen_ty_1"]
        [::core::mem::size_of::<DebugEventInfo__bindgen_ty_1>() - 24usize];
    ["Alignment of DebugEventInfo__bindgen_ty_1"]
        [::core::mem::align_of::<DebugEventInfo__bindgen_ty_1>() - 8usize];
    ["Offset of field: DebugEventInfo__bindgen_ty_1::attach_process"]
        [::core::mem::offset_of!(DebugEventInfo__bindgen_ty_1, attach_process) - 0usize];
    ["Offset of field: DebugEventInfo__bindgen_ty_1::attach_thread"]
        [::core::mem::offset_of!(DebugEventInfo__bindgen_ty_1, attach_thread) - 0usize];
    ["Offset of field: DebugEventInfo__bindgen_ty_1::exit_thread"]
        [::core::mem::offset_of!(DebugEventInfo__bindgen_ty_1, exit_thread) - 0usize];
    ["Offset of field: DebugEventInfo__bindgen_ty_1::exit_process"]
        [::core::mem::offset_of!(DebugEventInfo__bindgen_ty_1, exit_process) - 0usize];
    ["Offset of field: DebugEventInfo__bindgen_ty_1::exception"]
        [::core::mem::offset_of!(DebugEventInfo__bindgen_ty_1, exception) - 0usize];
    ["Offset of field: DebugEventInfo__bindgen_ty_1::scheduler"]
        [::core::mem::offset_of!(DebugEventInfo__bindgen_ty_1, scheduler) - 0usize];
    ["Offset of field: DebugEventInfo__bindgen_ty_1::syscall"]
        [::core::mem::offset_of!(DebugEventInfo__bindgen_ty_1, syscall) - 0usize];
    ["Offset of field: DebugEventInfo__bindgen_ty_1::output_string"]
        [::core::mem::offset_of!(DebugEventInfo__bindgen_ty_1, output_string) - 0usize];
    ["Offset of field: DebugEventInfo__bindgen_ty_1::map"]
        [::core::mem::offset_of!(DebugEventInfo__bindgen_ty_1, map) - 0usize];
};
impl Default for DebugEventInfo__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DebugEventInfo"][::core::mem::size_of::<DebugEventInfo>() - 40usize];
    ["Alignment of DebugEventInfo"][::core::mem::align_of::<DebugEventInfo>() - 8usize];
    ["Offset of field: DebugEventInfo::type_"]
        [::core::mem::offset_of!(DebugEventInfo, type_) - 0usize];
    ["Offset of field: DebugEventInfo::thread_id"]
        [::core::mem::offset_of!(DebugEventInfo, thread_id) - 4usize];
    ["Offset of field: DebugEventInfo::flags"]
        [::core::mem::offset_of!(DebugEventInfo, flags) - 8usize];
    ["Offset of field: DebugEventInfo::remnants"]
        [::core::mem::offset_of!(DebugEventInfo, remnants) - 12usize];
};
impl Default for DebugEventInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "< Inhibit user-defined CPU exception handlers (including watchpoints and breakpoints, regardless of any svcKernelSetState call)."]
pub const DBG_INHIBIT_USER_CPU_EXCEPTION_HANDLERS: DebugFlags = 1;
#[doc = "< Signal fault exception events. See FaultExceptionEvent."]
pub const DBG_SIGNAL_FAULT_EXCEPTION_EVENTS: DebugFlags = 2;
#[doc = "< Signal schedule in/out events. See ScheduleInOutEvent."]
pub const DBG_SIGNAL_SCHEDULE_EVENTS: DebugFlags = 4;
#[doc = "< Signal syscall in/out events. See SyscallInOutEvent."]
pub const DBG_SIGNAL_SYSCALL_EVENTS: DebugFlags = 8;
#[doc = "< Signal map events. See MapEvent."]
pub const DBG_SIGNAL_MAP_EVENTS: DebugFlags = 16;
#[doc = "Debug flags for an attached process, set by svcContinueDebugEvent"]
pub type DebugFlags = ::libc::c_uchar;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ThreadContext {
    #[doc = "< CPU registers."]
    pub cpu_registers: CpuRegisters,
    #[doc = "< FPU registers."]
    pub fpu_registers: FpuRegisters,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ThreadContext"][::core::mem::size_of::<ThreadContext>() - 204usize];
    ["Alignment of ThreadContext"][::core::mem::align_of::<ThreadContext>() - 4usize];
    ["Offset of field: ThreadContext::cpu_registers"]
        [::core::mem::offset_of!(ThreadContext, cpu_registers) - 0usize];
    ["Offset of field: ThreadContext::fpu_registers"]
        [::core::mem::offset_of!(ThreadContext, fpu_registers) - 68usize];
};
impl Default for ThreadContext {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "< Control r0-r12."]
pub const THREADCONTEXT_CONTROL_CPU_GPRS: ThreadContextControlFlags = 1;
#[doc = "< Control sp, lr, pc, cpsr."]
pub const THREADCONTEXT_CONTROL_CPU_SPRS: ThreadContextControlFlags = 2;
#[doc = "< Control d0-d15 (or s0-s31)."]
pub const THREADCONTEXT_CONTROL_FPU_GPRS: ThreadContextControlFlags = 4;
#[doc = "< Control fpscr, fpexc."]
pub const THREADCONTEXT_CONTROL_FPU_SPRS: ThreadContextControlFlags = 8;
#[doc = "< Control r0-r12, sp, lr, pc, cpsr."]
pub const THREADCONTEXT_CONTROL_CPU_REGS: ThreadContextControlFlags = 3;
#[doc = "< Control d0-d15, fpscr, fpexc."]
pub const THREADCONTEXT_CONTROL_FPU_REGS: ThreadContextControlFlags = 12;
#[doc = "< Control all of the above."]
pub const THREADCONTEXT_CONTROL_ALL: ThreadContextControlFlags = 15;
#[doc = "Control flags for svcGetDebugThreadContext and svcSetDebugThreadContext"]
pub type ThreadContextControlFlags = ::libc::c_uchar;
#[doc = "< Thread priority."]
pub const DBGTHREAD_PARAMETER_PRIORITY: DebugThreadParameter = 0;
#[doc = "< Low scheduling mask."]
pub const DBGTHREAD_PARAMETER_SCHEDULING_MASK_LOW: DebugThreadParameter = 1;
#[doc = "< Ideal processor."]
pub const DBGTHREAD_PARAMETER_CPU_IDEAL: DebugThreadParameter = 2;
#[doc = "< Processor that created the threod."]
pub const DBGTHREAD_PARAMETER_CPU_CREATOR: DebugThreadParameter = 3;
#[doc = "Thread parameter field for svcGetDebugThreadParameter"]
pub type DebugThreadParameter = ::libc::c_uchar;
#[doc = "Information on address space for process. All sizes are in pages (0x1000 bytes)"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CodeSetHeader {
    #[doc = "< ASCII name of codeset"]
    pub name: [u8_; 8usize],
    #[doc = "< Version field of codeset (unused)"]
    pub version: u16_,
    #[doc = "< Padding"]
    pub padding: [u16_; 3usize],
    #[doc = "< .text start address"]
    pub text_addr: u32_,
    #[doc = "< .text number of pages"]
    pub text_size: u32_,
    #[doc = "< .rodata start address"]
    pub ro_addr: u32_,
    #[doc = "< .rodata number of pages"]
    pub ro_size: u32_,
    #[doc = "< .data, .bss start address"]
    pub rw_addr: u32_,
    #[doc = "< .data number of pages"]
    pub rw_size: u32_,
    #[doc = "< total pages for .text (aligned)"]
    pub text_size_total: u32_,
    #[doc = "< total pages for .rodata (aligned)"]
    pub ro_size_total: u32_,
    #[doc = "< total pages for .data, .bss (aligned)"]
    pub rw_size_total: u32_,
    #[doc = "< Padding"]
    pub padding2: u32_,
    #[doc = "< Program ID"]
    pub program_id: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CodeSetHeader"][::core::mem::size_of::<CodeSetHeader>() - 64usize];
    ["Alignment of CodeSetHeader"][::core::mem::align_of::<CodeSetHeader>() - 8usize];
    ["Offset of field: CodeSetHeader::name"][::core::mem::offset_of!(CodeSetHeader, name) - 0usize];
    ["Offset of field: CodeSetHeader::version"]
        [::core::mem::offset_of!(CodeSetHeader, version) - 8usize];
    ["Offset of field: CodeSetHeader::padding"]
        [::core::mem::offset_of!(CodeSetHeader, padding) - 10usize];
    ["Offset of field: CodeSetHeader::text_addr"]
        [::core::mem::offset_of!(CodeSetHeader, text_addr) - 16usize];
    ["Offset of field: CodeSetHeader::text_size"]
        [::core::mem::offset_of!(CodeSetHeader, text_size) - 20usize];
    ["Offset of field: CodeSetHeader::ro_addr"]
        [::core::mem::offset_of!(CodeSetHeader, ro_addr) - 24usize];
    ["Offset of field: CodeSetHeader::ro_size"]
        [::core::mem::offset_of!(CodeSetHeader, ro_size) - 28usize];
    ["Offset of field: CodeSetHeader::rw_addr"]
        [::core::mem::offset_of!(CodeSetHeader, rw_addr) - 32usize];
    ["Offset of field: CodeSetHeader::rw_size"]
        [::core::mem::offset_of!(CodeSetHeader, rw_size) - 36usize];
    ["Offset of field: CodeSetHeader::text_size_total"]
        [::core::mem::offset_of!(CodeSetHeader, text_size_total) - 40usize];
    ["Offset of field: CodeSetHeader::ro_size_total"]
        [::core::mem::offset_of!(CodeSetHeader, ro_size_total) - 44usize];
    ["Offset of field: CodeSetHeader::rw_size_total"]
        [::core::mem::offset_of!(CodeSetHeader, rw_size_total) - 48usize];
    ["Offset of field: CodeSetHeader::padding2"]
        [::core::mem::offset_of!(CodeSetHeader, padding2) - 52usize];
    ["Offset of field: CodeSetHeader::program_id"]
        [::core::mem::offset_of!(CodeSetHeader, program_id) - 56usize];
};
#[doc = "Information for the main thread of a process."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StartupInfo {
    #[doc = "< Priority of the main thread."]
    pub priority: ::libc::c_int,
    #[doc = "< Size of the stack of the main thread."]
    pub stack_size: u32_,
    #[doc = "< Unused on retail kernel."]
    pub argc: ::libc::c_int,
    #[doc = "< Unused on retail kernel."]
    pub argv: *mut u16_,
    #[doc = "< Unused on retail kernel."]
    pub envp: *mut u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StartupInfo"][::core::mem::size_of::<StartupInfo>() - 20usize];
    ["Alignment of StartupInfo"][::core::mem::align_of::<StartupInfo>() - 4usize];
    ["Offset of field: StartupInfo::priority"]
        [::core::mem::offset_of!(StartupInfo, priority) - 0usize];
    ["Offset of field: StartupInfo::stack_size"]
        [::core::mem::offset_of!(StartupInfo, stack_size) - 4usize];
    ["Offset of field: StartupInfo::argc"][::core::mem::offset_of!(StartupInfo, argc) - 8usize];
    ["Offset of field: StartupInfo::argv"][::core::mem::offset_of!(StartupInfo, argv) - 12usize];
    ["Offset of field: StartupInfo::envp"][::core::mem::offset_of!(StartupInfo, envp) - 16usize];
};
impl Default for StartupInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = "Gets the thread local storage buffer.\n # Returns\n\nThe thread local storage buffer."]
    #[link_name = "getThreadLocalStorage__extern"]
    pub fn getThreadLocalStorage() -> *mut ::libc::c_void;
}
unsafe extern "C" {
    #[doc = "Gets the thread command buffer.\n # Returns\n\nThe thread command buffer."]
    #[link_name = "getThreadCommandBuffer__extern"]
    pub fn getThreadCommandBuffer() -> *mut u32_;
}
unsafe extern "C" {
    #[doc = "Gets the thread static buffer.\n # Returns\n\nThe thread static buffer."]
    #[link_name = "getThreadStaticBuffers__extern"]
    pub fn getThreadStaticBuffers() -> *mut u32_;
}
unsafe extern "C" {
    #[doc = "Writes the default DMA device config that the kernel uses when DMACFG_*_IS_DEVICE and DMACFG_*_USE_CFG are not set"]
    #[link_name = "dmaDeviceConfigInitDefault__extern"]
    pub fn dmaDeviceConfigInitDefault(cfg: *mut DmaDeviceConfig);
}
unsafe extern "C" {
    #[doc = "Initializes a DmaConfig instance with sane defaults for RAM<>RAM tranfers"]
    #[link_name = "dmaConfigInitDefault__extern"]
    pub fn dmaConfigInitDefault(cfg: *mut DmaConfig);
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Memory management\n# *\n* Controls memory mapping\n # Arguments\n\n* `addr_out` (direction out) - The virtual address resulting from the operation. Usually the same as addr0.\n * `addr0` - The virtual address to be used for the operation.\n * `addr1` - The virtual address to be (un)mirrored by `addr0` when using MEMOP_MAP or MEMOP_UNMAP.\n It has to be pointing to a RW memory.\n* Use NULL if the operation is MEMOP_FREE or MEMOP_ALLOC.\n * `size` - The requested size for MEMOP_ALLOC and MEMOP_ALLOC_LINEAR.\n * `op` - Operation flags. See MemOp.\n * `perm` - A combination of MEMPERM_READ and MEMPERM_WRITE. Using MEMPERM_EXECUTE will return an error.\n Value 0 is used when unmapping memory.\n*\n* If a memory is mapped for two or more addresses, you have to use MEMOP_UNMAP before being able to MEMOP_FREE it.\n* MEMOP_MAP will fail if `addr1` was already mapped to another address.\n\n* More information is available at http://3dbrew.org/wiki/SVC#Memory_Mapping.\n*\n* [`svcControlProcessMemory`]\n/"]
    pub fn svcControlMemory(
        addr_out: *mut u32_,
        addr0: u32_,
        addr1: u32_,
        size: u32_,
        op: MemOp,
        perm: MemPerm,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Controls the memory mapping of a process\n # Arguments\n\n* `addr0` - The virtual address to map\n * `addr1` - The virtual address to be mapped by `addr0`\n * `type` - Only operations MEMOP_MAP, MEMOP_UNMAP and MEMOP_PROT are allowed.\n\n This is the only SVC which allows mapping executable memory.\n Using MEMOP_PROT will change the memory permissions of an already mapped memory.\n\n > **Note:** The pseudo handle for the current process is not supported by this service call.\n [`svcControlProcess`]"]
    pub fn svcControlProcessMemory(
        process: Handle,
        addr0: u32_,
        addr1: u32_,
        size: u32_,
        type_: u32_,
        perm: u32_,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Creates a block of shared memory\n # Arguments\n\n* `memblock` (direction out) - Pointer to store the handle of the block\n * `addr` - Address of the memory to map, page-aligned. So its alignment must be 0x1000.\n * `size` - Size of the memory to map, a multiple of 0x1000.\n * `my_perm` - Memory permissions for the current process\n * `other_perm` - Memory permissions for the other processes\n\n > **Note:** The shared memory block, and its rights, are destroyed when the handle is closed."]
    pub fn svcCreateMemoryBlock(
        memblock: *mut Handle,
        addr: u32_,
        size: u32_,
        my_perm: MemPerm,
        other_perm: MemPerm,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Maps a block of shared memory\n # Arguments\n\n* `memblock` - Handle of the block\n * `addr` - Address of the memory to map, page-aligned. So its alignment must be 0x1000.\n * `my_perm` - Memory permissions for the current process\n * `other_perm` - Memory permissions for the other processes\n\n > **Note:** The shared memory block, and its rights, are destroyed when the handle is closed."]
    pub fn svcMapMemoryBlock(
        memblock: Handle,
        addr: u32_,
        my_perm: MemPerm,
        other_perm: MemPerm,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Maps a block of process memory, starting from address 0x00100000.\n # Arguments\n\n* `process` - Handle of the process.\n * `destAddress` - Address of the block of memory to map, in the current (destination) process.\n * `size` - Size of the block of memory to map (truncated to a multiple of 0x1000 bytes)."]
    pub fn svcMapProcessMemory(process: Handle, destAddress: u32_, size: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Unmaps a block of process memory, starting from address 0x00100000.\n # Arguments\n\n* `process` - Handle of the process.\n * `destAddress` - Address of the block of memory to unmap, in the current (destination) process.\n * `size` - Size of the block of memory to unmap (truncated to a multiple of 0x1000 bytes)."]
    pub fn svcUnmapProcessMemory(process: Handle, destAddress: u32_, size: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Unmaps a block of shared memory\n # Arguments\n\n* `memblock` - Handle of the block\n * `addr` - Address of the memory to unmap, page-aligned. So its alignment must be 0x1000."]
    pub fn svcUnmapMemoryBlock(memblock: Handle, addr: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Queries memory information.\n # Arguments\n\n* `info` (direction out) - Pointer to output memory info to.\n * `out` - Pointer to output page info to.\n * `addr` - Virtual memory address to query."]
    pub fn svcQueryMemory(info: *mut MemInfo, out: *mut PageInfo, addr: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Queries process memory information.\n # Arguments\n\n* `info` (direction out) - Pointer to output memory info to.\n * `out` (direction out) - Pointer to output page info to.\n * `process` - Process to query memory from.\n * `addr` - Virtual memory address to query."]
    pub fn svcQueryProcessMemory(
        info: *mut MemInfo,
        out: *mut PageInfo,
        process: Handle,
        addr: u32_,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Process management\n# *\n* Gets the handle of a process.\n # Arguments\n\n* `process` (direction out) - The handle of the process\n * `processId` - The ID of the process to open\n/"]
    pub fn svcOpenProcess(process: *mut Handle, processId: u32_) -> Result;
}
unsafe extern "C" {
    #[doc = "Exits the current process."]
    pub fn svcExitProcess() -> !;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Terminates a process.\n # Arguments\n\n* `process` - Handle of the process to terminate."]
    pub fn svcTerminateProcess(process: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets information about a process.\n # Arguments\n\n* `out` (direction out) - Pointer to output process info to.\n * `process` - Handle of the process to get information about.\n * `type` - Type of information to retreieve."]
    pub fn svcGetProcessInfo(out: *mut s64, process: Handle, type_: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the ID of a process.\n # Arguments\n\n* `out` (direction out) - Pointer to output the process ID to.\n * `handle` - Handle of the process to get the ID of."]
    pub fn svcGetProcessId(out: *mut u32_, handle: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets a list of running processes.\n # Arguments\n\n* `processCount` (direction out) - Pointer to output the process count to.\n * `processIds` (direction out) - Pointer to output the process IDs to.\n * `processIdMaxCount` - Maximum number of process IDs."]
    pub fn svcGetProcessList(
        processCount: *mut s32,
        processIds: *mut u32_,
        processIdMaxCount: s32,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets a list of the threads of a process.\n # Arguments\n\n* `threadCount` (direction out) - Pointer to output the thread count to.\n * `threadIds` (direction out) - Pointer to output the thread IDs to.\n * `threadIdMaxCount` - Maximum number of thread IDs.\n * `process` - Process handle to list the threads of."]
    pub fn svcGetThreadList(
        threadCount: *mut s32,
        threadIds: *mut u32_,
        threadIdMaxCount: s32,
        process: Handle,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Creates a port.\n # Arguments\n\n* `portServer` (direction out) - Pointer to output the port server handle to.\n * `portClient` (direction out) - Pointer to output the port client handle to.\n * `name` - Name of the port.\n * `maxSessions` - Maximum number of sessions that can connect to the port."]
    pub fn svcCreatePort(
        portServer: *mut Handle,
        portClient: *mut Handle,
        name: *const ::libc::c_char,
        maxSessions: s32,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Connects to a port.\n # Arguments\n\n* `out` (direction out) - Pointer to output the port handle to.\n * `portName` - Name of the port."]
    pub fn svcConnectToPort(out: *mut Handle, portName: *const ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets up virtual address space for a new process.\n # Arguments\n\n* `out` (direction out) - Pointer to output the codeset handle to.\n * `info` - Codeset header, contains process name, titleId and segment info.\n * `textSegmentLma` - Address of executable segment in caller's address space.\n * `roSegmentLma` - Address of read-only segment in caller's address space.\n * `dataSegmentLma` - Address of read-write segment in caller's address space.\n > **Note:** On success, the provided segments are unmapped from the caller's address space."]
    pub fn svcCreateCodeSet(
        out: *mut Handle,
        info: *const CodeSetHeader,
        textSegmentLma: u32_,
        roSegmentLma: u32_,
        dataSegmentLma: u32_,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Create a new process.\n # Arguments\n\n* `out` (direction out) - Pointer to output the process handle to.\n * `codeset` - Codeset created for this process.\n * `arm11KernelCaps` - Arm11 Kernel Capabilities from exheader.\n * `numArm11KernelCaps` - Number of kernel capabilities."]
    pub fn svcCreateProcess(
        out: *mut Handle,
        codeset: Handle,
        arm11KernelCaps: *const u32_,
        numArm11KernelCaps: s32,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets a process's affinity mask.\n # Arguments\n\n* `affinitymask` (direction out) - Pointer to store the affinity masks.\n * `process` - Handle of the process.\n * `processorcount` - Number of processors."]
    pub fn svcGetProcessAffinityMask(
        affinitymask: *mut u8_,
        process: Handle,
        processorcount: s32,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets a process's affinity mask.\n # Arguments\n\n* `process` - Handle of the process.\n * `affinitymask` - Pointer to retrieve the affinity masks from.\n * `processorcount` - Number of processors."]
    pub fn svcSetProcessAffinityMask(
        process: Handle,
        affinitymask: *const u8_,
        processorcount: s32,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets a process's ideal processor.\n # Arguments\n\n* `processorid` (direction out) - Pointer to store the ID of the process's ideal processor.\n * `process` - Handle of the process."]
    pub fn svcGetProcessIdealProcessor(processorid: *mut s32, process: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets a process's ideal processor.\n # Arguments\n\n* `process` - Handle of the process.\n * `processorid` - ID of the process's ideal processor."]
    pub fn svcSetProcessIdealProcessor(process: Handle, processorid: s32) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Launches the main thread of the process.\n # Arguments\n\n* `process` - Handle of the process.\n * `info` - Pointer to a StartupInfo structure describing information for the main thread."]
    pub fn svcRun(process: Handle, info: *const StartupInfo) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Multithreading\n# *\n* Creates a new thread.\n # Arguments\n\n* `thread` (direction out) - The thread handle\n * `entrypoint` - The function that will be called first upon thread creation\n * `arg` - The argument passed to `entrypoint`\n * `stack_top` - The top of the thread's stack. Must be 0x8 bytes mem-aligned.\n * `thread_priority` - Low values gives the thread higher priority.\n For userland apps, this has to be within the range [0x18;0x3F]\n* * `processor_id` - The id of the processor the thread should be ran on. Those are labelled starting from 0.\n For old 3ds it has to be <2, and for new 3DS <4.\n* Value -1 means all CPUs and -2 read from the Exheader.\n*\n* The processor with ID 1 is the system processor.\n* To enable multi-threading on this core you need to call APT_SetAppCpuTimeLimit at least once with a non-zero value.\n*\n* Since a thread is considered as a waitable object, you can use svcWaitSynchronization\n and svcWaitSynchronizationN to join with it.\n\n* > **Note:** The kernel will clear the `stack_top's` address low 3 bits to make sure it is 0x8-bytes aligned.\n/"]
    pub fn svcCreateThread(
        thread: *mut Handle,
        entrypoint: ThreadFunc,
        arg: u32_,
        stack_top: *mut u32_,
        thread_priority: s32,
        processor_id: s32,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the handle of a thread.\n # Arguments\n\n* `thread` (direction out) - The handle of the thread\n * `process` - The ID of the process linked to the thread"]
    pub fn svcOpenThread(thread: *mut Handle, process: Handle, threadId: u32_) -> Result;
}
unsafe extern "C" {
    #[doc = "Exits the current thread.\n\n This will trigger a state change and hence release all svcWaitSynchronization operations.\n It means that you can join a thread by calling svcWaitSynchronization(threadHandle,yourtimeout); "]
    pub fn svcExitThread() -> !;
}
unsafe extern "C" {
    #[doc = "Puts the current thread to sleep.\n # Arguments\n\n* `ns` - The minimum number of nanoseconds to sleep for."]
    pub fn svcSleepThread(ns: s64);
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Retrieves the priority of a thread."]
    pub fn svcGetThreadPriority(out: *mut s32, handle: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Changes the priority of a thread\n # Arguments\n\n* `prio` - For userland apps, this has to be within the range [0x18;0x3F]\n\n Low values gives the thread higher priority."]
    pub fn svcSetThreadPriority(thread: Handle, prio: s32) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets a thread's affinity mask.\n # Arguments\n\n* `affinitymask` (direction out) - Pointer to output the affinity masks to.\n * `thread` - Handle of the thread.\n * `processorcount` - Number of processors."]
    pub fn svcGetThreadAffinityMask(
        affinitymask: *mut u8_,
        thread: Handle,
        processorcount: s32,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets a thread's affinity mask.\n # Arguments\n\n* `thread` - Handle of the thread.\n * `affinitymask` - Pointer to retrieve the affinity masks from.\n * `processorcount` - Number of processors."]
    pub fn svcSetThreadAffinityMask(
        thread: Handle,
        affinitymask: *const u8_,
        processorcount: s32,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets a thread's ideal processor.\n # Arguments\n\n* `processorid` (direction out) - Pointer to output the ID of the thread's ideal processor to.\n * `thread` - Handle of the thread."]
    pub fn svcGetThreadIdealProcessor(processorid: *mut s32, thread: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets a thread's ideal processor.\n # Arguments\n\n* `thread` - Handle of the thread.\n * `processorid` - ID of the thread's ideal processor."]
    pub fn svcSetThreadIdealProcessor(thread: Handle, processorid: s32) -> Result;
}
unsafe extern "C" {
    #[doc = "Returns the ID of the processor the current thread is running on.\n [`svcCreateThread`]"]
    pub fn svcGetProcessorID() -> s32;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the ID of a thread.\n # Arguments\n\n* `out` (direction out) - Pointer to output the thread ID of the thread `handle` to.\n * `handle` - Handle of the thread."]
    pub fn svcGetThreadId(out: *mut u32_, handle: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the resource limit set of a process.\n # Arguments\n\n* `resourceLimit` (direction out) - Pointer to output the resource limit set handle to.\n * `process` - Process to get the resource limits of."]
    pub fn svcGetResourceLimit(resourceLimit: *mut Handle, process: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the value limits of a resource limit set.\n # Arguments\n\n* `values` (direction out) - Pointer to output the value limits to.\n * `resourceLimit` - Resource limit set to use.\n * `names` - Resource limit names to get the limits of.\n * `nameCount` - Number of resource limit names."]
    pub fn svcGetResourceLimitLimitValues(
        values: *mut s64,
        resourceLimit: Handle,
        names: *mut ResourceLimitType,
        nameCount: s32,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the values of a resource limit set.\n # Arguments\n\n* `values` (direction out) - Pointer to output the values to.\n * `resourceLimit` - Resource limit set to use.\n * `names` - Resource limit names to get the values of.\n * `nameCount` - Number of resource limit names."]
    pub fn svcGetResourceLimitCurrentValues(
        values: *mut s64,
        resourceLimit: Handle,
        names: *mut ResourceLimitType,
        nameCount: s32,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets the resource limit set of a process.\n # Arguments\n\n* `process` - Process to set the resource limit set to.\n * `resourceLimit` - Resource limit set handle."]
    pub fn svcSetProcessResourceLimits(process: Handle, resourceLimit: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Creates a resource limit set.\n # Arguments\n\n* `resourceLimit` (direction out) - Pointer to output the resource limit set handle to."]
    pub fn svcCreateResourceLimit(resourceLimit: *mut Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets the value limits of a resource limit set.\n # Arguments\n\n* `resourceLimit` - Resource limit set to use.\n * `names` - Resource limit names to set the limits of.\n * `values` - Value limits to set. The high 32 bits of RESLIMIT_COMMIT are used to\nset APPMEMALLOC in configuration memory, otherwise those bits are unused.\n * `nameCount` - Number of resource limit names."]
    pub fn svcSetResourceLimitValues(
        resourceLimit: Handle,
        names: *const ResourceLimitType,
        values: *const s64,
        nameCount: s32,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the process ID of a thread.\n # Arguments\n\n* `out` (direction out) - Pointer to output the process ID of the thread `handle` to.\n * `handle` - Handle of the thread.\n [`svcOpenProcess`]"]
    pub fn svcGetProcessIdOfThread(out: *mut u32_, handle: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Checks if a thread handle is valid.\n This requests always return an error when called, it only checks if the handle is a thread or not.\n # Returns\n\n0xD8E007ED (BAD_ENUM) if the Handle is a Thread Handle\n 0xD8E007F7 (BAD_HANDLE) if it isn't."]
    pub fn svcGetThreadInfo(out: *mut s64, thread: Handle, type_: ThreadInfoType) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Synchronization\n# *\n* Creates a mutex.\n # Arguments\n\n* `mutex` (direction out) - Pointer to output the handle of the created mutex to.\n * `initially_locked` - Whether the mutex should be initially locked.\n/"]
    pub fn svcCreateMutex(mutex: *mut Handle, initially_locked: bool) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Releases a mutex.\n # Arguments\n\n* `handle` - Handle of the mutex."]
    pub fn svcReleaseMutex(handle: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Creates a semaphore.\n # Arguments\n\n* `semaphore` (direction out) - Pointer to output the handle of the created semaphore to.\n * `initial_count` - Initial count of the semaphore.\n * `max_count` - Maximum count of the semaphore."]
    pub fn svcCreateSemaphore(semaphore: *mut Handle, initial_count: s32, max_count: s32)
    -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Releases a semaphore.\n # Arguments\n\n* `count` (direction out) - Pointer to output the current count of the semaphore to.\n * `semaphore` - Handle of the semaphore.\n * `release_count` - Number to increase the semaphore count by."]
    pub fn svcReleaseSemaphore(count: *mut s32, semaphore: Handle, release_count: s32) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Creates an event handle.\n # Arguments\n\n* `event` (direction out) - Pointer to output the created event handle to.\n * `reset_type` - Type of reset the event uses (RESET_ONESHOT/RESET_STICKY)."]
    pub fn svcCreateEvent(event: *mut Handle, reset_type: ResetType) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Signals an event.\n # Arguments\n\n* `handle` - Handle of the event to signal."]
    pub fn svcSignalEvent(handle: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Clears an event.\n # Arguments\n\n* `handle` - Handle of the event to clear."]
    pub fn svcClearEvent(handle: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Waits for synchronization on a handle.\n # Arguments\n\n* `handle` - Handle to wait on.\n * `nanoseconds` - Maximum nanoseconds to wait for."]
    pub fn svcWaitSynchronization(handle: Handle, nanoseconds: s64) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Waits for synchronization on multiple handles.\n # Arguments\n\n* `out` (direction out) - Pointer to output the index of the synchronized handle to.\n * `handles` - Handles to wait on.\n * `handles_num` - Number of handles.\n * `wait_all` - Whether to wait for synchronization on all handles.\n * `nanoseconds` - Maximum nanoseconds to wait for."]
    pub fn svcWaitSynchronizationN(
        out: *mut s32,
        handles: *const Handle,
        handles_num: s32,
        wait_all: bool,
        nanoseconds: s64,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Creates an address arbiter\n # Arguments\n\n* `mutex` (direction out) - Pointer to output the handle of the created address arbiter to.\n [`svcArbitrateAddress`]"]
    pub fn svcCreateAddressArbiter(arbiter: *mut Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Arbitrate an address, can be used for synchronization\n # Arguments\n\n* `arbiter` - Handle of the arbiter\n * `addr` - A pointer to a s32 value.\n * `type` - Type of action to be performed by the arbiter\n * `value` - Number of threads to signal if using ARBITRATION_SIGNAL, or the value used for comparison.\n * `timeout_ns` - Optional timeout in nanoseconds when using TIMEOUT actions, ignored otherwise. If not needed, use svcArbitrateAddressNoTimeout instead.\n > **Note:** Usage of this syscall entails an implicit Data Memory Barrier (dmb).\n Please use syncArbitrateAddressWithTimeout instead."]
    pub fn svcArbitrateAddress(
        arbiter: Handle,
        addr: u32_,
        type_: ArbitrationType,
        value: s32,
        timeout_ns: s64,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Same as svcArbitrateAddress but with the timeout_ns parameter undefined.\n # Arguments\n\n* `arbiter` - Handle of the arbiter\n * `addr` - A pointer to a s32 value.\n * `type` - Type of action to be performed by the arbiter\n * `value` - Number of threads to signal if using ARBITRATION_SIGNAL, or the value used for comparison.\n > **Note:** Usage of this syscall entails an implicit Data Memory Barrier (dmb).\n Please use syncArbitrateAddress instead."]
    pub fn svcArbitrateAddressNoTimeout(
        arbiter: Handle,
        addr: u32_,
        type_: ArbitrationType,
        value: s32,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sends a synchronized request to a session handle.\n # Arguments\n\n* `session` - Handle of the session."]
    pub fn svcSendSyncRequest(session: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Connects to a port via a handle.\n # Arguments\n\n* `clientSession` (direction out) - Pointer to output the client session handle to.\n * `clientPort` - Port client endpoint to connect to."]
    pub fn svcCreateSessionToPort(clientSession: *mut Handle, clientPort: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Creates a linked pair of session endpoints.\n # Arguments\n\n* `serverSession` (direction out) - Pointer to output the created server endpoint handle to.\n * `clientSession` (direction out) - Pointer to output the created client endpoint handle to."]
    pub fn svcCreateSession(serverSession: *mut Handle, clientSession: *mut Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Accepts a session.\n # Arguments\n\n* `session` (direction out) - Pointer to output the created session handle to.\n * `port` - Handle of the port to accept a session from."]
    pub fn svcAcceptSession(session: *mut Handle, port: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Replies to and receives a new request.\n # Arguments\n\n* `index` - Pointer to the index of the request.\n * `handles` - Session handles to receive requests from.\n * `handleCount` - Number of handles.\n * `replyTarget` - Handle of the session to reply to."]
    pub fn svcReplyAndReceive(
        index: *mut s32,
        handles: *const Handle,
        handleCount: s32,
        replyTarget: Handle,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Time\n# *\n* Creates a timer.\n # Arguments\n\n* `timer` (direction out) - Pointer to output the handle of the created timer to.\n * `reset_type` - Type of reset to perform on the timer.\n/"]
    pub fn svcCreateTimer(timer: *mut Handle, reset_type: ResetType) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets a timer.\n # Arguments\n\n* `timer` - Handle of the timer to set.\n * `initial` - Initial value of the timer.\n * `interval` - Interval of the timer."]
    pub fn svcSetTimer(timer: Handle, initial: s64, interval: s64) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Cancels a timer.\n # Arguments\n\n* `timer` - Handle of the timer to cancel."]
    pub fn svcCancelTimer(timer: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Clears a timer.\n # Arguments\n\n* `timer` - Handle of the timer to clear."]
    pub fn svcClearTimer(timer: Handle) -> Result;
}
unsafe extern "C" {
    #[doc = "Gets the current system tick.\n # Returns\n\nThe current system tick."]
    pub fn svcGetSystemTick() -> u64_;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "System\n# *\n* Closes a handle.\n # Arguments\n\n* `handle` - Handle to close.\n/"]
    pub fn svcCloseHandle(handle: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Duplicates a handle.\n # Arguments\n\n* `out` (direction out) - Pointer to output the duplicated handle to.\n * `original` - Handle to duplicate."]
    pub fn svcDuplicateHandle(out: *mut Handle, original: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets a handle info.\n # Arguments\n\n* `out` (direction out) - Pointer to output the handle info to.\n * `handle` - Handle to get the info for.\n * `param` - Parameter clarifying the handle info type."]
    pub fn svcGetHandleInfo(out: *mut s64, handle: Handle, param: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the system info.\n # Arguments\n\n* `out` (direction out) - Pointer to output the system info to.\n * `type` - Type of system info to retrieve.\n * `param` - Parameter clarifying the system info type."]
    pub fn svcGetSystemInfo(out: *mut s64, type_: u32_, param: s32) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets the current kernel state.\n # Arguments\n\n* `type` - Type of state to set (the other parameters depend on it)."]
    pub fn svcKernelSetState(type_: u32_, ...) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Binds an event or semaphore handle to an ARM11 interrupt.\n # Arguments\n\n* `interruptId` - Interrupt identfier (see https://www.3dbrew.org/wiki/ARM11_Interrupts).\n * `eventOrSemaphore` - Event or semaphore handle to bind to the given interrupt.\n * `priority` - Priority of the interrupt for the current process.\n * `isManualClear` - Indicates whether the interrupt has to be manually cleared or not (= level-high active)."]
    pub fn svcBindInterrupt(
        interruptId: u32_,
        eventOrSemaphore: Handle,
        priority: s32,
        isManualClear: bool,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Unbinds an event or semaphore handle from an ARM11 interrupt.\n # Arguments\n\n* `interruptId` - Interrupt identfier, see (see https://www.3dbrew.org/wiki/ARM11_Interrupts).\n * `eventOrSemaphore` - Event or semaphore handle to unbind from the given interrupt."]
    pub fn svcUnbindInterrupt(interruptId: u32_, eventOrSemaphore: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Invalidates a process's data cache.\n # Arguments\n\n* `process` - Handle of the process.\n * `addr` - Address to invalidate.\n * `size` - Size of the memory to invalidate."]
    pub fn svcInvalidateProcessDataCache(process: Handle, addr: u32_, size: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Cleans a process's data cache.\n # Arguments\n\n* `process` - Handle of the process.\n * `addr` - Address to clean.\n * `size` - Size of the memory to clean."]
    pub fn svcStoreProcessDataCache(process: Handle, addr: u32_, size: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Flushes (cleans and invalidates) a process's data cache.\n # Arguments\n\n* `process` - Handle of the process.\n * `addr` - Address to flush.\n * `size` - Size of the memory to flush."]
    pub fn svcFlushProcessDataCache(process: Handle, addr: u32_, size: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Begins an inter-process DMA transfer.\n # Arguments\n\n* `dma` (direction out) - Pointer to output the handle of the DMA channel object to.\n * `dstProcess` - Destination process handle.\n * `dstAddr` - Address in the destination process to write data to.\n * `srcProcess` - Source process handle.\n * `srcAddr` - Address in the source to read data from.\n * `size` - Size of the data to transfer.\n * `cfg` - Configuration structure.\n > **Note:** The handle is signaled when the transfer finishes."]
    pub fn svcStartInterProcessDma(
        dma: *mut Handle,
        dstProcess: Handle,
        dstAddr: u32_,
        srcProcess: Handle,
        srcAddr: u32_,
        size: u32_,
        cfg: *const DmaConfig,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Stops an inter-process DMA transfer.\n # Arguments\n\n* `dma` - Handle of the DMA channel object."]
    pub fn svcStopDma(dma: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the state of an inter-process DMA transfer.\n # Arguments\n\n* `state` (direction out) - Pointer to output the state of the DMA transfer to.\n * `dma` - Handle of the DMA channel object."]
    pub fn svcGetDmaState(state: *mut DmaState, dma: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Restarts a DMA transfer, using the same configuration as before.\n # Arguments\n\n* `state` (direction out) - Pointer to output the state of the DMA transfer to.\n * `dma` - Handle of the DMA channel object.\n * `dstAddr` - Address in the destination process to write data to.\n * `srcAddr` - Address in the source to read data from.\n * `size` - Size of the data to transfer.\n * `flags` - Restart flags, DMARST_UNLOCK and/or DMARST_RESUME_DEVICE.\n > **Note:** The first transfer has to be configured with DMACFG_KEEP_LOCKED."]
    pub fn svcRestartDma(
        dma: Handle,
        dstAddr: u32_,
        srcAddr: u32_,
        size: u32_,
        flags: s8,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets the GPU protection register to restrict the range of the GPU DMA. 11.3+ only.\n # Arguments\n\n* `useApplicationRestriction` - Whether to use the register value used for APPLICATION titles."]
    pub fn svcSetGpuProt(useApplicationRestriction: bool) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Enables or disables Wi-Fi. 11.4+ only.\n # Arguments\n\n* `enabled` - Whether to enable or disable Wi-Fi."]
    pub fn svcSetWifiEnabled(enabled: bool) -> Result;
}
unsafe extern "C" {
    #[doc = "Debugging\n# *\n* Breaks execution.\n # Arguments\n\n* `breakReason` - Reason for breaking.\n/"]
    pub fn svcBreak(breakReason: UserBreakType);
}
unsafe extern "C" {
    #[doc = "Breaks execution (LOAD_RO and UNLOAD_RO).\n # Arguments\n\n* `breakReason` - Debug reason for breaking.\n * `croInfo` - Library information.\n * `croInfoSize` - Size of the above structure."]
    pub fn svcBreakRO(
        breakReason: UserBreakType,
        croInfo: *const ::libc::c_void,
        croInfoSize: u32_,
    );
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Outputs a debug string.\n # Arguments\n\n* `str` - String to output.\n * `length` - Length of the string to output, needs to be positive."]
    pub fn svcOutputDebugString(str_: *const ::libc::c_char, length: s32) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Controls performance monitoring on the CP15 interface and the SCU.\n The meaning of the parameters depend on the operation.\n # Arguments\n\n* `out` (direction out) - Output.\n * `op` - Operation, see details.\n * `param1` - First parameter.\n * `param2` - Second parameter.\n \n\nThe operations are the following:\n - PERFCOUNTEROP_ENABLE (void) -> void, tries to enable and lock perfmon. functionality.\n - PERFCOUNTEROP_DISABLE (void) -> void, disable and forcibly unlocks perfmon. functionality.\n - PERFCOUNTEROP_GET_VALUE (PerfCounterRegister reg) -> u64, gets the value of a particular counter register.\n - PERFCOUNTEROP_SET_VALUE (PerfCounterRegister reg, u64 value) -> void, sets the value of a particular counter register.\n - PERFCOUNTEROP_GET_OVERFLOW_FLAGS (void) -> u32, gets the overflow flags of all CP15 and SCU registers.\n - Format is a bitfield of PerfCounterRegister.\n - PERFCOUNTEROP_RESET (u32 valueResetMask, u32 overflowFlagResetMask) -> void, resets the value and/or\n overflow flags of selected registers.\n - Format is two bitfields of PerfCounterRegister.\n - PERFCOUNTEROP_GET_EVENT (PerfCounterRegister reg) -> PerfCounterEvent, gets the event associated\n to a particular counter register.\n - PERFCOUNTEROP_SET_EVENT (PerfCounterRegister reg, PerfCounterEvent) -> void, sets the event associated\n to a particular counter register.\n - PERFCOUNTEROP_SET_VIRTUAL_COUNTER_ENABLED (bool enabled) -> void, (dis)allows the kernel to track counter overflows\n and to use 64-bit counter values."]
    pub fn svcControlPerformanceCounter(
        out: *mut u64_,
        op: PerfCounterOperation,
        param1: u32_,
        param2: u64_,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Creates a debug handle for an active process.\n # Arguments\n\n* `debug` (direction out) - Pointer to output the created debug handle to.\n * `processId` - ID of the process to debug."]
    pub fn svcDebugActiveProcess(debug: *mut Handle, processId: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Breaks a debugged process.\n # Arguments\n\n* `debug` - Debug handle of the process."]
    pub fn svcBreakDebugProcess(debug: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Terminates a debugged process.\n # Arguments\n\n* `debug` - Debug handle of the process."]
    pub fn svcTerminateDebugProcess(debug: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the current debug event of a debugged process.\n # Arguments\n\n* `info` (direction out) - Pointer to output the debug event information to.\n * `debug` - Debug handle of the process."]
    pub fn svcGetProcessDebugEvent(info: *mut DebugEventInfo, debug: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Continues the current debug event of a debugged process (not necessarily the same as svcGetProcessDebugEvent).\n # Arguments\n\n* `debug` - Debug handle of the process.\n * `flags` - Flags to continue with, see DebugFlags."]
    pub fn svcContinueDebugEvent(debug: Handle, flags: DebugFlags) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Fetches the saved registers of a thread, either inactive or awaiting svcContinueDebugEvent, belonging to a debugged process.\n # Arguments\n\n* `context` (direction out) - Values of the registers to fetch, see ThreadContext.\n * `debug` - Debug handle of the parent process.\n * `threadId` - ID of the thread to fetch the saved registers of.\n * `controlFlags` - Which registers to fetch, see ThreadContextControlFlags."]
    pub fn svcGetDebugThreadContext(
        context: *mut ThreadContext,
        debug: Handle,
        threadId: u32_,
        controlFlags: ThreadContextControlFlags,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Updates the saved registers of a thread, either inactive or awaiting svcContinueDebugEvent, belonging to a debugged process.\n # Arguments\n\n* `debug` - Debug handle of the parent process.\n * `threadId` - ID of the thread to update the saved registers of.\n * `context` - Values of the registers to update, see ThreadContext.\n * `controlFlags` - Which registers to update, see ThreadContextControlFlags."]
    pub fn svcSetDebugThreadContext(
        debug: Handle,
        threadId: u32_,
        context: *mut ThreadContext,
        controlFlags: ThreadContextControlFlags,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Queries memory information of a debugged process.\n # Arguments\n\n* `info` (direction out) - Pointer to output memory info to.\n * `out` (direction out) - Pointer to output page info to.\n * `debug` - Debug handle of the process to query memory from.\n * `addr` - Virtual memory address to query."]
    pub fn svcQueryDebugProcessMemory(
        info: *mut MemInfo,
        out: *mut PageInfo,
        debug: Handle,
        addr: u32_,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Reads from a debugged process's memory.\n # Arguments\n\n* `buffer` - Buffer to read data to.\n * `debug` - Debug handle of the process.\n * `addr` - Address to read from.\n * `size` - Size of the memory to read."]
    pub fn svcReadProcessMemory(
        buffer: *mut ::libc::c_void,
        debug: Handle,
        addr: u32_,
        size: u32_,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Writes to a debugged process's memory.\n # Arguments\n\n* `debug` - Debug handle of the process.\n * `buffer` - Buffer to write data from.\n * `addr` - Address to write to.\n * `size` - Size of the memory to write."]
    pub fn svcWriteProcessMemory(
        debug: Handle,
        buffer: *const ::libc::c_void,
        addr: u32_,
        size: u32_,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets an hardware breakpoint or watchpoint. This is an interface to the BRP/WRP registers, see http://infocenter.arm.com/help/topic/com.arm.doc.ddi0360f/CEGEBGFC.html .\n # Arguments\n\n* `registerId` - range 0..5 = breakpoints (BRP0-5), 0x100..0x101 = watchpoints (WRP0-1). The previous stop point for the register is disabled.\n * `control` - Value of the control regiser.\n * `value` - Value of the value register: either and address (if bit21 of control is clear) or the debug handle of a process to fetch the context ID of."]
    pub fn svcSetHardwareBreakPoint(registerId: s32, control: u32_, value: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets a debugged thread's parameter.\n # Arguments\n\n* `unused` (direction out) - Unused.\n * `out` (direction out) - Output value.\n * `debug` - Debug handle of the process.\n * `threadId` - ID of the thread\n * `parameter` - Parameter to fetch, see DebugThreadParameter."]
    pub fn svcGetDebugThreadParam(
        unused: *mut s64,
        out: *mut u32_,
        debug: Handle,
        threadId: u32_,
        parameter: DebugThreadParameter,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Executes a function in supervisor mode.\n # Arguments\n\n* `callback` - Function to execute."]
    pub fn svcBackdoor(callback: ::core::option::Option<unsafe extern "C" fn() -> s32>) -> Result;
}
#[doc = "< Mount \"nand:/\""]
pub const ARM9DESC_MOUNT_NAND: _bindgen_ty_7 = 1;
#[doc = "< Mount nand:/ro/ as read-write"]
pub const ARM9DESC_MOUNT_NANDRO_RW: _bindgen_ty_7 = 2;
#[doc = "< Mount \"twln:/\""]
pub const ARM9DESC_MOUNT_TWLN: _bindgen_ty_7 = 4;
#[doc = "< Mount \"wnand:/\""]
pub const ARM9DESC_MOUNT_WNAND: _bindgen_ty_7 = 8;
#[doc = "< Mount \"cardspi:/\""]
pub const ARM9DESC_MOUNT_CARDSPI: _bindgen_ty_7 = 16;
#[doc = "< Use SDIF3"]
pub const ARM9DESC_USE_SDIF3: _bindgen_ty_7 = 32;
#[doc = "< Create seed (movable.sed)"]
pub const ARM9DESC_CREATE_SEED: _bindgen_ty_7 = 64;
#[doc = "< Use card SPI, required by multiple pxi:dev commands"]
pub const ARM9DESC_USE_CARD_SPI: _bindgen_ty_7 = 128;
#[doc = "< SD application (not checked)"]
pub const ARM9DESC_SD_APPLICATION: _bindgen_ty_7 = 256;
#[doc = "< Mount \"sdmc:/\" as read-write"]
pub const ARM9DESC_MOUNT_SDMC_RW: _bindgen_ty_7 = 512;
#[doc = "ARM9 descriptor flags"]
pub type _bindgen_ty_7 = ::libc::c_ushort;
#[doc = "< Category \"system application\""]
pub const FSACCESS_CATEGORY_SYSTEM_APPLICATION: _bindgen_ty_8 = 1;
#[doc = "< Category \"hardware check\""]
pub const FSACCESS_CATEGORY_HARDWARE_CHECK: _bindgen_ty_8 = 2;
#[doc = "< Category \"filesystem tool\""]
pub const FSACCESS_CATEGORY_FILESYSTEM_TOOL: _bindgen_ty_8 = 4;
#[doc = "< Debug"]
pub const FSACCESS_DEBUG: _bindgen_ty_8 = 8;
#[doc = "< TWLCARD backup"]
pub const FSACCESS_TWLCARD_BACKUP: _bindgen_ty_8 = 16;
#[doc = "< TWLNAND data"]
pub const FSACCESS_TWLNAND_DATA: _bindgen_ty_8 = 32;
#[doc = "< BOSS (SpotPass)"]
pub const FSACCESS_BOSS: _bindgen_ty_8 = 64;
#[doc = "< SDMC (read-write)"]
pub const FSACCESS_SDMC_RW: _bindgen_ty_8 = 128;
#[doc = "< Core"]
pub const FSACCESS_CORE: _bindgen_ty_8 = 256;
#[doc = "< nand:/ro/ (read-only)"]
pub const FSACCESS_NANDRO_RO: _bindgen_ty_8 = 512;
#[doc = "< nand:/rw/"]
pub const FSACCESS_NANDRW: _bindgen_ty_8 = 1024;
#[doc = "< nand:/ro/ (read-write)"]
pub const FSACCESS_NANDRO_RW: _bindgen_ty_8 = 2048;
#[doc = "< Category \"System Settings\""]
pub const FSACCESS_CATEGORY_SYSTEM_SETTINGS: _bindgen_ty_8 = 4096;
#[doc = "< Cardboard (System Transfer)"]
pub const FSACCESS_CARDBOARD: _bindgen_ty_8 = 8192;
#[doc = "< Export/Import IVs (movable.sed)"]
pub const FSACCESS_EXPORT_IMPORT_IVS: _bindgen_ty_8 = 16384;
#[doc = "< SDMC (write-only)"]
pub const FSACCESS_SDMC_WO: _bindgen_ty_8 = 32768;
#[doc = "< \"Switch cleanup\" (3.0+)"]
pub const FSACCESS_SWITCH_CLEANUP: _bindgen_ty_8 = 65536;
#[doc = "< Savedata move (5.0+)"]
pub const FSACCESS_SAVEDATA_MOVE: _bindgen_ty_8 = 131072;
#[doc = "< Shop (5.0+)"]
pub const FSACCESS_SHOP: _bindgen_ty_8 = 262144;
#[doc = "< Shop (5.0+)"]
pub const FSACCESS_SHELL: _bindgen_ty_8 = 524288;
#[doc = "< Category \"Home Menu\" (6.0+)"]
pub const FSACCESS_CATEGORY_HOME_MENU: _bindgen_ty_8 = 1048576;
#[doc = "< Seed DB (9.6+)"]
pub const FSACCESS_SEEDDB: _bindgen_ty_8 = 2097152;
#[doc = "Filesystem access flags"]
pub type _bindgen_ty_8 = ::libc::c_uint;
#[doc = "< Regular application"]
pub const RESLIMIT_CATEGORY_APPLICATION: ResourceLimitCategory = 0;
#[doc = "< System applet"]
pub const RESLIMIT_CATEGORY_SYS_APPLET: ResourceLimitCategory = 1;
#[doc = "< Library applet"]
pub const RESLIMIT_CATEGORY_LIB_APPLET: ResourceLimitCategory = 2;
#[doc = "< System modules running inside the BASE memregion"]
pub const RESLIMIT_CATEGORY_OTHER: ResourceLimitCategory = 3;
#[doc = "The resource limit category of a title"]
pub type ResourceLimitCategory = ::libc::c_uchar;
#[doc = "< 64MB of usable application memory"]
pub const SYSMODE_O3DS_PROD: SystemMode = 0;
#[doc = "< 124MB of usable application memory. Unusable on O3DS"]
pub const SYSMODE_N3DS_PROD: SystemMode = 1;
#[doc = "< 97MB/178MB of usable application memory"]
pub const SYSMODE_DEV1: SystemMode = 2;
#[doc = "< 80MB/124MB of usable application memory"]
pub const SYSMODE_DEV2: SystemMode = 3;
#[doc = "< 72MB of usable application memory. Same as \"Prod\" on N3DS"]
pub const SYSMODE_DEV3: SystemMode = 4;
#[doc = "< 32MB of usable application memory. Same as \"Prod\" on N3DS"]
pub const SYSMODE_DEV4: SystemMode = 5;
#[doc = "The system mode a title should be launched under"]
pub type SystemMode = ::libc::c_uchar;
#[doc = "The system info flags and remaster version of a title"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ExHeader_SystemInfoFlags {
    #[doc = "< Reserved"]
    pub reserved: [u8_; 5usize],
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "< Remaster version"]
    pub remaster_version: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_SystemInfoFlags"]
        [::core::mem::size_of::<ExHeader_SystemInfoFlags>() - 8usize];
    ["Alignment of ExHeader_SystemInfoFlags"]
        [::core::mem::align_of::<ExHeader_SystemInfoFlags>() - 2usize];
    ["Offset of field: ExHeader_SystemInfoFlags::reserved"]
        [::core::mem::offset_of!(ExHeader_SystemInfoFlags, reserved) - 0usize];
    ["Offset of field: ExHeader_SystemInfoFlags::remaster_version"]
        [::core::mem::offset_of!(ExHeader_SystemInfoFlags, remaster_version) - 6usize];
};
impl ExHeader_SystemInfoFlags {
    #[inline]
    pub fn compress_exefs_code(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_compress_exefs_code(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn compress_exefs_code_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_compress_exefs_code_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_sd_application(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_sd_application(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_sd_application_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_is_sd_application_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        compress_exefs_code: bool,
        is_sd_application: bool,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let compress_exefs_code: u8 = unsafe { ::core::mem::transmute(compress_exefs_code) };
            compress_exefs_code as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let is_sd_application: u8 = unsafe { ::core::mem::transmute(is_sd_application) };
            is_sd_application as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "Information about a title's section"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ExHeader_CodeSectionInfo {
    #[doc = "< The address of the section"]
    pub address: u32_,
    #[doc = "< The number of pages the section occupies"]
    pub num_pages: u32_,
    #[doc = "< The size of the section"]
    pub size: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_CodeSectionInfo"]
        [::core::mem::size_of::<ExHeader_CodeSectionInfo>() - 12usize];
    ["Alignment of ExHeader_CodeSectionInfo"]
        [::core::mem::align_of::<ExHeader_CodeSectionInfo>() - 4usize];
    ["Offset of field: ExHeader_CodeSectionInfo::address"]
        [::core::mem::offset_of!(ExHeader_CodeSectionInfo, address) - 0usize];
    ["Offset of field: ExHeader_CodeSectionInfo::num_pages"]
        [::core::mem::offset_of!(ExHeader_CodeSectionInfo, num_pages) - 4usize];
    ["Offset of field: ExHeader_CodeSectionInfo::size"]
        [::core::mem::offset_of!(ExHeader_CodeSectionInfo, size) - 8usize];
};
#[doc = "The name of a title and infomation about its section"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ExHeader_CodeSetInfo {
    #[doc = "< Title name"]
    pub name: [::libc::c_char; 8usize],
    #[doc = "< System info flags, see ExHeader_SystemInfoFlags"]
    pub flags: ExHeader_SystemInfoFlags,
    #[doc = "< .text section info, see ExHeader_CodeSectionInfo"]
    pub text: ExHeader_CodeSectionInfo,
    #[doc = "< Stack size"]
    pub stack_size: u32_,
    #[doc = "< .rodata section info, see ExHeader_CodeSectionInfo"]
    pub rodata: ExHeader_CodeSectionInfo,
    #[doc = "< Reserved"]
    pub reserved: u32_,
    #[doc = "< .data section info, see ExHeader_CodeSectionInfo"]
    pub data: ExHeader_CodeSectionInfo,
    #[doc = "< .bss section size"]
    pub bss_size: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_CodeSetInfo"][::core::mem::size_of::<ExHeader_CodeSetInfo>() - 64usize];
    ["Alignment of ExHeader_CodeSetInfo"][::core::mem::align_of::<ExHeader_CodeSetInfo>() - 4usize];
    ["Offset of field: ExHeader_CodeSetInfo::name"]
        [::core::mem::offset_of!(ExHeader_CodeSetInfo, name) - 0usize];
    ["Offset of field: ExHeader_CodeSetInfo::flags"]
        [::core::mem::offset_of!(ExHeader_CodeSetInfo, flags) - 8usize];
    ["Offset of field: ExHeader_CodeSetInfo::text"]
        [::core::mem::offset_of!(ExHeader_CodeSetInfo, text) - 16usize];
    ["Offset of field: ExHeader_CodeSetInfo::stack_size"]
        [::core::mem::offset_of!(ExHeader_CodeSetInfo, stack_size) - 28usize];
    ["Offset of field: ExHeader_CodeSetInfo::rodata"]
        [::core::mem::offset_of!(ExHeader_CodeSetInfo, rodata) - 32usize];
    ["Offset of field: ExHeader_CodeSetInfo::reserved"]
        [::core::mem::offset_of!(ExHeader_CodeSetInfo, reserved) - 44usize];
    ["Offset of field: ExHeader_CodeSetInfo::data"]
        [::core::mem::offset_of!(ExHeader_CodeSetInfo, data) - 48usize];
    ["Offset of field: ExHeader_CodeSetInfo::bss_size"]
        [::core::mem::offset_of!(ExHeader_CodeSetInfo, bss_size) - 60usize];
};
#[doc = "The savedata size and jump ID of a title"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_SystemInfo {
    #[doc = "< Savedata size"]
    pub savedata_size: u64_,
    #[doc = "< Jump ID"]
    pub jump_id: u64_,
    #[doc = "< Reserved"]
    pub reserved: [u8_; 48usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_SystemInfo"][::core::mem::size_of::<ExHeader_SystemInfo>() - 64usize];
    ["Alignment of ExHeader_SystemInfo"][::core::mem::align_of::<ExHeader_SystemInfo>() - 8usize];
    ["Offset of field: ExHeader_SystemInfo::savedata_size"]
        [::core::mem::offset_of!(ExHeader_SystemInfo, savedata_size) - 0usize];
    ["Offset of field: ExHeader_SystemInfo::jump_id"]
        [::core::mem::offset_of!(ExHeader_SystemInfo, jump_id) - 8usize];
    ["Offset of field: ExHeader_SystemInfo::reserved"]
        [::core::mem::offset_of!(ExHeader_SystemInfo, reserved) - 16usize];
};
impl Default for ExHeader_SystemInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "The code set info, dependencies and system info of a title (SCI)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_SystemControlInfo {
    #[doc = "< Code set info, see ExHeader_CodeSetInfo"]
    pub codeset_info: ExHeader_CodeSetInfo,
    #[doc = "< Title IDs of the titles that this program depends on"]
    pub dependencies: [u64_; 48usize],
    #[doc = "< System info, see ExHeader_SystemInfo"]
    pub system_info: ExHeader_SystemInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_SystemControlInfo"]
        [::core::mem::size_of::<ExHeader_SystemControlInfo>() - 512usize];
    ["Alignment of ExHeader_SystemControlInfo"]
        [::core::mem::align_of::<ExHeader_SystemControlInfo>() - 8usize];
    ["Offset of field: ExHeader_SystemControlInfo::codeset_info"]
        [::core::mem::offset_of!(ExHeader_SystemControlInfo, codeset_info) - 0usize];
    ["Offset of field: ExHeader_SystemControlInfo::dependencies"]
        [::core::mem::offset_of!(ExHeader_SystemControlInfo, dependencies) - 64usize];
    ["Offset of field: ExHeader_SystemControlInfo::system_info"]
        [::core::mem::offset_of!(ExHeader_SystemControlInfo, system_info) - 448usize];
};
impl Default for ExHeader_SystemControlInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "The ARM11 filesystem info of a title"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ExHeader_Arm11StorageInfo {
    #[doc = "< Extdata ID"]
    pub extdata_id: u64_,
    #[doc = "< IDs of the system savedata accessible by the title"]
    pub system_savedata_ids: [u32_; 2usize],
    #[doc = "< IDs of the savedata accessible by the title, 20 bits each, followed by \"Use other variation savedata\""]
    pub accessible_savedata_ids: u64_,
    #[doc = "< FS access flags"]
    pub fs_access_info: u32_,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_Arm11StorageInfo"]
        [::core::mem::size_of::<ExHeader_Arm11StorageInfo>() - 32usize];
    ["Alignment of ExHeader_Arm11StorageInfo"]
        [::core::mem::align_of::<ExHeader_Arm11StorageInfo>() - 8usize];
    ["Offset of field: ExHeader_Arm11StorageInfo::extdata_id"]
        [::core::mem::offset_of!(ExHeader_Arm11StorageInfo, extdata_id) - 0usize];
    ["Offset of field: ExHeader_Arm11StorageInfo::system_savedata_ids"]
        [::core::mem::offset_of!(ExHeader_Arm11StorageInfo, system_savedata_ids) - 8usize];
    ["Offset of field: ExHeader_Arm11StorageInfo::accessible_savedata_ids"]
        [::core::mem::offset_of!(ExHeader_Arm11StorageInfo, accessible_savedata_ids) - 16usize];
    ["Offset of field: ExHeader_Arm11StorageInfo::fs_access_info"]
        [::core::mem::offset_of!(ExHeader_Arm11StorageInfo, fs_access_info) - 24usize];
};
impl ExHeader_Arm11StorageInfo {
    #[inline]
    pub fn reserved(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn reserved_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                24u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_reserved_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                24u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn no_romfs(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_no_romfs(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn no_romfs_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_no_romfs_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn use_extended_savedata_access(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_use_extended_savedata_access(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn use_extended_savedata_access_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                25usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_use_extended_savedata_access_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                25usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        reserved: u32_,
        no_romfs: bool,
        use_extended_savedata_access: bool,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 24u8, {
            let reserved: u32 = unsafe { ::core::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let no_romfs: u8 = unsafe { ::core::mem::transmute(no_romfs) };
            no_romfs as u64
        });
        __bindgen_bitfield_unit.set(25usize, 1u8, {
            let use_extended_savedata_access: u8 =
                unsafe { ::core::mem::transmute(use_extended_savedata_access) };
            use_extended_savedata_access as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "The CPU-related and memory-layout-related info of a title"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_Arm11CoreInfo {
    #[doc = "< The low title ID of the target firmware"]
    pub core_version: u32_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    #[doc = "< The priority of the title's main thread"]
    pub priority: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_Arm11CoreInfo"][::core::mem::size_of::<ExHeader_Arm11CoreInfo>() - 8usize];
    ["Alignment of ExHeader_Arm11CoreInfo"]
        [::core::mem::align_of::<ExHeader_Arm11CoreInfo>() - 4usize];
    ["Offset of field: ExHeader_Arm11CoreInfo::core_version"]
        [::core::mem::offset_of!(ExHeader_Arm11CoreInfo, core_version) - 0usize];
    ["Offset of field: ExHeader_Arm11CoreInfo::priority"]
        [::core::mem::offset_of!(ExHeader_Arm11CoreInfo, priority) - 7usize];
};
impl Default for ExHeader_Arm11CoreInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ExHeader_Arm11CoreInfo {
    #[inline]
    pub fn use_cpu_clockrate_804MHz(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_use_cpu_clockrate_804MHz(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn use_cpu_clockrate_804MHz_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_use_cpu_clockrate_804MHz_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn enable_l2c(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enable_l2c(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn enable_l2c_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_enable_l2c_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn flag1_unused(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_flag1_unused(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn flag1_unused_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                6u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_flag1_unused_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                6u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn n3ds_system_mode(&self) -> SystemMode {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_n3ds_system_mode(&mut self, val: SystemMode) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn n3ds_system_mode_raw(this: *const Self) -> SystemMode {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_n3ds_system_mode_raw(this: *mut Self, val: SystemMode) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn flag2_unused(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_flag2_unused(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn flag2_unused_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_flag2_unused_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ideal_processor(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_ideal_processor(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ideal_processor_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ideal_processor_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn affinity_mask(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_affinity_mask(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn affinity_mask_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                18usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_affinity_mask_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                18usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn o3ds_system_mode(&self) -> SystemMode {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_o3ds_system_mode(&mut self, val: SystemMode) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn o3ds_system_mode_raw(this: *const Self) -> SystemMode {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_o3ds_system_mode_raw(this: *mut Self, val: SystemMode) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        use_cpu_clockrate_804MHz: bool,
        enable_l2c: bool,
        flag1_unused: u8_,
        n3ds_system_mode: SystemMode,
        flag2_unused: u8_,
        ideal_processor: u8_,
        affinity_mask: u8_,
        o3ds_system_mode: SystemMode,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let use_cpu_clockrate_804MHz: u8 =
                unsafe { ::core::mem::transmute(use_cpu_clockrate_804MHz) };
            use_cpu_clockrate_804MHz as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let enable_l2c: u8 = unsafe { ::core::mem::transmute(enable_l2c) };
            enable_l2c as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let flag1_unused: u8 = unsafe { ::core::mem::transmute(flag1_unused) };
            flag1_unused as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let n3ds_system_mode: u8 = unsafe { ::core::mem::transmute(n3ds_system_mode) };
            n3ds_system_mode as u64
        });
        __bindgen_bitfield_unit.set(12usize, 4u8, {
            let flag2_unused: u8 = unsafe { ::core::mem::transmute(flag2_unused) };
            flag2_unused as u64
        });
        __bindgen_bitfield_unit.set(16usize, 2u8, {
            let ideal_processor: u8 = unsafe { ::core::mem::transmute(ideal_processor) };
            ideal_processor as u64
        });
        __bindgen_bitfield_unit.set(18usize, 2u8, {
            let affinity_mask: u8 = unsafe { ::core::mem::transmute(affinity_mask) };
            affinity_mask as u64
        });
        __bindgen_bitfield_unit.set(20usize, 4u8, {
            let o3ds_system_mode: u8 = unsafe { ::core::mem::transmute(o3ds_system_mode) };
            o3ds_system_mode as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "The ARM11 system-local capabilities of a title"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_Arm11SystemLocalCapabilities {
    #[doc = "< Title ID"]
    pub title_id: u64_,
    #[doc = "< Core info, see ExHeader_Arm11CoreInfo"]
    pub core_info: ExHeader_Arm11CoreInfo,
    #[doc = "< Resource limit descriptors, only \"CpuTime\" (first byte) sems to be used"]
    pub reslimits: [u16_; 16usize],
    #[doc = "< Storage info, see ExHeader_Arm11StorageInfo"]
    pub storage_info: ExHeader_Arm11StorageInfo,
    #[doc = "< List of the services the title has access to. Limited to 32 prior to system version 9.3"]
    pub service_access: [[::libc::c_char; 8usize]; 34usize],
    #[doc = "< Reserved"]
    pub reserved: [u8_; 15usize],
    #[doc = "< Resource limit category, see ExHeader_Arm11SystemLocalCapabilities"]
    pub reslimit_category: ResourceLimitCategory,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_Arm11SystemLocalCapabilities"]
        [::core::mem::size_of::<ExHeader_Arm11SystemLocalCapabilities>() - 368usize];
    ["Alignment of ExHeader_Arm11SystemLocalCapabilities"]
        [::core::mem::align_of::<ExHeader_Arm11SystemLocalCapabilities>() - 8usize];
    ["Offset of field: ExHeader_Arm11SystemLocalCapabilities::title_id"]
        [::core::mem::offset_of!(ExHeader_Arm11SystemLocalCapabilities, title_id) - 0usize];
    ["Offset of field: ExHeader_Arm11SystemLocalCapabilities::core_info"]
        [::core::mem::offset_of!(ExHeader_Arm11SystemLocalCapabilities, core_info) - 8usize];
    ["Offset of field: ExHeader_Arm11SystemLocalCapabilities::reslimits"]
        [::core::mem::offset_of!(ExHeader_Arm11SystemLocalCapabilities, reslimits) - 16usize];
    ["Offset of field: ExHeader_Arm11SystemLocalCapabilities::storage_info"]
        [::core::mem::offset_of!(ExHeader_Arm11SystemLocalCapabilities, storage_info) - 48usize];
    ["Offset of field: ExHeader_Arm11SystemLocalCapabilities::service_access"]
        [::core::mem::offset_of!(ExHeader_Arm11SystemLocalCapabilities, service_access) - 80usize];
    ["Offset of field: ExHeader_Arm11SystemLocalCapabilities::reserved"]
        [::core::mem::offset_of!(ExHeader_Arm11SystemLocalCapabilities, reserved) - 352usize];
    ["Offset of field: ExHeader_Arm11SystemLocalCapabilities::reslimit_category"][::core::mem::offset_of!(
        ExHeader_Arm11SystemLocalCapabilities,
        reslimit_category
    ) - 367usize];
};
impl Default for ExHeader_Arm11SystemLocalCapabilities {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "The ARM11 kernel capabilities of a title"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ExHeader_Arm11KernelCapabilities {
    #[doc = "< ARM11 kernel descriptors, see 3dbrew"]
    pub descriptors: [u32_; 28usize],
    #[doc = "< Reserved"]
    pub reserved: [u8_; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_Arm11KernelCapabilities"]
        [::core::mem::size_of::<ExHeader_Arm11KernelCapabilities>() - 128usize];
    ["Alignment of ExHeader_Arm11KernelCapabilities"]
        [::core::mem::align_of::<ExHeader_Arm11KernelCapabilities>() - 4usize];
    ["Offset of field: ExHeader_Arm11KernelCapabilities::descriptors"]
        [::core::mem::offset_of!(ExHeader_Arm11KernelCapabilities, descriptors) - 0usize];
    ["Offset of field: ExHeader_Arm11KernelCapabilities::reserved"]
        [::core::mem::offset_of!(ExHeader_Arm11KernelCapabilities, reserved) - 112usize];
};
#[doc = "The ARM9 access control of a title"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ExHeader_Arm9AccessControl {
    #[doc = "< Process9 FS descriptors, see 3dbrew"]
    pub descriptors: [u8_; 15usize],
    #[doc = "< Descriptor version"]
    pub descriptor_version: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_Arm9AccessControl"]
        [::core::mem::size_of::<ExHeader_Arm9AccessControl>() - 16usize];
    ["Alignment of ExHeader_Arm9AccessControl"]
        [::core::mem::align_of::<ExHeader_Arm9AccessControl>() - 1usize];
    ["Offset of field: ExHeader_Arm9AccessControl::descriptors"]
        [::core::mem::offset_of!(ExHeader_Arm9AccessControl, descriptors) - 0usize];
    ["Offset of field: ExHeader_Arm9AccessControl::descriptor_version"]
        [::core::mem::offset_of!(ExHeader_Arm9AccessControl, descriptor_version) - 15usize];
};
#[doc = "The access control information of a title"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_AccessControlInfo {
    #[doc = "< ARM11 system-local capabilities, see ExHeader_Arm11SystemLocalCapabilities"]
    pub local_caps: ExHeader_Arm11SystemLocalCapabilities,
    #[doc = "< ARM11 kernel capabilities, see ExHeader_Arm11SystemLocalCapabilities"]
    pub kernel_caps: ExHeader_Arm11KernelCapabilities,
    #[doc = "< ARM9 access control, see ExHeader_Arm9AccessControl"]
    pub access_control: ExHeader_Arm9AccessControl,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_AccessControlInfo"]
        [::core::mem::size_of::<ExHeader_AccessControlInfo>() - 512usize];
    ["Alignment of ExHeader_AccessControlInfo"]
        [::core::mem::align_of::<ExHeader_AccessControlInfo>() - 8usize];
    ["Offset of field: ExHeader_AccessControlInfo::local_caps"]
        [::core::mem::offset_of!(ExHeader_AccessControlInfo, local_caps) - 0usize];
    ["Offset of field: ExHeader_AccessControlInfo::kernel_caps"]
        [::core::mem::offset_of!(ExHeader_AccessControlInfo, kernel_caps) - 368usize];
    ["Offset of field: ExHeader_AccessControlInfo::access_control"]
        [::core::mem::offset_of!(ExHeader_AccessControlInfo, access_control) - 496usize];
};
impl Default for ExHeader_AccessControlInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "Main extended header data, as returned by PXIPM, Loader and FSREG service commands"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_Info {
    #[doc = "< System control info, see ExHeader_SystemControlInfo"]
    pub sci: ExHeader_SystemControlInfo,
    #[doc = "< Access control info, see ExHeader_AccessControlInfo"]
    pub aci: ExHeader_AccessControlInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_Info"][::core::mem::size_of::<ExHeader_Info>() - 1024usize];
    ["Alignment of ExHeader_Info"][::core::mem::align_of::<ExHeader_Info>() - 8usize];
    ["Offset of field: ExHeader_Info::sci"][::core::mem::offset_of!(ExHeader_Info, sci) - 0usize];
    ["Offset of field: ExHeader_Info::aci"][::core::mem::offset_of!(ExHeader_Info, aci) - 512usize];
};
impl Default for ExHeader_Info {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "Extended header access descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader_AccessDescriptor {
    #[doc = "< The signature of the access descriptor (RSA-2048-SHA256)"]
    pub signature: [u8_; 256usize],
    #[doc = "< The modulus used for the above signature, with 65537 as public exponent"]
    pub ncchModulus: [u8_; 256usize],
    #[doc = "< This is compared for equality with the first ACI by Process9, see ExHeader_AccessControlInfo"]
    pub acli: ExHeader_AccessControlInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader_AccessDescriptor"]
        [::core::mem::size_of::<ExHeader_AccessDescriptor>() - 1024usize];
    ["Alignment of ExHeader_AccessDescriptor"]
        [::core::mem::align_of::<ExHeader_AccessDescriptor>() - 8usize];
    ["Offset of field: ExHeader_AccessDescriptor::signature"]
        [::core::mem::offset_of!(ExHeader_AccessDescriptor, signature) - 0usize];
    ["Offset of field: ExHeader_AccessDescriptor::ncchModulus"]
        [::core::mem::offset_of!(ExHeader_AccessDescriptor, ncchModulus) - 256usize];
    ["Offset of field: ExHeader_AccessDescriptor::acli"]
        [::core::mem::offset_of!(ExHeader_AccessDescriptor, acli) - 512usize];
};
impl Default for ExHeader_AccessDescriptor {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "The NCCH Extended Header of a title"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ExHeader {
    #[doc = "< Main extended header data, see ExHeader_Info"]
    pub info: ExHeader_Info,
    #[doc = "< Access descriptor, see ExHeader_AccessDescriptor"]
    pub access_descriptor: ExHeader_AccessDescriptor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExHeader"][::core::mem::size_of::<ExHeader>() - 2048usize];
    ["Alignment of ExHeader"][::core::mem::align_of::<ExHeader>() - 8usize];
    ["Offset of field: ExHeader::info"][::core::mem::offset_of!(ExHeader, info) - 0usize];
    ["Offset of field: ExHeader::access_descriptor"]
        [::core::mem::offset_of!(ExHeader, access_descriptor) - 1024usize];
};
impl Default for ExHeader {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Initializes the service API."]
    pub fn srvInit() -> Result;
}
unsafe extern "C" {
    #[doc = "Exits the service API."]
    pub fn srvExit();
}
unsafe extern "C" {
    #[doc = "Makes srvGetServiceHandle non-blocking for the current thread (or blocking, the default), in case of unavailable (full) requested services.\n # Arguments\n\n* `blocking` - Whether srvGetServiceHandle should be non-blocking.\n srvGetServiceHandle will always block if the service hasn't been registered yet,\n use srvIsServiceRegistered to check whether that is the case or not."]
    pub fn srvSetBlockingPolicy(nonBlocking: bool);
}
unsafe extern "C" {
    #[doc = "Gets the current service API session handle.\n # Returns\n\nThe current service API session handle."]
    pub fn srvGetSessionHandle() -> *mut Handle;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Retrieves a service handle, retrieving from the environment handle list if possible.\n # Arguments\n\n* `out` - Pointer to write the handle to.\n * `name` - Name of the service.\n # Returns\n\n0 if no error occured,\n 0xD8E06406 if the caller has no right to access the service,\n 0xD0401834 if the requested service port is full and srvGetServiceHandle is non-blocking (see srvSetBlockingPolicy)."]
    pub fn srvGetServiceHandle(out: *mut Handle, name: *const ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Registers the current process as a client to the service API."]
    pub fn srvRegisterClient() -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Enables service notificatios, returning a notification semaphore.\n # Arguments\n\n* `semaphoreOut` - Pointer to output the notification semaphore to."]
    pub fn srvEnableNotification(semaphoreOut: *mut Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Registers the current process as a service.\n # Arguments\n\n* `out` - Pointer to write the service handle to.\n * `name` - Name of the service.\n * `maxSessions` - Maximum number of sessions the service can handle."]
    pub fn srvRegisterService(
        out: *mut Handle,
        name: *const ::libc::c_char,
        maxSessions: ::libc::c_int,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Unregisters the current process as a service.\n # Arguments\n\n* `name` - Name of the service."]
    pub fn srvUnregisterService(name: *const ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Retrieves a service handle.\n # Arguments\n\n* `out` - Pointer to output the handle to.\n * `name` - Name of the service.\n * # Returns\n\n0 if no error occured,\n 0xD8E06406 if the caller has no right to access the service,\n 0xD0401834 if the requested service port is full and srvGetServiceHandle is non-blocking (see srvSetBlockingPolicy)."]
    pub fn srvGetServiceHandleDirect(out: *mut Handle, name: *const ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Registers a port.\n # Arguments\n\n* `name` - Name of the port.\n * `clientHandle` - Client handle of the port."]
    pub fn srvRegisterPort(name: *const ::libc::c_char, clientHandle: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Unregisters a port.\n # Arguments\n\n* `name` - Name of the port."]
    pub fn srvUnregisterPort(name: *const ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Retrieves a port handle.\n # Arguments\n\n* `out` - Pointer to output the handle to.\n * `name` - Name of the port."]
    pub fn srvGetPort(out: *mut Handle, name: *const ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Waits for a port to be registered.\n # Arguments\n\n* `name` - Name of the port to wait for registration."]
    pub fn srvWaitForPortRegistered(name: *const ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Subscribes to a notification.\n # Arguments\n\n* `notificationId` - ID of the notification."]
    pub fn srvSubscribe(notificationId: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Unsubscribes from a notification.\n # Arguments\n\n* `notificationId` - ID of the notification."]
    pub fn srvUnsubscribe(notificationId: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Receives a notification.\n # Arguments\n\n* `notificationIdOut` - Pointer to output the ID of the received notification to."]
    pub fn srvReceiveNotification(notificationIdOut: *mut u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Publishes a notification to subscribers.\n # Arguments\n\n* `notificationId` - ID of the notification.\n * `flags` - Flags to publish with. (bit 0 = only fire if not fired, bit 1 = do not report an error if there are more than 16 pending notifications)"]
    pub fn srvPublishToSubscriber(notificationId: u32_, flags: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Publishes a notification to subscribers and retrieves a list of all processes that were notified.\n # Arguments\n\n* `processIdCountOut` - Pointer to output the number of process IDs to.\n * `processIdsOut` - Pointer to output the process IDs to. Should have size \"60 * sizeof(u32)\".\n * `notificationId` - ID of the notification."]
    pub fn srvPublishAndGetSubscriber(
        processIdCountOut: *mut u32_,
        processIdsOut: *mut u32_,
        notificationId: u32_,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Checks whether a service is registered.\n # Arguments\n\n* `registeredOut` - Pointer to output the registration status to.\n * `name` - Name of the service to check."]
    pub fn srvIsServiceRegistered(registeredOut: *mut bool, name: *const ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Checks whether a port is registered.\n # Arguments\n\n* `registeredOut` - Pointer to output the registration status to.\n * `name` - Name of the port to check."]
    pub fn srvIsPortRegistered(registeredOut: *mut bool, name: *const ::libc::c_char) -> Result;
}
#[doc = "< Generic fatal error. Shows miscellaneous info, including the address of the caller"]
pub const ERRF_ERRTYPE_GENERIC: ERRF_ErrType = 0;
#[doc = "< Damaged NAND (CC_ERROR after reading CSR)"]
pub const ERRF_ERRTYPE_NAND_DAMAGED: ERRF_ErrType = 1;
#[doc = "< Game content storage medium (cartridge and/or SD card) ejected. Not logged"]
pub const ERRF_ERRTYPE_CARD_REMOVED: ERRF_ErrType = 2;
#[doc = "< CPU or VFP exception"]
pub const ERRF_ERRTYPE_EXCEPTION: ERRF_ErrType = 3;
#[doc = "< Fatal error with a message instead of the caller's address"]
pub const ERRF_ERRTYPE_FAILURE: ERRF_ErrType = 4;
#[doc = "< Log-level failure. Does not display the exception and does not force the system to reboot"]
pub const ERRF_ERRTYPE_LOG_ONLY: ERRF_ErrType = 5;
#[doc = "Types of errors that can be thrown by err:f."]
pub type ERRF_ErrType = ::libc::c_uchar;
#[doc = "< Prefetch Abort"]
pub const ERRF_EXCEPTION_PREFETCH_ABORT: ERRF_ExceptionType = 0;
#[doc = "< Data abort"]
pub const ERRF_EXCEPTION_DATA_ABORT: ERRF_ExceptionType = 1;
#[doc = "< Undefined instruction"]
pub const ERRF_EXCEPTION_UNDEFINED: ERRF_ExceptionType = 2;
#[doc = "< VFP (floating point) exception."]
pub const ERRF_EXCEPTION_VFP: ERRF_ExceptionType = 3;
#[doc = "Types of 'Exceptions' thrown for ERRF_ERRTYPE_EXCEPTION"]
pub type ERRF_ExceptionType = ::libc::c_uchar;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ERRF_ExceptionInfo {
    #[doc = "< Type of the exception. One of the ERRF_EXCEPTION_* values."]
    pub type_: ERRF_ExceptionType,
    pub reserved: [u8_; 3usize],
    #[doc = "< ifsr (prefetch abort) / dfsr (data abort)"]
    pub fsr: u32_,
    #[doc = "< pc = ifar (prefetch abort) / dfar (data abort)"]
    pub far: u32_,
    pub fpexc: u32_,
    pub fpinst: u32_,
    pub fpinst2: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ERRF_ExceptionInfo"][::core::mem::size_of::<ERRF_ExceptionInfo>() - 24usize];
    ["Alignment of ERRF_ExceptionInfo"][::core::mem::align_of::<ERRF_ExceptionInfo>() - 4usize];
    ["Offset of field: ERRF_ExceptionInfo::type_"]
        [::core::mem::offset_of!(ERRF_ExceptionInfo, type_) - 0usize];
    ["Offset of field: ERRF_ExceptionInfo::reserved"]
        [::core::mem::offset_of!(ERRF_ExceptionInfo, reserved) - 1usize];
    ["Offset of field: ERRF_ExceptionInfo::fsr"]
        [::core::mem::offset_of!(ERRF_ExceptionInfo, fsr) - 4usize];
    ["Offset of field: ERRF_ExceptionInfo::far"]
        [::core::mem::offset_of!(ERRF_ExceptionInfo, far) - 8usize];
    ["Offset of field: ERRF_ExceptionInfo::fpexc"]
        [::core::mem::offset_of!(ERRF_ExceptionInfo, fpexc) - 12usize];
    ["Offset of field: ERRF_ExceptionInfo::fpinst"]
        [::core::mem::offset_of!(ERRF_ExceptionInfo, fpinst) - 16usize];
    ["Offset of field: ERRF_ExceptionInfo::fpinst2"]
        [::core::mem::offset_of!(ERRF_ExceptionInfo, fpinst2) - 20usize];
};
impl Default for ERRF_ExceptionInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ERRF_ExceptionData {
    #[doc = "< Exception info struct"]
    pub excep: ERRF_ExceptionInfo,
    #[doc = "< CPU register dump."]
    pub regs: CpuRegisters,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ERRF_ExceptionData"][::core::mem::size_of::<ERRF_ExceptionData>() - 92usize];
    ["Alignment of ERRF_ExceptionData"][::core::mem::align_of::<ERRF_ExceptionData>() - 4usize];
    ["Offset of field: ERRF_ExceptionData::excep"]
        [::core::mem::offset_of!(ERRF_ExceptionData, excep) - 0usize];
    ["Offset of field: ERRF_ExceptionData::regs"]
        [::core::mem::offset_of!(ERRF_ExceptionData, regs) - 24usize];
};
impl Default for ERRF_ExceptionData {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ERRF_FatalErrInfo {
    #[doc = "< Type, one of the ERRF_ERRTYPE_* enum"]
    pub type_: ERRF_ErrType,
    #[doc = "< High revison ID"]
    pub revHigh: u8_,
    #[doc = "< Low revision ID"]
    pub revLow: u16_,
    #[doc = "< Result code"]
    pub resCode: u32_,
    #[doc = "< PC address at exception"]
    pub pcAddr: u32_,
    #[doc = "< Process ID of the caller"]
    pub procId: u32_,
    #[doc = "< Title ID of the caller"]
    pub titleId: u64_,
    #[doc = "< Title ID of the running application"]
    pub appTitleId: u64_,
    #[doc = "< The different types of data for errors."]
    pub data: ERRF_FatalErrInfo__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ERRF_FatalErrInfo__bindgen_ty_1 {
    #[doc = "< Data for when type is ERRF_ERRTYPE_EXCEPTION"]
    pub exception_data: ERRF_ExceptionData,
    #[doc = "< String for when type is ERRF_ERRTYPE_FAILURE"]
    pub failure_mesg: [::libc::c_char; 96usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ERRF_FatalErrInfo__bindgen_ty_1"]
        [::core::mem::size_of::<ERRF_FatalErrInfo__bindgen_ty_1>() - 96usize];
    ["Alignment of ERRF_FatalErrInfo__bindgen_ty_1"]
        [::core::mem::align_of::<ERRF_FatalErrInfo__bindgen_ty_1>() - 4usize];
    ["Offset of field: ERRF_FatalErrInfo__bindgen_ty_1::exception_data"]
        [::core::mem::offset_of!(ERRF_FatalErrInfo__bindgen_ty_1, exception_data) - 0usize];
    ["Offset of field: ERRF_FatalErrInfo__bindgen_ty_1::failure_mesg"]
        [::core::mem::offset_of!(ERRF_FatalErrInfo__bindgen_ty_1, failure_mesg) - 0usize];
};
impl Default for ERRF_FatalErrInfo__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ERRF_FatalErrInfo"][::core::mem::size_of::<ERRF_FatalErrInfo>() - 128usize];
    ["Alignment of ERRF_FatalErrInfo"][::core::mem::align_of::<ERRF_FatalErrInfo>() - 8usize];
    ["Offset of field: ERRF_FatalErrInfo::type_"]
        [::core::mem::offset_of!(ERRF_FatalErrInfo, type_) - 0usize];
    ["Offset of field: ERRF_FatalErrInfo::revHigh"]
        [::core::mem::offset_of!(ERRF_FatalErrInfo, revHigh) - 1usize];
    ["Offset of field: ERRF_FatalErrInfo::revLow"]
        [::core::mem::offset_of!(ERRF_FatalErrInfo, revLow) - 2usize];
    ["Offset of field: ERRF_FatalErrInfo::resCode"]
        [::core::mem::offset_of!(ERRF_FatalErrInfo, resCode) - 4usize];
    ["Offset of field: ERRF_FatalErrInfo::pcAddr"]
        [::core::mem::offset_of!(ERRF_FatalErrInfo, pcAddr) - 8usize];
    ["Offset of field: ERRF_FatalErrInfo::procId"]
        [::core::mem::offset_of!(ERRF_FatalErrInfo, procId) - 12usize];
    ["Offset of field: ERRF_FatalErrInfo::titleId"]
        [::core::mem::offset_of!(ERRF_FatalErrInfo, titleId) - 16usize];
    ["Offset of field: ERRF_FatalErrInfo::appTitleId"]
        [::core::mem::offset_of!(ERRF_FatalErrInfo, appTitleId) - 24usize];
    ["Offset of field: ERRF_FatalErrInfo::data"]
        [::core::mem::offset_of!(ERRF_FatalErrInfo, data) - 32usize];
};
impl Default for ERRF_FatalErrInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Initializes ERR:f. Unless you plan to call ERRF_Throw yourself, do not use this."]
    pub fn errfInit() -> Result;
}
unsafe extern "C" {
    #[doc = "Exits ERR:f. Unless you plan to call ERRF_Throw yourself, do not use this."]
    pub fn errfExit();
}
unsafe extern "C" {
    #[doc = "Gets the current err:f API session handle.\n # Returns\n\nThe current err:f API session handle."]
    pub fn errfGetSessionHandle() -> *mut Handle;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Throws a system error and possibly logs it.\n # Arguments\n\n* `error` (direction in) - Error to throw.\n\n ErrDisp may convert the error info to ERRF_ERRTYPE_NAND_DAMAGED or ERRF_ERRTYPE_CARD_REMOVED\n depending on the error code.\n\n Except with ERRF_ERRTYPE_LOG_ONLY, the system will panic and will need to be rebooted.\n Fatal error information will also be logged into a file, unless the type either ERRF_ERRTYPE_NAND_DAMAGED\n or ERRF_ERRTYPE_CARD_REMOVED.\n\n No error will be shown if the system is asleep.\n\n On retail units with vanilla firmware, no detailed information will be displayed on screen.\n\n You may wish to use ERRF_ThrowResult() or ERRF_ThrowResultWithMessage() instead of\n constructing the ERRF_FatalErrInfo struct yourself."]
    pub fn ERRF_Throw(error: *const ERRF_FatalErrInfo) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Throws (and logs) a system error with the given Result code.\n # Arguments\n\n* `failure` (direction in) - Result code to throw.\n\n This calls ERRF_Throw with error type ERRF_ERRTYPE_GENERIC and fills in the required data.\n\n This function _does_ fill in the address where this function was called from."]
    pub fn ERRF_ThrowResult(failure: Result) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Logs a system error with the given Result code.\n # Arguments\n\n* `failure` (direction in) - Result code to log.\n\n Similar to ERRF_Throw, except that it does not display anything on the screen,\n nor does it force the system to reboot.\n\n This function _does_ fill in the address where this function was called from."]
    pub fn ERRF_LogResult(failure: Result) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Throws a system error with the given Result code and message.\n # Arguments\n\n* `failure` (direction in) - Result code to throw.\n * `message` (direction in) - The message to display.\n\n This calls ERRF_Throw with error type ERRF_ERRTYPE_FAILURE and fills in the required data.\n\n This function does _not_ fill in the address where this function was called from because it\n would not be displayed."]
    pub fn ERRF_ThrowResultWithMessage(failure: Result, message: *const ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Specify an additional user string to use for error reporting.\n # Arguments\n\n* `user_string` (direction in) - User string (up to 256 bytes, not including NUL byte)"]
    pub fn ERRF_SetUserString(user_string: *const ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[doc = "Handles an exception using ErrDisp.\n # Arguments\n\n* `excep` - Exception information\n * `regs` - CPU registers\n\n You might want to clear ENVINFO's bit0 to be able to see any debugging information.\n [`threadOnException`]"]
    pub fn ERRF_ExceptionHandler(excep: *mut ERRF_ExceptionInfo, regs: *mut CpuRegisters) -> !;
}
#[doc = "Kernel configuration page (read-only)."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct osKernelConfig_s {
    pub kernel_ver: u32_,
    pub update_flag: u32_,
    pub ns_tid: u64_,
    pub kernel_syscore_ver: u32_,
    pub env_info: u8_,
    pub unit_info: u8_,
    pub boot_env: u8_,
    pub unk_0x17: u8_,
    pub kernel_ctrsdk_ver: u32_,
    pub unk_0x1c: u32_,
    pub firmlaunch_flags: u32_,
    pub unk_0x24: [u8_; 12usize],
    pub app_memtype: u32_,
    pub unk_0x34: [u8_; 12usize],
    pub memregion_sz: [u32_; 3usize],
    pub unk_0x4c: [u8_; 20usize],
    pub firm_ver: u32_,
    pub firm_syscore_ver: u32_,
    pub firm_ctrsdk_ver: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of osKernelConfig_s"][::core::mem::size_of::<osKernelConfig_s>() - 112usize];
    ["Alignment of osKernelConfig_s"][::core::mem::align_of::<osKernelConfig_s>() - 8usize];
    ["Offset of field: osKernelConfig_s::kernel_ver"]
        [::core::mem::offset_of!(osKernelConfig_s, kernel_ver) - 0usize];
    ["Offset of field: osKernelConfig_s::update_flag"]
        [::core::mem::offset_of!(osKernelConfig_s, update_flag) - 4usize];
    ["Offset of field: osKernelConfig_s::ns_tid"]
        [::core::mem::offset_of!(osKernelConfig_s, ns_tid) - 8usize];
    ["Offset of field: osKernelConfig_s::kernel_syscore_ver"]
        [::core::mem::offset_of!(osKernelConfig_s, kernel_syscore_ver) - 16usize];
    ["Offset of field: osKernelConfig_s::env_info"]
        [::core::mem::offset_of!(osKernelConfig_s, env_info) - 20usize];
    ["Offset of field: osKernelConfig_s::unit_info"]
        [::core::mem::offset_of!(osKernelConfig_s, unit_info) - 21usize];
    ["Offset of field: osKernelConfig_s::boot_env"]
        [::core::mem::offset_of!(osKernelConfig_s, boot_env) - 22usize];
    ["Offset of field: osKernelConfig_s::unk_0x17"]
        [::core::mem::offset_of!(osKernelConfig_s, unk_0x17) - 23usize];
    ["Offset of field: osKernelConfig_s::kernel_ctrsdk_ver"]
        [::core::mem::offset_of!(osKernelConfig_s, kernel_ctrsdk_ver) - 24usize];
    ["Offset of field: osKernelConfig_s::unk_0x1c"]
        [::core::mem::offset_of!(osKernelConfig_s, unk_0x1c) - 28usize];
    ["Offset of field: osKernelConfig_s::firmlaunch_flags"]
        [::core::mem::offset_of!(osKernelConfig_s, firmlaunch_flags) - 32usize];
    ["Offset of field: osKernelConfig_s::unk_0x24"]
        [::core::mem::offset_of!(osKernelConfig_s, unk_0x24) - 36usize];
    ["Offset of field: osKernelConfig_s::app_memtype"]
        [::core::mem::offset_of!(osKernelConfig_s, app_memtype) - 48usize];
    ["Offset of field: osKernelConfig_s::unk_0x34"]
        [::core::mem::offset_of!(osKernelConfig_s, unk_0x34) - 52usize];
    ["Offset of field: osKernelConfig_s::memregion_sz"]
        [::core::mem::offset_of!(osKernelConfig_s, memregion_sz) - 64usize];
    ["Offset of field: osKernelConfig_s::unk_0x4c"]
        [::core::mem::offset_of!(osKernelConfig_s, unk_0x4c) - 76usize];
    ["Offset of field: osKernelConfig_s::firm_ver"]
        [::core::mem::offset_of!(osKernelConfig_s, firm_ver) - 96usize];
    ["Offset of field: osKernelConfig_s::firm_syscore_ver"]
        [::core::mem::offset_of!(osKernelConfig_s, firm_syscore_ver) - 100usize];
    ["Offset of field: osKernelConfig_s::firm_ctrsdk_ver"]
        [::core::mem::offset_of!(osKernelConfig_s, firm_ctrsdk_ver) - 104usize];
};
#[doc = "Time reference information struct (filled in by PTM)."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct osTimeRef_s {
    #[doc = "< Milliseconds elapsed since January 1900 when this structure was last updated"]
    pub value_ms: u64_,
    #[doc = "< System ticks elapsed since boot when this structure was last updated"]
    pub value_tick: u64_,
    #[doc = "< System clock frequency in Hz adjusted using RTC measurements (usually around SYSCLOCK_ARM11)"]
    pub sysclock_hz: s64,
    #[doc = "< Measured time drift of the system clock (according to the RTC) in milliseconds since the last update"]
    pub drift_ms: s64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of osTimeRef_s"][::core::mem::size_of::<osTimeRef_s>() - 32usize];
    ["Alignment of osTimeRef_s"][::core::mem::align_of::<osTimeRef_s>() - 8usize];
    ["Offset of field: osTimeRef_s::value_ms"]
        [::core::mem::offset_of!(osTimeRef_s, value_ms) - 0usize];
    ["Offset of field: osTimeRef_s::value_tick"]
        [::core::mem::offset_of!(osTimeRef_s, value_tick) - 8usize];
    ["Offset of field: osTimeRef_s::sysclock_hz"]
        [::core::mem::offset_of!(osTimeRef_s, sysclock_hz) - 16usize];
    ["Offset of field: osTimeRef_s::drift_ms"]
        [::core::mem::offset_of!(osTimeRef_s, drift_ms) - 24usize];
};
#[doc = "Shared system configuration page structure (read-only or read-write depending on exheader)."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct osSharedConfig_s {
    pub timeref_cnt: vu32,
    pub running_hw: u8_,
    pub mcu_hwinfo: u8_,
    pub unk_0x06: [u8_; 26usize],
    pub timeref: [osTimeRef_s; 2usize],
    pub wifi_macaddr: [u8_; 6usize],
    pub wifi_strength: vu8,
    pub network_state: vu8,
    pub unk_0x68: [u8_; 24usize],
    pub slider_3d: f32,
    pub led_3d: vu8,
    pub led_battery: vu8,
    pub unk_flag: vu8,
    pub unk_0x87: u8_,
    pub unk_0x88: [u8_; 24usize],
    pub menu_tid: vu64,
    pub cur_menu_tid: vu64,
    pub unk_0xB0: [u8_; 16usize],
    pub headset_connected: vu8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of osSharedConfig_s"][::core::mem::size_of::<osSharedConfig_s>() - 200usize];
    ["Alignment of osSharedConfig_s"][::core::mem::align_of::<osSharedConfig_s>() - 8usize];
    ["Offset of field: osSharedConfig_s::timeref_cnt"]
        [::core::mem::offset_of!(osSharedConfig_s, timeref_cnt) - 0usize];
    ["Offset of field: osSharedConfig_s::running_hw"]
        [::core::mem::offset_of!(osSharedConfig_s, running_hw) - 4usize];
    ["Offset of field: osSharedConfig_s::mcu_hwinfo"]
        [::core::mem::offset_of!(osSharedConfig_s, mcu_hwinfo) - 5usize];
    ["Offset of field: osSharedConfig_s::unk_0x06"]
        [::core::mem::offset_of!(osSharedConfig_s, unk_0x06) - 6usize];
    ["Offset of field: osSharedConfig_s::timeref"]
        [::core::mem::offset_of!(osSharedConfig_s, timeref) - 32usize];
    ["Offset of field: osSharedConfig_s::wifi_macaddr"]
        [::core::mem::offset_of!(osSharedConfig_s, wifi_macaddr) - 96usize];
    ["Offset of field: osSharedConfig_s::wifi_strength"]
        [::core::mem::offset_of!(osSharedConfig_s, wifi_strength) - 102usize];
    ["Offset of field: osSharedConfig_s::network_state"]
        [::core::mem::offset_of!(osSharedConfig_s, network_state) - 103usize];
    ["Offset of field: osSharedConfig_s::unk_0x68"]
        [::core::mem::offset_of!(osSharedConfig_s, unk_0x68) - 104usize];
    ["Offset of field: osSharedConfig_s::slider_3d"]
        [::core::mem::offset_of!(osSharedConfig_s, slider_3d) - 128usize];
    ["Offset of field: osSharedConfig_s::led_3d"]
        [::core::mem::offset_of!(osSharedConfig_s, led_3d) - 132usize];
    ["Offset of field: osSharedConfig_s::led_battery"]
        [::core::mem::offset_of!(osSharedConfig_s, led_battery) - 133usize];
    ["Offset of field: osSharedConfig_s::unk_flag"]
        [::core::mem::offset_of!(osSharedConfig_s, unk_flag) - 134usize];
    ["Offset of field: osSharedConfig_s::unk_0x87"]
        [::core::mem::offset_of!(osSharedConfig_s, unk_0x87) - 135usize];
    ["Offset of field: osSharedConfig_s::unk_0x88"]
        [::core::mem::offset_of!(osSharedConfig_s, unk_0x88) - 136usize];
    ["Offset of field: osSharedConfig_s::menu_tid"]
        [::core::mem::offset_of!(osSharedConfig_s, menu_tid) - 160usize];
    ["Offset of field: osSharedConfig_s::cur_menu_tid"]
        [::core::mem::offset_of!(osSharedConfig_s, cur_menu_tid) - 168usize];
    ["Offset of field: osSharedConfig_s::unk_0xB0"]
        [::core::mem::offset_of!(osSharedConfig_s, unk_0xB0) - 176usize];
    ["Offset of field: osSharedConfig_s::headset_connected"]
        [::core::mem::offset_of!(osSharedConfig_s, headset_connected) - 192usize];
};
#[doc = "Tick counter."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TickCounter {
    #[doc = "< Elapsed CPU ticks between measurements."]
    pub elapsed: u64_,
    #[doc = "< Point in time used as reference."]
    pub reference: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TickCounter"][::core::mem::size_of::<TickCounter>() - 16usize];
    ["Alignment of TickCounter"][::core::mem::align_of::<TickCounter>() - 8usize];
    ["Offset of field: TickCounter::elapsed"]
        [::core::mem::offset_of!(TickCounter, elapsed) - 0usize];
    ["Offset of field: TickCounter::reference"]
        [::core::mem::offset_of!(TickCounter, reference) - 8usize];
};
#[doc = "OS_VersionBin. Format of the system version: \"<major>.<minor>.<build>-<nupver><region>\""]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct OS_VersionBin {
    pub build: u8_,
    pub minor: u8_,
    pub mainver: u8_,
    pub reserved_x3: u8_,
    pub region: ::libc::c_char,
    pub reserved_x5: [u8_; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OS_VersionBin"][::core::mem::size_of::<OS_VersionBin>() - 8usize];
    ["Alignment of OS_VersionBin"][::core::mem::align_of::<OS_VersionBin>() - 1usize];
    ["Offset of field: OS_VersionBin::build"]
        [::core::mem::offset_of!(OS_VersionBin, build) - 0usize];
    ["Offset of field: OS_VersionBin::minor"]
        [::core::mem::offset_of!(OS_VersionBin, minor) - 1usize];
    ["Offset of field: OS_VersionBin::mainver"]
        [::core::mem::offset_of!(OS_VersionBin, mainver) - 2usize];
    ["Offset of field: OS_VersionBin::reserved_x3"]
        [::core::mem::offset_of!(OS_VersionBin, reserved_x3) - 3usize];
    ["Offset of field: OS_VersionBin::region"]
        [::core::mem::offset_of!(OS_VersionBin, region) - 4usize];
    ["Offset of field: OS_VersionBin::reserved_x5"]
        [::core::mem::offset_of!(OS_VersionBin, reserved_x5) - 5usize];
};
unsafe extern "C" {
    #[doc = "Converts an address from virtual (process) memory to physical memory.\n # Arguments\n\n* `vaddr` - Input virtual address.\n # Returns\n\nThe corresponding physical address.\n It is sometimes required by services or when using the GPU command buffer."]
    pub fn osConvertVirtToPhys(vaddr: *const ::libc::c_void) -> u32_;
}
unsafe extern "C" {
    #[doc = "Converts 0x14* vmem to 0x30*.\n # Arguments\n\n* `vaddr` - Input virtual address.\n # Returns\n\nThe corresponding address in the 0x30* range, the input address if it's already within the new vmem, or 0 if it's outside of both ranges."]
    pub fn osConvertOldLINEARMemToNew(vaddr: *const ::libc::c_void) -> *mut ::libc::c_void;
}
unsafe extern "C" {
    #[doc = "Retrieves basic information about a service error.\n # Arguments\n\n* `error` - Error to retrieve information about.\n # Returns\n\nA string containing a summary of an error.\n\n This can be used to get some details about an error returned by a service call."]
    pub fn osStrError(error: Result) -> *const ::libc::c_char;
}
unsafe extern "C" {
    #[doc = "Gets the system's FIRM version.\n # Returns\n\nThe system's FIRM version.\n\n This can be used to compare system versions easily with SYSTEM_VERSION."]
    #[link_name = "osGetFirmVersion__extern"]
    pub fn osGetFirmVersion() -> u32_;
}
unsafe extern "C" {
    #[doc = "Gets the system's kernel version.\n # Returns\n\nThe system's kernel version.\n\n This can be used to compare system versions easily with SYSTEM_VERSION.\n\n if(osGetKernelVersion() > SYSTEM_VERSION(2,46,0)) printf(\"You are running 9.0 or higher"]
    #[link_name = "osGetKernelVersion__extern"]
    pub fn osGetKernelVersion() -> u32_;
}
unsafe extern "C" {
    #[doc = "Gets the system's \"core version\" (2 on NATIVE_FIRM, 3 on SAFE_FIRM, etc.)"]
    #[link_name = "osGetSystemCoreVersion__extern"]
    pub fn osGetSystemCoreVersion() -> u32_;
}
unsafe extern "C" {
    #[doc = "Gets the system's memory layout ID (0-5 on Old 3DS, 6-8 on New 3DS)"]
    #[link_name = "osGetApplicationMemType__extern"]
    pub fn osGetApplicationMemType() -> u32_;
}
unsafe extern "C" {
    #[doc = "Gets the size of the specified memory region.\n # Arguments\n\n* `region` - Memory region to check.\n # Returns\n\nThe size of the memory region, in bytes."]
    #[link_name = "osGetMemRegionSize__extern"]
    pub fn osGetMemRegionSize(region: MemRegion) -> u32_;
}
unsafe extern "C" {
    #[doc = "Gets the number of used bytes within the specified memory region.\n # Arguments\n\n* `region` - Memory region to check.\n # Returns\n\nThe number of used bytes of memory."]
    #[link_name = "osGetMemRegionUsed__extern"]
    pub fn osGetMemRegionUsed(region: MemRegion) -> u32_;
}
unsafe extern "C" {
    #[doc = "Gets the number of free bytes within the specified memory region.\n # Arguments\n\n* `region` - Memory region to check.\n # Returns\n\nThe number of free bytes of memory."]
    #[link_name = "osGetMemRegionFree__extern"]
    pub fn osGetMemRegionFree(region: MemRegion) -> u32_;
}
unsafe extern "C" {
    #[doc = "Reads the latest reference timepoint published by PTM.\n # Returns\n\nStructure (see osTimeRef_s)."]
    pub fn osGetTimeRef() -> osTimeRef_s;
}
unsafe extern "C" {
    #[doc = "Gets the current time.\n # Returns\n\nThe number of milliseconds since 1st Jan 1900 00:00."]
    pub fn osGetTime() -> u64_;
}
unsafe extern "C" {
    #[doc = "Starts a tick counter.\n # Arguments\n\n* `cnt` - The tick counter."]
    #[link_name = "osTickCounterStart__extern"]
    pub fn osTickCounterStart(cnt: *mut TickCounter);
}
unsafe extern "C" {
    #[doc = "Updates the elapsed time in a tick counter.\n # Arguments\n\n* `cnt` - The tick counter."]
    #[link_name = "osTickCounterUpdate__extern"]
    pub fn osTickCounterUpdate(cnt: *mut TickCounter);
}
unsafe extern "C" {
    #[doc = "Reads the elapsed time in a tick counter.\n # Arguments\n\n* `cnt` - The tick counter.\n # Returns\n\nThe number of milliseconds elapsed."]
    pub fn osTickCounterRead(cnt: *const TickCounter) -> f64;
}
unsafe extern "C" {
    #[doc = "Gets the current Wifi signal strength.\n # Returns\n\nThe current Wifi signal strength.\n\n Valid values are 0-3:\n - 0 means the signal strength is terrible or the 3DS is disconnected from\n all networks.\n - 1 means the signal strength is bad.\n - 2 means the signal strength is decent.\n - 3 means the signal strength is good.\n\n Values outside the range of 0-3 should never be returned.\n\n These values correspond with the number of wifi bars displayed by Home Menu."]
    #[link_name = "osGetWifiStrength__extern"]
    pub fn osGetWifiStrength() -> u8_;
}
unsafe extern "C" {
    #[doc = "Gets the state of the 3D slider.\n # Returns\n\nThe state of the 3D slider (0.0~1.0)"]
    #[link_name = "osGet3DSliderState__extern"]
    pub fn osGet3DSliderState() -> f32;
}
unsafe extern "C" {
    #[doc = "Checks whether a headset is connected.\n # Returns\n\ntrue or false."]
    #[link_name = "osIsHeadsetConnected__extern"]
    pub fn osIsHeadsetConnected() -> bool;
}
unsafe extern "C" {
    #[doc = "Configures the New 3DS speedup.\n # Arguments\n\n* `enable` - Specifies whether to enable or disable the speedup."]
    pub fn osSetSpeedupEnable(enable: bool);
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the NAND system-version stored in NVer/CVer.\n # Arguments\n\n* `nver_versionbin` - Output OS_VersionBin structure for the data read from NVer.\n * `cver_versionbin` - Output OS_VersionBin structure for the data read from CVer.\n # Returns\n\nThe result-code. This value can be positive if opening \"romfs:/version.bin\" fails with stdio, since errno would be returned in that case. In some cases the error can be special negative values as well."]
    pub fn osGetSystemVersionData(
        nver_versionbin: *mut OS_VersionBin,
        cver_versionbin: *mut OS_VersionBin,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "This is a wrapper for osGetSystemVersionData.\n # Arguments\n\n* `nver_versionbin` - Optional output OS_VersionBin structure for the data read from NVer, can be NULL.\n * `cver_versionbin` - Optional output OS_VersionBin structure for the data read from CVer, can be NULL.\n * `sysverstr` - Output string where the printed system-version will be written, in the same format displayed by the System Settings title.\n * `sysverstr_maxsize` - Max size of the above string buffer, *including* NULL-terminator.\n # Returns\n\nSee osGetSystemVersionData."]
    pub fn osGetSystemVersionDataString(
        nver_versionbin: *mut OS_VersionBin,
        cver_versionbin: *mut OS_VersionBin,
        sysverstr: *mut ::libc::c_char,
        sysverstr_maxsize: u32_,
    ) -> Result;
}
pub type _LOCK_T = i32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __lock_t {
    pub lock: _LOCK_T,
    pub thread_tag: u32,
    pub counter: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __lock_t"][::core::mem::size_of::<__lock_t>() - 12usize];
    ["Alignment of __lock_t"][::core::mem::align_of::<__lock_t>() - 4usize];
    ["Offset of field: __lock_t::lock"][::core::mem::offset_of!(__lock_t, lock) - 0usize];
    ["Offset of field: __lock_t::thread_tag"]
        [::core::mem::offset_of!(__lock_t, thread_tag) - 4usize];
    ["Offset of field: __lock_t::counter"][::core::mem::offset_of!(__lock_t, counter) - 8usize];
};
pub type _LOCK_RECURSIVE_T = __lock_t;
#[doc = "A light lock."]
pub type LightLock = _LOCK_T;
#[doc = "A recursive lock."]
pub type RecursiveLock = _LOCK_RECURSIVE_T;
#[doc = "A condition variable."]
pub type CondVar = s32;
#[doc = "A light event."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct LightEvent {
    #[doc = "< State of the event: -2=cleared sticky, -1=cleared oneshot, 0=signaled oneshot, 1=signaled sticky"]
    pub state: s32,
    #[doc = "< Lock used for sticky timer operation"]
    pub lock: LightLock,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LightEvent"][::core::mem::size_of::<LightEvent>() - 8usize];
    ["Alignment of LightEvent"][::core::mem::align_of::<LightEvent>() - 4usize];
    ["Offset of field: LightEvent::state"][::core::mem::offset_of!(LightEvent, state) - 0usize];
    ["Offset of field: LightEvent::lock"][::core::mem::offset_of!(LightEvent, lock) - 4usize];
};
#[doc = "A light semaphore."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct LightSemaphore {
    #[doc = "< The current release count of the semaphore"]
    pub current_count: s32,
    #[doc = "< Number of threads concurrently acquiring the semaphore"]
    pub num_threads_acq: s16,
    #[doc = "< The maximum release count of the semaphore"]
    pub max_count: s16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LightSemaphore"][::core::mem::size_of::<LightSemaphore>() - 8usize];
    ["Alignment of LightSemaphore"][::core::mem::align_of::<LightSemaphore>() - 4usize];
    ["Offset of field: LightSemaphore::current_count"]
        [::core::mem::offset_of!(LightSemaphore, current_count) - 0usize];
    ["Offset of field: LightSemaphore::num_threads_acq"]
        [::core::mem::offset_of!(LightSemaphore, num_threads_acq) - 4usize];
    ["Offset of field: LightSemaphore::max_count"]
        [::core::mem::offset_of!(LightSemaphore, max_count) - 6usize];
};
unsafe extern "C" {
    #[doc = "Performs a Data Synchronization Barrier operation."]
    #[link_name = "__dsb__extern"]
    pub fn __dsb();
}
unsafe extern "C" {
    #[doc = "Performs a Data Memory Barrier operation."]
    #[link_name = "__dmb__extern"]
    pub fn __dmb();
}
unsafe extern "C" {
    #[doc = "Performs an Instruction Synchronization Barrier (officially \"flush prefetch buffer\") operation."]
    #[link_name = "__isb__extern"]
    pub fn __isb();
}
unsafe extern "C" {
    #[doc = "Performs a clrex operation."]
    #[link_name = "__clrex__extern"]
    pub fn __clrex();
}
unsafe extern "C" {
    #[doc = "Performs a ldrex operation.\n # Arguments\n\n* `addr` - Address to perform the operation on.\n # Returns\n\nThe resulting value."]
    #[link_name = "__ldrex__extern"]
    pub fn __ldrex(addr: *mut s32) -> s32;
}
unsafe extern "C" {
    #[doc = "Performs a strex operation.\n # Arguments\n\n* `addr` - Address to perform the operation on.\n * `val` - Value to store.\n # Returns\n\nWhether the operation was successful."]
    #[link_name = "__strex__extern"]
    pub fn __strex(addr: *mut s32, val: s32) -> bool;
}
unsafe extern "C" {
    #[doc = "Performs a ldrexh operation.\n # Arguments\n\n* `addr` - Address to perform the operation on.\n # Returns\n\nThe resulting value."]
    #[link_name = "__ldrexh__extern"]
    pub fn __ldrexh(addr: *mut u16_) -> u16_;
}
unsafe extern "C" {
    #[doc = "Performs a strexh operation.\n # Arguments\n\n* `addr` - Address to perform the operation on.\n * `val` - Value to store.\n # Returns\n\nWhether the operation was successful."]
    #[link_name = "__strexh__extern"]
    pub fn __strexh(addr: *mut u16_, val: u16_) -> bool;
}
unsafe extern "C" {
    #[doc = "Performs a ldrexb operation.\n # Arguments\n\n* `addr` - Address to perform the operation on.\n # Returns\n\nThe resulting value."]
    #[link_name = "__ldrexb__extern"]
    pub fn __ldrexb(addr: *mut u8_) -> u8_;
}
unsafe extern "C" {
    #[doc = "Performs a strexb operation.\n # Arguments\n\n* `addr` - Address to perform the operation on.\n * `val` - Value to store.\n # Returns\n\nWhether the operation was successful."]
    #[link_name = "__strexb__extern"]
    pub fn __strexb(addr: *mut u8_, val: u8_) -> bool;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Function used to implement user-mode synchronization primitives.\n # Arguments\n\n* `addr` - Pointer to a signed 32-bit value whose address will be used to identify waiting threads.\n * `type` - Type of action to be performed by the arbiter\n * `value` - Number of threads to signal if using ARBITRATION_SIGNAL, or the value used for comparison.\n\n This will perform an arbitration based on #type. The comparisons are done between #value and the value at the address #addr.\n\n s32 val=0;\n // Does *nothing* since val >= 0\n syncArbitrateAddress(&val,ARBITRATION_WAIT_IF_LESS_THAN,0);\n > **Note:** Usage of this function entails an implicit Data Memory Barrier (dmb)."]
    pub fn syncArbitrateAddress(addr: *mut s32, type_: ArbitrationType, value: s32) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Function used to implement user-mode synchronization primitives (with timeout).\n # Arguments\n\n* `addr` - Pointer to a signed 32-bit value whose address will be used to identify waiting threads.\n * `type` - Type of action to be performed by the arbiter (must use ARBITRATION_WAIT_IF_LESS_THAN_TIMEOUT or ARBITRATION_DECREMENT_AND_WAIT_IF_LESS_THAN_TIMEOUT)\n * `value` - Number of threads to signal if using ARBITRATION_SIGNAL, or the value used for comparison.\n\n This will perform an arbitration based on #type. The comparisons are done between #value and the value at the address #addr.\n\n s32 val=0;\n // Thread will wait for a signal or wake up after 10000000 nanoseconds because val < 1.\n syncArbitrateAddressWithTimeout(&val,ARBITRATION_WAIT_IF_LESS_THAN_TIMEOUT,1,10000000LL);\n > **Note:** Usage of this function entails an implicit Data Memory Barrier (dmb)."]
    pub fn syncArbitrateAddressWithTimeout(
        addr: *mut s32,
        type_: ArbitrationType,
        value: s32,
        timeout_ns: s64,
    ) -> Result;
}
unsafe extern "C" {
    #[doc = "Initializes a light lock.\n # Arguments\n\n* `lock` - Pointer to the lock."]
    pub fn LightLock_Init(lock: *mut LightLock);
}
unsafe extern "C" {
    #[doc = "Locks a light lock.\n # Arguments\n\n* `lock` - Pointer to the lock."]
    pub fn LightLock_Lock(lock: *mut LightLock);
}
unsafe extern "C" {
    #[doc = "Attempts to lock a light lock.\n # Arguments\n\n* `lock` - Pointer to the lock.\n # Returns\n\nZero on success, non-zero on failure."]
    pub fn LightLock_TryLock(lock: *mut LightLock) -> ::libc::c_int;
}
unsafe extern "C" {
    #[doc = "Unlocks a light lock.\n # Arguments\n\n* `lock` - Pointer to the lock."]
    pub fn LightLock_Unlock(lock: *mut LightLock);
}
unsafe extern "C" {
    #[doc = "Initializes a recursive lock.\n # Arguments\n\n* `lock` - Pointer to the lock."]
    pub fn RecursiveLock_Init(lock: *mut RecursiveLock);
}
unsafe extern "C" {
    #[doc = "Locks a recursive lock.\n # Arguments\n\n* `lock` - Pointer to the lock."]
    pub fn RecursiveLock_Lock(lock: *mut RecursiveLock);
}
unsafe extern "C" {
    #[doc = "Attempts to lock a recursive lock.\n # Arguments\n\n* `lock` - Pointer to the lock.\n # Returns\n\nZero on success, non-zero on failure."]
    pub fn RecursiveLock_TryLock(lock: *mut RecursiveLock) -> ::libc::c_int;
}
unsafe extern "C" {
    #[doc = "Unlocks a recursive lock.\n # Arguments\n\n* `lock` - Pointer to the lock."]
    pub fn RecursiveLock_Unlock(lock: *mut RecursiveLock);
}
unsafe extern "C" {
    #[doc = "Initializes a condition variable.\n # Arguments\n\n* `cv` - Pointer to the condition variable."]
    pub fn CondVar_Init(cv: *mut CondVar);
}
unsafe extern "C" {
    #[doc = "Waits on a condition variable.\n # Arguments\n\n* `cv` - Pointer to the condition variable.\n * `lock` - Pointer to the lock to atomically unlock/relock during the wait."]
    pub fn CondVar_Wait(cv: *mut CondVar, lock: *mut LightLock);
}
unsafe extern "C" {
    #[doc = "Waits on a condition variable with a timeout.\n # Arguments\n\n* `cv` - Pointer to the condition variable.\n * `lock` - Pointer to the lock to atomically unlock/relock during the wait.\n * `timeout_ns` - Timeout in nanoseconds.\n # Returns\n\nZero on success, non-zero on failure."]
    pub fn CondVar_WaitTimeout(
        cv: *mut CondVar,
        lock: *mut LightLock,
        timeout_ns: s64,
    ) -> ::libc::c_int;
}
unsafe extern "C" {
    #[doc = "Wakes up threads waiting on a condition variable.\n # Arguments\n\n* `cv` - Pointer to the condition variable.\n * `num_threads` - Maximum number of threads to wake up (or ARBITRATION_SIGNAL_ALL to wake them all)."]
    pub fn CondVar_WakeUp(cv: *mut CondVar, num_threads: s32);
}
unsafe extern "C" {
    #[doc = "Wakes up a single thread waiting on a condition variable.\n # Arguments\n\n* `cv` - Pointer to the condition variable."]
    #[link_name = "CondVar_Signal__extern"]
    pub fn CondVar_Signal(cv: *mut CondVar);
}
unsafe extern "C" {
    #[doc = "Wakes up all threads waiting on a condition variable.\n # Arguments\n\n* `cv` - Pointer to the condition variable."]
    #[link_name = "CondVar_Broadcast__extern"]
    pub fn CondVar_Broadcast(cv: *mut CondVar);
}
unsafe extern "C" {
    #[doc = "Initializes a light event.\n # Arguments\n\n* `event` - Pointer to the event.\n * `reset_type` - Type of reset the event uses (RESET_ONESHOT/RESET_STICKY)."]
    pub fn LightEvent_Init(event: *mut LightEvent, reset_type: ResetType);
}
unsafe extern "C" {
    #[doc = "Clears a light event.\n # Arguments\n\n* `event` - Pointer to the event."]
    pub fn LightEvent_Clear(event: *mut LightEvent);
}
unsafe extern "C" {
    #[doc = "Wakes up threads waiting on a sticky light event without signaling it. If the event had been signaled before, it is cleared instead.\n # Arguments\n\n* `event` - Pointer to the event."]
    pub fn LightEvent_Pulse(event: *mut LightEvent);
}
unsafe extern "C" {
    #[doc = "Signals a light event, waking up threads waiting on it.\n # Arguments\n\n* `event` - Pointer to the event."]
    pub fn LightEvent_Signal(event: *mut LightEvent);
}
unsafe extern "C" {
    #[doc = "Attempts to wait on a light event.\n # Arguments\n\n* `event` - Pointer to the event.\n # Returns\n\nNon-zero if the event was signaled, zero otherwise."]
    pub fn LightEvent_TryWait(event: *mut LightEvent) -> ::libc::c_int;
}
unsafe extern "C" {
    #[doc = "Waits on a light event.\n # Arguments\n\n* `event` - Pointer to the event."]
    pub fn LightEvent_Wait(event: *mut LightEvent);
}
unsafe extern "C" {
    #[doc = "Waits on a light event until either the event is signaled or the timeout is reached.\n # Arguments\n\n* `event` - Pointer to the event.\n * `timeout_ns` - Timeout in nanoseconds.\n # Returns\n\nNon-zero on timeout, zero otherwise."]
    pub fn LightEvent_WaitTimeout(event: *mut LightEvent, timeout_ns: s64) -> ::libc::c_int;
}
unsafe extern "C" {
    #[doc = "Initializes a light semaphore.\n # Arguments\n\n* `event` - Pointer to the semaphore.\n * `max_count` - Initial count of the semaphore.\n * `max_count` - Maximum count of the semaphore."]
    pub fn LightSemaphore_Init(semaphore: *mut LightSemaphore, initial_count: s16, max_count: s16);
}
unsafe extern "C" {
    #[doc = "Acquires a light semaphore.\n # Arguments\n\n* `semaphore` - Pointer to the semaphore.\n * `count` - Acquire count"]
    pub fn LightSemaphore_Acquire(semaphore: *mut LightSemaphore, count: s32);
}
unsafe extern "C" {
    #[doc = "Attempts to acquire a light semaphore.\n # Arguments\n\n* `semaphore` - Pointer to the semaphore.\n * `count` - Acquire count\n # Returns\n\nZero on success, non-zero on failure"]
    pub fn LightSemaphore_TryAcquire(semaphore: *mut LightSemaphore, count: s32) -> ::libc::c_int;
}
unsafe extern "C" {
    #[doc = "Releases a light semaphore.\n # Arguments\n\n* `semaphore` - Pointer to the semaphore.\n * `count` - Release count"]
    pub fn LightSemaphore_Release(semaphore: *mut LightSemaphore, count: s32);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Thread_tag {
    _unused: [u8; 0],
}
#[doc = "libctru thread handle type"]
pub type Thread = *mut Thread_tag;
#[doc = "Exception handler type, necessarily an ARM function that does not return."]
pub type ExceptionHandler = ::core::option::Option<
    unsafe extern "C" fn(excep: *mut ERRF_ExceptionInfo, regs: *mut CpuRegisters),
>;
unsafe extern "C" {
    #[doc = "Creates a new libctru thread.\n # Arguments\n\n* `entrypoint` - The function that will be called first upon thread creation\n * `arg` - The argument passed to `entrypoint`\n * `stack_size` - The size of the stack that will be allocated for the thread (will be rounded to a multiple of 8 bytes)\n * `prio` - Low values gives the thread higher priority.\n For userland apps, this has to be within the range [0x18;0x3F].\n The main thread usually has a priority of 0x30, but not always. Use svcGetThreadPriority() if you need\n to create a thread with a priority that is explicitly greater or smaller than that of the main thread.\n * `core_id` - The ID of the processor the thread should be ran on. Processor IDs are labeled starting from 0.\n On Old3DS it must be <2, and on New3DS it must be <4.\n Pass -1 to execute the thread on all CPUs and -2 to execute the thread on the default CPU (read from the Exheader).\n * `detached` - When set to true, the thread is automatically freed when it finishes.\n # Returns\n\nThe libctru thread handle on success, NULL on failure.\n\n - Processor #0 is the application core. It is always possible to create a thread on this core.\n - Processor #1 is the system core. If APT_SetAppCpuTimeLimit is used, it is possible to create a single thread on this core.\n - Processor #2 is New3DS exclusive. Normal applications can create threads on this core if the exheader kernel flags bitmask has 0x2000 set.\n - Processor #3 is New3DS exclusive. Normal applications cannot create threads on this core.\n - Processes in the BASE memory region can always create threads on processors #2 and #3.\n\n > **Note:** Default exit code of a thread is 0.\n svcExitThread should never be called from the thread, use threadExit instead."]
    pub fn threadCreate(
        entrypoint: ThreadFunc,
        arg: *mut ::libc::c_void,
        stack_size: usize,
        prio: ::libc::c_int,
        core_id: ::libc::c_int,
        detached: bool,
    ) -> Thread;
}
unsafe extern "C" {
    #[doc = "Retrieves the OS thread handle of a libctru thread.\n # Arguments\n\n* `thread` - libctru thread handle\n # Returns\n\nOS thread handle"]
    pub fn threadGetHandle(thread: Thread) -> Handle;
}
unsafe extern "C" {
    #[doc = "Retrieves the exit code of a finished libctru thread.\n # Arguments\n\n* `thread` - libctru thread handle\n # Returns\n\nExit code"]
    pub fn threadGetExitCode(thread: Thread) -> ::libc::c_int;
}
unsafe extern "C" {
    #[doc = "Frees a finished libctru thread.\n # Arguments\n\n* `thread` - libctru thread handle\n > This function should not be called if the thread is detached, as it is freed automatically when it finishes."]
    pub fn threadFree(thread: Thread);
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Waits for a libctru thread to finish (or returns immediately if it is already finished).\n # Arguments\n\n* `thread` - libctru thread handle\n * `timeout_ns` - Timeout in nanoseconds. Pass U64_MAX if a timeout isn't desired"]
    pub fn threadJoin(thread: Thread, timeout_ns: u64_) -> Result;
}
unsafe extern "C" {
    #[doc = "Changes a thread's status from attached to detached.\n # Arguments\n\n* `thread` - libctru thread handle"]
    pub fn threadDetach(thread: Thread);
}
unsafe extern "C" {
    #[doc = "Retrieves the libctru thread handle of the current thread.\n # Returns\n\nlibctru thread handle of the current thread, or NULL for the main thread"]
    pub fn threadGetCurrent() -> Thread;
}
unsafe extern "C" {
    #[doc = "Exits the current libctru thread with an exit code (not usable from the main thread).\n # Arguments\n\n* `rc` - Exit code"]
    pub fn threadExit(rc: ::libc::c_int) -> !;
}
unsafe extern "C" {
    #[doc = "Sets the exception handler for the current thread. Called from the main thread, this sets the default handler.\n # Arguments\n\n* `handler` - The exception handler, necessarily an ARM function that does not return\n * `stack_top` - A pointer to the top of the stack that will be used by the handler. See also RUN_HANDLER_ON_FAULTING_STACK\n * `exception_data` - A pointer to the buffer that will contain the exception data.\nSee also WRITE_DATA_TO_HANDLER_STACK and WRITE_DATA_TO_FAULTING_STACK\n\n To have CPU exceptions reported through this mechanism, it is normally necessary that UNITINFO is set to a non-zero value when Kernel11 starts,\n and this mechanism is also controlled by svcKernelSetState type 6, see 3dbrew.\n\n VFP exceptions are always reported this way even if the process is being debugged using the debug SVCs.\n\n The current thread need not be a libctru thread."]
    #[link_name = "threadOnException__extern"]
    pub fn threadOnException(
        handler: ExceptionHandler,
        stack_top: *mut ::libc::c_void,
        exception_data: *mut ERRF_ExceptionData,
    );
}
#[doc = "Framebuffer information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GSPGPU_FramebufferInfo {
    #[doc = "< Active framebuffer. (0 = first, 1 = second)"]
    pub active_framebuf: u32_,
    #[doc = "< Framebuffer virtual address, for the main screen this is the 3D left framebuffer."]
    pub framebuf0_vaddr: *mut u32_,
    #[doc = "< For the main screen: 3D right framebuffer address."]
    pub framebuf1_vaddr: *mut u32_,
    #[doc = "< Value for 0x1EF00X90, controls framebuffer width."]
    pub framebuf_widthbytesize: u32_,
    #[doc = "< Framebuffer format, this u16 is written to the low u16 for LCD register 0x1EF00X70."]
    pub format: u32_,
    #[doc = "< Value for 0x1EF00X78, controls which framebuffer is displayed."]
    pub framebuf_dispselect: u32_,
    #[doc = "< Unknown."]
    pub unk: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSPGPU_FramebufferInfo"][::core::mem::size_of::<GSPGPU_FramebufferInfo>() - 28usize];
    ["Alignment of GSPGPU_FramebufferInfo"]
        [::core::mem::align_of::<GSPGPU_FramebufferInfo>() - 4usize];
    ["Offset of field: GSPGPU_FramebufferInfo::active_framebuf"]
        [::core::mem::offset_of!(GSPGPU_FramebufferInfo, active_framebuf) - 0usize];
    ["Offset of field: GSPGPU_FramebufferInfo::framebuf0_vaddr"]
        [::core::mem::offset_of!(GSPGPU_FramebufferInfo, framebuf0_vaddr) - 4usize];
    ["Offset of field: GSPGPU_FramebufferInfo::framebuf1_vaddr"]
        [::core::mem::offset_of!(GSPGPU_FramebufferInfo, framebuf1_vaddr) - 8usize];
    ["Offset of field: GSPGPU_FramebufferInfo::framebuf_widthbytesize"]
        [::core::mem::offset_of!(GSPGPU_FramebufferInfo, framebuf_widthbytesize) - 12usize];
    ["Offset of field: GSPGPU_FramebufferInfo::format"]
        [::core::mem::offset_of!(GSPGPU_FramebufferInfo, format) - 16usize];
    ["Offset of field: GSPGPU_FramebufferInfo::framebuf_dispselect"]
        [::core::mem::offset_of!(GSPGPU_FramebufferInfo, framebuf_dispselect) - 20usize];
    ["Offset of field: GSPGPU_FramebufferInfo::unk"]
        [::core::mem::offset_of!(GSPGPU_FramebufferInfo, unk) - 24usize];
};
impl Default for GSPGPU_FramebufferInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "< RGBA8. (4 bytes)"]
pub const GSP_RGBA8_OES: GSPGPU_FramebufferFormat = 0;
#[doc = "< BGR8. (3 bytes)"]
pub const GSP_BGR8_OES: GSPGPU_FramebufferFormat = 1;
#[doc = "< RGB565. (2 bytes)"]
pub const GSP_RGB565_OES: GSPGPU_FramebufferFormat = 2;
#[doc = "< RGB5A1. (2 bytes)"]
pub const GSP_RGB5_A1_OES: GSPGPU_FramebufferFormat = 3;
#[doc = "< RGBA4. (2 bytes)"]
pub const GSP_RGBA4_OES: GSPGPU_FramebufferFormat = 4;
#[doc = "Framebuffer format."]
pub type GSPGPU_FramebufferFormat = ::libc::c_uchar;
#[doc = "Capture info entry."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GSPGPU_CaptureInfoEntry {
    #[doc = "< Left framebuffer."]
    pub framebuf0_vaddr: *mut u32_,
    #[doc = "< Right framebuffer."]
    pub framebuf1_vaddr: *mut u32_,
    #[doc = "< Framebuffer format."]
    pub format: u32_,
    #[doc = "< Framebuffer pitch."]
    pub framebuf_widthbytesize: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSPGPU_CaptureInfoEntry"]
        [::core::mem::size_of::<GSPGPU_CaptureInfoEntry>() - 16usize];
    ["Alignment of GSPGPU_CaptureInfoEntry"]
        [::core::mem::align_of::<GSPGPU_CaptureInfoEntry>() - 4usize];
    ["Offset of field: GSPGPU_CaptureInfoEntry::framebuf0_vaddr"]
        [::core::mem::offset_of!(GSPGPU_CaptureInfoEntry, framebuf0_vaddr) - 0usize];
    ["Offset of field: GSPGPU_CaptureInfoEntry::framebuf1_vaddr"]
        [::core::mem::offset_of!(GSPGPU_CaptureInfoEntry, framebuf1_vaddr) - 4usize];
    ["Offset of field: GSPGPU_CaptureInfoEntry::format"]
        [::core::mem::offset_of!(GSPGPU_CaptureInfoEntry, format) - 8usize];
    ["Offset of field: GSPGPU_CaptureInfoEntry::framebuf_widthbytesize"]
        [::core::mem::offset_of!(GSPGPU_CaptureInfoEntry, framebuf_widthbytesize) - 12usize];
};
impl Default for GSPGPU_CaptureInfoEntry {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "Capture info."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GSPGPU_CaptureInfo {
    #[doc = "< Capture info entries, one for each screen."]
    pub screencapture: [GSPGPU_CaptureInfoEntry; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSPGPU_CaptureInfo"][::core::mem::size_of::<GSPGPU_CaptureInfo>() - 32usize];
    ["Alignment of GSPGPU_CaptureInfo"][::core::mem::align_of::<GSPGPU_CaptureInfo>() - 4usize];
    ["Offset of field: GSPGPU_CaptureInfo::screencapture"]
        [::core::mem::offset_of!(GSPGPU_CaptureInfo, screencapture) - 0usize];
};
impl Default for GSPGPU_CaptureInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "< Memory fill completed."]
pub const GSPGPU_EVENT_PSC0: GSPGPU_Event = 0;
#[doc = "< TODO"]
pub const GSPGPU_EVENT_PSC1: GSPGPU_Event = 1;
#[doc = "< TODO"]
pub const GSPGPU_EVENT_VBlank0: GSPGPU_Event = 2;
#[doc = "< TODO"]
pub const GSPGPU_EVENT_VBlank1: GSPGPU_Event = 3;
#[doc = "< Display transfer finished."]
pub const GSPGPU_EVENT_PPF: GSPGPU_Event = 4;
#[doc = "< Command list processing finished."]
pub const GSPGPU_EVENT_P3D: GSPGPU_Event = 5;
#[doc = "< TODO"]
pub const GSPGPU_EVENT_DMA: GSPGPU_Event = 6;
#[doc = "< Used to know how many events there are."]
pub const GSPGPU_EVENT_MAX: GSPGPU_Event = 7;
#[doc = "GSPGPU events."]
pub type GSPGPU_Event = ::libc::c_uchar;
#[doc = "GSPGPU performance log entry.\n\n Use the lastDurationUs field when benchmarking single GPU operations, this is usally meant\n for 3D library writers.\n\n Use the difference between two totalDurationUs when using a GPU library (e.g. citro3d), as\n there can be multiple GPU operations (e.g. P3D, PPF) per render pass, or per frame, and so on.\n Don't use totalDurationUs as-is (rather, take the difference as just described), because it\n can overflow."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct GSPGPU_PerfLogEntry {
    #[doc = "< Duration of the last corresponding PICA200 operation (time between op is started and IRQ is received)."]
    pub lastDurationUs: u32_,
    #[doc = "< Sum of lastDurationUs for the corresponding PICA200 operation. Can overflow."]
    pub totalDurationUs: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSPGPU_PerfLogEntry"][::core::mem::size_of::<GSPGPU_PerfLogEntry>() - 8usize];
    ["Alignment of GSPGPU_PerfLogEntry"][::core::mem::align_of::<GSPGPU_PerfLogEntry>() - 4usize];
    ["Offset of field: GSPGPU_PerfLogEntry::lastDurationUs"]
        [::core::mem::offset_of!(GSPGPU_PerfLogEntry, lastDurationUs) - 0usize];
    ["Offset of field: GSPGPU_PerfLogEntry::totalDurationUs"]
        [::core::mem::offset_of!(GSPGPU_PerfLogEntry, totalDurationUs) - 4usize];
};
#[doc = "GSPGPU performance log"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct GSPGPU_PerfLog {
    #[doc = "< Performance log entries (one per operation/\"event\")."]
    pub entries: [GSPGPU_PerfLogEntry; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GSPGPU_PerfLog"][::core::mem::size_of::<GSPGPU_PerfLog>() - 56usize];
    ["Alignment of GSPGPU_PerfLog"][::core::mem::align_of::<GSPGPU_PerfLog>() - 4usize];
    ["Offset of field: GSPGPU_PerfLog::entries"]
        [::core::mem::offset_of!(GSPGPU_PerfLog, entries) - 0usize];
};
unsafe extern "C" {
    #[doc = "Gets the number of bytes per pixel for the specified format.\n # Arguments\n\n* `format` - See GSPGPU_FramebufferFormat.\n # Returns\n\nBytes per pixel."]
    #[link_name = "gspGetBytesPerPixel__extern"]
    pub fn gspGetBytesPerPixel(format: GSPGPU_FramebufferFormat) -> ::libc::c_uint;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Initializes GSPGPU."]
    pub fn gspInit() -> Result;
}
unsafe extern "C" {
    #[doc = "Exits GSPGPU."]
    pub fn gspExit();
}
unsafe extern "C" {
    #[doc = "Gets a pointer to the current gsp::Gpu session handle.\n # Returns\n\nA pointer to the current gsp::Gpu session handle."]
    pub fn gspGetSessionHandle() -> *mut Handle;
}
unsafe extern "C" {
    #[doc = "Returns true if the application currently has GPU rights."]
    pub fn gspHasGpuRight() -> bool;
}
unsafe extern "C" {
    #[doc = "Presents a buffer to the specified screen.\n # Arguments\n\n* `screen` - Screen ID (see GSP_SCREEN_TOP and GSP_SCREEN_BOTTOM)\n * `swap` - Specifies which set of framebuffer registers to configure and activate (0 or 1)\n * `fb_a` - Pointer to the framebuffer (in stereo mode: left eye)\n * `fb_b` - Pointer to the secondary framebuffer (only used in stereo mode for the right eye, otherwise pass the same as fb_a)\n * `stride` - Stride in bytes between scanlines\n * `mode` - Mode configuration to be written to LCD register\n # Returns\n\ntrue if a buffer had already been presented to the screen but not processed yet by GSP, false otherwise.\n > **Note:** The most recently presented buffer is processed and configured during the specified screen's next VBlank event."]
    pub fn gspPresentBuffer(
        screen: ::libc::c_uint,
        swap: ::libc::c_uint,
        fb_a: *const ::libc::c_void,
        fb_b: *const ::libc::c_void,
        stride: u32_,
        mode: u32_,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Returns true if a prior gspPresentBuffer command is still pending to be processed by GSP.\n # Arguments\n\n* `screen` - Screen ID (see GSP_SCREEN_TOP and GSP_SCREEN_BOTTOM)"]
    pub fn gspIsPresentPending(screen: ::libc::c_uint) -> bool;
}
unsafe extern "C" {
    #[doc = "Configures a callback to run when a GSPGPU event occurs.\n # Arguments\n\n* `id` - ID of the event.\n * `cb` - Callback to run.\n * `data` - Data to be passed to the callback.\n * `oneShot` - When true, the callback is only executed once. When false, the callback is executed every time the event occurs."]
    pub fn gspSetEventCallback(
        id: GSPGPU_Event,
        cb: ThreadFunc,
        data: *mut ::libc::c_void,
        oneShot: bool,
    );
}
unsafe extern "C" {
    #[doc = "Waits for a GSPGPU event to occur.\n # Arguments\n\n* `id` - ID of the event.\n * `nextEvent` - Whether to discard the current event and wait for the next event."]
    pub fn gspWaitForEvent(id: GSPGPU_Event, nextEvent: bool);
}
unsafe extern "C" {
    #[doc = "Waits for any GSPGPU event to occur.\n # Returns\n\nThe ID of the event that occurred.\n\n The function returns immediately if there are unprocessed events at the time of call."]
    pub fn gspWaitForAnyEvent() -> GSPGPU_Event;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Submits a GX command.\n # Arguments\n\n* `gxCommand` - GX command to execute."]
    pub fn gspSubmitGxCommand(gxCommand: *const u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Acquires GPU rights.\n # Arguments\n\n* `flags` - Flags to acquire with."]
    pub fn GSPGPU_AcquireRight(flags: u8_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Releases GPU rights."]
    pub fn GSPGPU_ReleaseRight() -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Retrieves display capture info.\n # Arguments\n\n* `captureinfo` - Pointer to output capture info to."]
    pub fn GSPGPU_ImportDisplayCaptureInfo(captureinfo: *mut GSPGPU_CaptureInfo) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Saves the VRAM sys area."]
    pub fn GSPGPU_SaveVramSysArea() -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Resets the GPU"]
    pub fn GSPGPU_ResetGpuCore() -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Restores the VRAM sys area."]
    pub fn GSPGPU_RestoreVramSysArea() -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets whether to force the LCD to black.\n # Arguments\n\n* `flags` - Whether to force the LCD to black. (0 = no, non-zero = yes)"]
    pub fn GSPGPU_SetLcdForceBlack(flags: u8_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Updates a screen's framebuffer state.\n # Arguments\n\n* `screenid` - ID of the screen to update.\n * `framebufinfo` - Framebuffer information to update with."]
    pub fn GSPGPU_SetBufferSwap(
        screenid: u32_,
        framebufinfo: *const GSPGPU_FramebufferInfo,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Flushes memory from the data cache.\n # Arguments\n\n* `adr` - Address to flush.\n * `size` - Size of the memory to flush."]
    pub fn GSPGPU_FlushDataCache(adr: *const ::libc::c_void, size: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Invalidates memory in the data cache.\n # Arguments\n\n* `adr` - Address to invalidate.\n * `size` - Size of the memory to invalidate."]
    pub fn GSPGPU_InvalidateDataCache(adr: *const ::libc::c_void, size: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Writes to GPU hardware registers.\n # Arguments\n\n* `regAddr` - Register address to write to.\n * `data` - Data to write.\n * `size` - Size of the data to write."]
    pub fn GSPGPU_WriteHWRegs(regAddr: u32_, data: *const u32_, size: u8_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Writes to GPU hardware registers with a mask.\n # Arguments\n\n* `regAddr` - Register address to write to.\n * `data` - Data to write.\n * `datasize` - Size of the data to write.\n * `maskdata` - Data of the mask.\n * `masksize` - Size of the mask."]
    pub fn GSPGPU_WriteHWRegsWithMask(
        regAddr: u32_,
        data: *const u32_,
        datasize: u8_,
        maskdata: *const u32_,
        masksize: u8_,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Reads from GPU hardware registers.\n # Arguments\n\n* `regAddr` - Register address to read from.\n * `data` - Buffer to read data to.\n * `size` - Size of the buffer."]
    pub fn GSPGPU_ReadHWRegs(regAddr: u32_, data: *mut u32_, size: u8_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Registers the interrupt relay queue.\n # Arguments\n\n* `eventHandle` - Handle of the GX command event.\n * `flags` - Flags to register with.\n * `outMemHandle` - Pointer to output the shared memory handle to.\n * `threadID` - Pointer to output the GSP thread ID to."]
    pub fn GSPGPU_RegisterInterruptRelayQueue(
        eventHandle: Handle,
        flags: u32_,
        outMemHandle: *mut Handle,
        threadID: *mut u8_,
    ) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Unregisters the interrupt relay queue."]
    pub fn GSPGPU_UnregisterInterruptRelayQueue() -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Triggers a handling of commands written to shared memory."]
    pub fn GSPGPU_TriggerCmdReqQueue() -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets 3D_LEDSTATE to the input state value.\n # Arguments\n\n* `disable` - False = 3D LED enable, true = 3D LED disable."]
    pub fn GSPGPU_SetLedForceOff(disable: bool) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Enables or disables the performance log and clear\n its state to zero.\n # Arguments\n\n* `enabled` - Whether to enable the performance log.\n > **Note:** It is assumed that no GPU operation is in progress when calling this function.\n The official sysmodule forgets to clear the \"start tick\" states to 0, though\n this should not be much of an issue (as per the note above)."]
    pub fn GSPGPU_SetPerfLogMode(enabled: bool) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Retrieves the performance log.\n # Arguments\n\n* `outPerfLog` (direction out) - Pointer to output the performance log to.\n > **Note:** Use the difference between two totalDurationUs when using a GPU library (e.g. citro3d), as\n there can be multiple GPU operations (e.g. P3D, PPF) per render pass, or per frame, and so on.\n Don't use totalDurationUs as-is (rather, take the difference as just described), because it\n can overflow.\n > **Note:** For a MemoryFill operation that uses both PSC0 and PSC1, take the maximum\n of the two \"last duration\" entries.\n > **Note:** For PDC0/PDC1 (VBlank0/1), the \"last duration\" entry corresponds to the time between\n the current PDC (VBlank) IRQ and the previous one. The official GSP sysmodule\n assumes both PDC0 and PDC1 IRQ happens at the same rate (this is almost always\n the case, but not always if user changes PDC timings), and sets both entries\n in the PDC0 handler.\n The official sysmodule doesn't handle the PDC0/1 entries correctly after init. On the first\n frame GSPGPU_SetPerfLogMode is enabled, \"last duration\" will have a nonsensical\n value; and \"total duration\" stays nonsensical. This isn't much of a problem, except for the\n first frame, because \"total duration\" is not supposed to be used as-is (you are supposed\n to take the difference of this field between two time points of your choosing, instead).\n Since it is running at approx. 3.25 GiB/s per bank, some small PSC operations might\n complete before the official GSP has time to record the start time.\n The official sysmodule doesn't properly handle data synchronization for the perflog,\n in practice this should be fine, however."]
    pub fn GSPGPU_GetPerfLog(outPerfLog: *mut GSPGPU_PerfLog) -> Result;
}
#[doc = "< Top screen"]
pub const GFX_TOP: gfxScreen_t = 0;
#[doc = "< Bottom screen"]
pub const GFX_BOTTOM: gfxScreen_t = 1;
#[doc = "Screen IDs."]
pub type gfxScreen_t = ::libc::c_uchar;
#[doc = "< Left eye framebuffer"]
pub const GFX_LEFT: gfx3dSide_t = 0;
#[doc = "< Right eye framebuffer"]
pub const GFX_RIGHT: gfx3dSide_t = 1;
#[doc = "Top screen framebuffer side.\n\n This is only meaningful when stereoscopic 3D is enabled on the top screen.\n In any other case, use GFX_LEFT."]
pub type gfx3dSide_t = ::libc::c_uchar;
unsafe extern "C" {
    #[doc = "Initializes the LCD framebuffers with default parameters\n This is equivalent to calling: gfxInit(GSP_BGR8_OES,GSP_BGR8_OES,false); "]
    pub fn gfxInitDefault();
}
unsafe extern "C" {
    #[doc = "Initializes the LCD framebuffers.\n # Arguments\n\n* `topFormat` - The format of the top screen framebuffers.\n * `bottomFormat` - The format of the bottom screen framebuffers.\n * `vramBuffers` - Whether to allocate the framebuffers in VRAM.\n\n This function allocates memory for the framebuffers in the specified memory region.\n Initially, stereoscopic 3D is disabled and double buffering is enabled.\n\n > **Note:** This function internally calls gspInit."]
    pub fn gfxInit(
        topFormat: GSPGPU_FramebufferFormat,
        bottomFormat: GSPGPU_FramebufferFormat,
        vrambuffers: bool,
    );
}
unsafe extern "C" {
    #[doc = "Deinitializes and frees the LCD framebuffers.\n > **Note:** This function internally calls gspExit."]
    pub fn gfxExit();
}
unsafe extern "C" {
    #[doc = "Enables or disables the 3D stereoscopic effect on the top screen.\n # Arguments\n\n* `enable` - Pass true to enable, false to disable.\n > **Note:** Stereoscopic 3D is disabled by default."]
    pub fn gfxSet3D(enable: bool);
}
unsafe extern "C" {
    #[doc = "Retrieves the status of the 3D stereoscopic effect on the top screen.\n # Returns\n\ntrue if 3D enabled, false otherwise."]
    pub fn gfxIs3D() -> bool;
}
unsafe extern "C" {
    #[doc = "Retrieves the status of the 800px (double-height) high resolution display mode of the top screen.\n # Returns\n\ntrue if wide mode enabled, false otherwise."]
    pub fn gfxIsWide() -> bool;
}
unsafe extern "C" {
    #[doc = "Enables or disables the 800px (double-height) high resolution display mode of the top screen.\n # Arguments\n\n* `enable` - Pass true to enable, false to disable.\n > **Note:** Wide mode is disabled by default.\n > **Note:** Wide and stereoscopic 3D modes are mutually exclusive.\n > **Note:** In wide mode pixels are not square, since scanlines are half as tall as they normally are.\n Wide mode does not work on Old 2DS consoles (however it does work on New 2DS XL consoles)."]
    pub fn gfxSetWide(enable: bool);
}
unsafe extern "C" {
    #[doc = "Changes the pixel format of a screen.\n # Arguments\n\n* `screen` - Screen ID (see gfxScreen_t)\n * `format` - Pixel format (see GSPGPU_FramebufferFormat)\n > **Note:** If the currently allocated framebuffers are too small for the specified format,\n they are freed and new ones are reallocated."]
    pub fn gfxSetScreenFormat(screen: gfxScreen_t, format: GSPGPU_FramebufferFormat);
}
unsafe extern "C" {
    #[doc = "Retrieves the current pixel format of a screen.\n # Arguments\n\n* `screen` - Screen ID (see gfxScreen_t)\n # Returns\n\nPixel format (see GSPGPU_FramebufferFormat)"]
    pub fn gfxGetScreenFormat(screen: gfxScreen_t) -> GSPGPU_FramebufferFormat;
}
unsafe extern "C" {
    #[doc = "Enables or disables double buffering on a screen.\n # Arguments\n\n* `screen` - Screen ID (see gfxScreen_t)\n * `enable` - Pass true to enable, false to disable.\n > **Note:** Double buffering is enabled by default."]
    pub fn gfxSetDoubleBuffering(screen: gfxScreen_t, enable: bool);
}
unsafe extern "C" {
    #[doc = "Retrieves the framebuffer of the specified screen to which graphics should be rendered.\n # Arguments\n\n* `screen` - Screen ID (see gfxScreen_t)\n * `side` - Framebuffer side (see gfx3dSide_t) (pass GFX_LEFT if not using stereoscopic 3D)\n * `width` - Pointer that will hold the width of the framebuffer in pixels.\n * `height` - Pointer that will hold the height of the framebuffer in pixels.\n # Returns\n\nA pointer to the current framebuffer of the chosen screen.\n\n Please remember that the returned pointer will change every frame if double buffering is enabled."]
    pub fn gfxGetFramebuffer(
        screen: gfxScreen_t,
        side: gfx3dSide_t,
        width: *mut u16_,
        height: *mut u16_,
    ) -> *mut u8_;
}
unsafe extern "C" {
    #[doc = "Flushes the data cache for the current framebuffers.\n This is **only used during software rendering**. Since this function has significant overhead,\n it is preferred to call this only once per frame, after all software rendering is completed."]
    pub fn gfxFlushBuffers();
}
unsafe extern "C" {
    #[doc = "Updates the configuration of the specified screen, swapping the buffers if double buffering is enabled.\n # Arguments\n\n* `scr` - Screen ID (see gfxScreen_t)\n * `hasStereo` - For the top screen in 3D mode: true if the framebuffer contains individual images\n for both eyes, or false if the left image should be duplicated to the right eye.\n > **Note:** Previously rendered content will be displayed on the screen after the next VBlank.\n > **Note:** This function is still useful even if double buffering is disabled, as it must be used to commit configuration changes.\n Only call this once per screen per frame, otherwise graphical glitches will occur\n since this API does not implement triple buffering."]
    pub fn gfxScreenSwapBuffers(scr: gfxScreen_t, hasStereo: bool);
}
unsafe extern "C" {
    #[doc = "Same as gfxScreenSwapBuffers, but with hasStereo set to true.\n # Arguments\n\n* `scr` - Screen ID (see gfxScreen_t)\n * `immediate` - This parameter no longer has any effect and is thus ignored.\n > **Deprecated** This function has been superseded by gfxScreenSwapBuffers, please use that instead."]
    pub fn gfxConfigScreen(scr: gfxScreen_t, immediate: bool);
}
unsafe extern "C" {
    #[doc = "Updates the configuration of both screens.\n > **Note:** This function is equivalent to: gfxScreenSwapBuffers(GFX_TOP,true); gfxScreenSwapBuffers(GFX_BOTTOM,true); "]
    pub fn gfxSwapBuffers();
}
unsafe extern "C" {
    #[doc = "Same as gfxSwapBuffers (formerly different)."]
    pub fn gfxSwapBuffersGpu();
}
#[doc = "A callback for printing a character."]
pub type ConsolePrint = ::core::option::Option<
    unsafe extern "C" fn(con: *mut ::libc::c_void, c: ::libc::c_int) -> bool,
>;
#[doc = "A font struct for the console."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConsoleFont {
    #[doc = "< A pointer to the font graphics"]
    pub gfx: *mut u8_,
    #[doc = "< Offset to the first valid character in the font table"]
    pub asciiOffset: u16_,
    #[doc = "< Number of characters in the font graphics"]
    pub numChars: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ConsoleFont"][::core::mem::size_of::<ConsoleFont>() - 8usize];
    ["Alignment of ConsoleFont"][::core::mem::align_of::<ConsoleFont>() - 4usize];
    ["Offset of field: ConsoleFont::gfx"][::core::mem::offset_of!(ConsoleFont, gfx) - 0usize];
    ["Offset of field: ConsoleFont::asciiOffset"]
        [::core::mem::offset_of!(ConsoleFont, asciiOffset) - 4usize];
    ["Offset of field: ConsoleFont::numChars"]
        [::core::mem::offset_of!(ConsoleFont, numChars) - 6usize];
};
impl Default for ConsoleFont {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "Console structure used to store the state of a console render context.\n\n Default values from consoleGetDefault();\n PrintConsole defaultConsole =\n {\n \t//Font:\n \t{\n \t\t(u8*)default_font_bin, //font gfx\n \t\t0, //first ascii character in the set\n \t\t128, //number of characters in the font set\n\t},\n\t0,0, //cursorX cursorY\n\t0,0, //prevcursorX prevcursorY\n\t40, //console width\n\t30, //console height\n\t0, //window x\n\t0, //window y\n\t32, //window width\n\t24, //window height\n\t3, //tab size\n\t0, //font character offset\n\t0, //print callback\n\tfalse //console initialized\n };\n "]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PrintConsole {
    #[doc = "< Font of the console"]
    pub font: ConsoleFont,
    #[doc = "< Framebuffer address"]
    pub frameBuffer: *mut u16_,
    #[doc = "< Current X location of the cursor (as a tile offset by default)"]
    pub cursorX: ::libc::c_int,
    #[doc = "< Current Y location of the cursor (as a tile offset by default)"]
    pub cursorY: ::libc::c_int,
    #[doc = "< Internal state"]
    pub prevCursorX: ::libc::c_int,
    #[doc = "< Internal state"]
    pub prevCursorY: ::libc::c_int,
    #[doc = "< Width of the console hardware layer in characters"]
    pub consoleWidth: ::libc::c_int,
    #[doc = "< Height of the console hardware layer in characters"]
    pub consoleHeight: ::libc::c_int,
    #[doc = "< Window X location in characters (not implemented)"]
    pub windowX: ::libc::c_int,
    #[doc = "< Window Y location in characters (not implemented)"]
    pub windowY: ::libc::c_int,
    #[doc = "< Window width in characters (not implemented)"]
    pub windowWidth: ::libc::c_int,
    #[doc = "< Window height in characters (not implemented)"]
    pub windowHeight: ::libc::c_int,
    #[doc = "< Size of a tab"]
    pub tabSize: ::libc::c_int,
    #[doc = "< Foreground color"]
    pub fg: u16_,
    #[doc = "< Background color"]
    pub bg: u16_,
    #[doc = "< Reverse/bright flags"]
    pub flags: ::libc::c_int,
    #[doc = "< Callback for printing a character. Should return true if it has handled rendering the graphics (else the print engine will attempt to render via tiles)."]
    pub PrintChar: ConsolePrint,
    #[doc = "< True if the console is initialized"]
    pub consoleInitialised: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PrintConsole"][::core::mem::size_of::<PrintConsole>() - 72usize];
    ["Alignment of PrintConsole"][::core::mem::align_of::<PrintConsole>() - 4usize];
    ["Offset of field: PrintConsole::font"][::core::mem::offset_of!(PrintConsole, font) - 0usize];
    ["Offset of field: PrintConsole::frameBuffer"]
        [::core::mem::offset_of!(PrintConsole, frameBuffer) - 8usize];
    ["Offset of field: PrintConsole::cursorX"]
        [::core::mem::offset_of!(PrintConsole, cursorX) - 12usize];
    ["Offset of field: PrintConsole::cursorY"]
        [::core::mem::offset_of!(PrintConsole, cursorY) - 16usize];
    ["Offset of field: PrintConsole::prevCursorX"]
        [::core::mem::offset_of!(PrintConsole, prevCursorX) - 20usize];
    ["Offset of field: PrintConsole::prevCursorY"]
        [::core::mem::offset_of!(PrintConsole, prevCursorY) - 24usize];
    ["Offset of field: PrintConsole::consoleWidth"]
        [::core::mem::offset_of!(PrintConsole, consoleWidth) - 28usize];
    ["Offset of field: PrintConsole::consoleHeight"]
        [::core::mem::offset_of!(PrintConsole, consoleHeight) - 32usize];
    ["Offset of field: PrintConsole::windowX"]
        [::core::mem::offset_of!(PrintConsole, windowX) - 36usize];
    ["Offset of field: PrintConsole::windowY"]
        [::core::mem::offset_of!(PrintConsole, windowY) - 40usize];
    ["Offset of field: PrintConsole::windowWidth"]
        [::core::mem::offset_of!(PrintConsole, windowWidth) - 44usize];
    ["Offset of field: PrintConsole::windowHeight"]
        [::core::mem::offset_of!(PrintConsole, windowHeight) - 48usize];
    ["Offset of field: PrintConsole::tabSize"]
        [::core::mem::offset_of!(PrintConsole, tabSize) - 52usize];
    ["Offset of field: PrintConsole::fg"][::core::mem::offset_of!(PrintConsole, fg) - 56usize];
    ["Offset of field: PrintConsole::bg"][::core::mem::offset_of!(PrintConsole, bg) - 58usize];
    ["Offset of field: PrintConsole::flags"]
        [::core::mem::offset_of!(PrintConsole, flags) - 60usize];
    ["Offset of field: PrintConsole::PrintChar"]
        [::core::mem::offset_of!(PrintConsole, PrintChar) - 64usize];
    ["Offset of field: PrintConsole::consoleInitialised"]
        [::core::mem::offset_of!(PrintConsole, consoleInitialised) - 68usize];
};
impl Default for PrintConsole {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "< Swallows prints to stderr"]
pub const debugDevice_NULL: debugDevice = 0;
#[doc = "< Outputs stderr debug statements using svcOutputDebugString, which can then be captured by interactive debuggers"]
pub const debugDevice_SVC: debugDevice = 1;
#[doc = "< Directs stderr debug statements to 3DS console window"]
pub const debugDevice_CONSOLE: debugDevice = 2;
pub const debugDevice_3DMOO: debugDevice = 1;
#[doc = "Console debug devices supported by libctru."]
pub type debugDevice = ::libc::c_uchar;
unsafe extern "C" {
    #[doc = "Loads the font into the console.\n # Arguments\n\n* `console` - Pointer to the console to update, if NULL it will update the current console.\n * `font` - The font to load."]
    pub fn consoleSetFont(console: *mut PrintConsole, font: *mut ConsoleFont);
}
unsafe extern "C" {
    #[doc = "Sets the print window.\n # Arguments\n\n* `console` - Console to set, if NULL it will set the current console window.\n * `x` - X location of the window.\n * `y` - Y location of the window.\n * `width` - Width of the window.\n * `height` - Height of the window."]
    pub fn consoleSetWindow(
        console: *mut PrintConsole,
        x: ::libc::c_int,
        y: ::libc::c_int,
        width: ::libc::c_int,
        height: ::libc::c_int,
    );
}
unsafe extern "C" {
    #[doc = "Gets a pointer to the console with the default values.\n This should only be used when using a single console or without changing the console that is returned, otherwise use consoleInit().\n # Returns\n\nA pointer to the console with the default values."]
    pub fn consoleGetDefault() -> *mut PrintConsole;
}
unsafe extern "C" {
    #[doc = "Make the specified console the render target.\n # Arguments\n\n* `console` - A pointer to the console struct (must have been initialized with consoleInit(PrintConsole* console)).\n # Returns\n\nA pointer to the previous console."]
    pub fn consoleSelect(console: *mut PrintConsole) -> *mut PrintConsole;
}
unsafe extern "C" {
    #[doc = "Initialise the console.\n # Arguments\n\n* `screen` - The screen to use for the console.\n * `console` - A pointer to the console data to initialize (if it's NULL, the default console will be used).\n # Returns\n\nA pointer to the current console."]
    pub fn consoleInit(screen: gfxScreen_t, console: *mut PrintConsole) -> *mut PrintConsole;
}
unsafe extern "C" {
    #[doc = "Initializes debug console output on stderr to the specified device.\n # Arguments\n\n* `device` - The debug device (or devices) to output debug print statements to."]
    pub fn consoleDebugInit(device: debugDevice);
}
unsafe extern "C" {
    #[doc = "Clears the screen by using iprintf(\""]
    pub fn consoleClear();
}
#[doc = "< Use APT workaround."]
pub const RUNFLAG_APTWORKAROUND: _bindgen_ty_9 = 1;
#[doc = "< Reinitialize APT."]
pub const RUNFLAG_APTREINIT: _bindgen_ty_9 = 2;
#[doc = "< Chainload APT on return."]
pub const RUNFLAG_APTCHAINLOAD: _bindgen_ty_9 = 4;
#[doc = "System run-flags."]
pub type _bindgen_ty_9 = ::libc::c_uchar;
unsafe extern "C" {
    #[doc = "Gets whether the application was launched from a homebrew environment.\n # Returns\n\nWhether the application was launched from a homebrew environment."]
    #[link_name = "envIsHomebrew__extern"]
    pub fn envIsHomebrew() -> bool;
}
unsafe extern "C" {
    #[doc = "Retrieves a handle from the environment handle list.\n # Arguments\n\n* `name` - Name of the handle.\n # Returns\n\nThe retrieved handle."]
    pub fn envGetHandle(name: *const ::libc::c_char) -> Handle;
}
unsafe extern "C" {
    #[doc = "Gets the environment-recommended app ID to use with APT.\n # Returns\n\nThe APT app ID."]
    #[link_name = "envGetAptAppId__extern"]
    pub fn envGetAptAppId() -> u32_;
}
unsafe extern "C" {
    #[doc = "Gets the size of the application heap.\n # Returns\n\nThe application heap size."]
    #[link_name = "envGetHeapSize__extern"]
    pub fn envGetHeapSize() -> u32_;
}
unsafe extern "C" {
    #[doc = "Gets the size of the linear heap.\n # Returns\n\nThe linear heap size."]
    #[link_name = "envGetLinearHeapSize__extern"]
    pub fn envGetLinearHeapSize() -> u32_;
}
unsafe extern "C" {
    #[doc = "Gets the environment argument list.\n # Returns\n\nThe argument list."]
    #[link_name = "envGetSystemArgList__extern"]
    pub fn envGetSystemArgList() -> *const ::libc::c_char;
}
unsafe extern "C" {
    #[doc = "Gets the environment run flags.\n # Returns\n\nThe run flags."]
    #[link_name = "envGetSystemRunFlags__extern"]
    pub fn envGetSystemRunFlags() -> u32_;
}
pub type __suseconds_t = ::libc::c_long;
#[doc = "< Dummy compression"]
pub const DECOMPRESS_DUMMY: decompressType = 0;
#[doc = "< LZSS/LZ10 compression"]
pub const DECOMPRESS_LZSS: decompressType = 16;
#[doc = "< LZSS/LZ10 compression"]
pub const DECOMPRESS_LZ10: decompressType = 16;
#[doc = "< LZ11 compression"]
pub const DECOMPRESS_LZ11: decompressType = 17;
#[doc = "< Huffman compression with 1-bit data"]
pub const DECOMPRESS_HUFF1: decompressType = 33;
#[doc = "< Huffman compression with 2-bit data"]
pub const DECOMPRESS_HUFF2: decompressType = 34;
#[doc = "< Huffman compression with 3-bit data"]
pub const DECOMPRESS_HUFF3: decompressType = 35;
#[doc = "< Huffman compression with 4-bit data"]
pub const DECOMPRESS_HUFF4: decompressType = 36;
#[doc = "< Huffman compression with 5-bit data"]
pub const DECOMPRESS_HUFF5: decompressType = 37;
#[doc = "< Huffman compression with 6-bit data"]
pub const DECOMPRESS_HUFF6: decompressType = 38;
#[doc = "< Huffman compression with 7-bit data"]
pub const DECOMPRESS_HUFF7: decompressType = 39;
#[doc = "< Huffman compression with 8-bit data"]
pub const DECOMPRESS_HUFF8: decompressType = 40;
#[doc = "< Huffman compression with 8-bit data"]
pub const DECOMPRESS_HUFF: decompressType = 40;
#[doc = "< Run-length encoding compression"]
pub const DECOMPRESS_RLE: decompressType = 48;
#[doc = "Compression types"]
pub type decompressType = ::libc::c_uchar;
#[doc = "I/O vector"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct decompressIOVec {
    #[doc = "< I/O buffer"]
    pub data: *mut ::libc::c_void,
    #[doc = "< Buffer size"]
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of decompressIOVec"][::core::mem::size_of::<decompressIOVec>() - 8usize];
    ["Alignment of decompressIOVec"][::core::mem::align_of::<decompressIOVec>() - 4usize];
    ["Offset of field: decompressIOVec::data"]
        [::core::mem::offset_of!(decompressIOVec, data) - 0usize];
    ["Offset of field: decompressIOVec::size"]
        [::core::mem::offset_of!(decompressIOVec, size) - 4usize];
};
impl Default for decompressIOVec {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "Data callback"]
pub type decompressCallback = ::core::option::Option<
    unsafe extern "C" fn(
        userdata: *mut ::libc::c_void,
        buffer: *mut ::libc::c_void,
        size: usize,
    ) -> isize,
>;
unsafe extern "C" {
    #[doc = "Decompression callback for file descriptors\n # Arguments\n\n* `userdata` (direction in) - Address of file descriptor\n * `buffer` (direction in) - Buffer to write into\n * `size` (direction in) - Size to read from file descriptor\n # Returns\n\nNumber of bytes read"]
    pub fn decompressCallback_FD(
        userdata: *mut ::libc::c_void,
        buffer: *mut ::libc::c_void,
        size: usize,
    ) -> isize;
}
unsafe extern "C" {
    #[doc = "Decompression callback for stdio FILE*\n # Arguments\n\n* `userdata` (direction in) - FILE*\n * `buffer` (direction in) - Buffer to write into\n * `size` (direction in) - Size to read from file descriptor\n # Returns\n\nNumber of bytes read"]
    pub fn decompressCallback_Stdio(
        userdata: *mut ::libc::c_void,
        buffer: *mut ::libc::c_void,
        size: usize,
    ) -> isize;
}
unsafe extern "C" {
    #[doc = "Decode decompression header\n # Arguments\n\n* `type` (direction out) - Decompression type\n * `size` (direction out) - Decompressed size\n * `callback` (direction in) - Data callback (see decompressV())\n * `userdata` (direction in) - User data passed to callback (see decompressV())\n * `insize` (direction in) - Size of userdata (see decompressV())\n # Returns\n\nBytes consumed\n * `-1` - error"]
    pub fn decompressHeader(
        type_: *mut decompressType,
        size: *mut usize,
        callback: decompressCallback,
        userdata: *mut ::libc::c_void,
        insize: usize,
    ) -> isize;
}
unsafe extern "C" {
    #[doc = "Decompress data\n # Arguments\n\n* `iov` (direction in) - Output vector\n * `iovcnt` (direction in) - Number of buffers\n * `callback` (direction in) - Data callback (see note)\n * `userdata` (direction in) - User data passed to callback (see note)\n * `insize` (direction in) - Size of userdata (see note)\n # Returns\n\nWhether succeeded\n\n > **Note:** If callback is null, userdata is a pointer to memory to read from,\n and insize is the size of that data. If callback is not null,\n userdata is passed to callback to fetch more data, and insize is\n unused."]
    pub fn decompressV(
        iov: *const decompressIOVec,
        iovcnt: usize,
        callback: decompressCallback,
        userdata: *mut ::libc::c_void,
        insize: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Decompress data\n # Arguments\n\n* `output` (direction in) - Output buffer\n * `size` (direction in) - Output size limit\n * `callback` (direction in) - Data callback (see decompressV())\n * `userdata` (direction in) - User data passed to callback (see decompressV())\n * `insize` (direction in) - Size of userdata (see decompressV())\n # Returns\n\nWhether succeeded"]
    #[link_name = "decompress__extern"]
    pub fn decompress(
        output: *mut ::libc::c_void,
        size: usize,
        callback: decompressCallback,
        userdata: *mut ::libc::c_void,
        insize: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Decompress LZSS/LZ10\n # Arguments\n\n* `iov` (direction in) - Output vector\n * `iovcnt` (direction in) - Number of buffers\n * `callback` (direction in) - Data callback (see decompressV())\n * `userdata` (direction in) - User data passed to callback (see decompressV())\n * `insize` (direction in) - Size of userdata (see decompressV())\n # Returns\n\nWhether succeeded"]
    pub fn decompressV_LZSS(
        iov: *const decompressIOVec,
        iovcnt: usize,
        callback: decompressCallback,
        userdata: *mut ::libc::c_void,
        insize: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Decompress LZSS/LZ10\n # Arguments\n\n* `output` (direction in) - Output buffer\n * `size` (direction in) - Output size limit\n * `callback` (direction in) - Data callback (see decompressV())\n * `userdata` (direction in) - User data passed to callback (see decompressV())\n * `insize` (direction in) - Size of userdata (see decompressV())\n # Returns\n\nWhether succeeded"]
    #[link_name = "decompress_LZSS__extern"]
    pub fn decompress_LZSS(
        output: *mut ::libc::c_void,
        size: usize,
        callback: decompressCallback,
        userdata: *mut ::libc::c_void,
        insize: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Decompress LZ11\n # Arguments\n\n* `iov` (direction in) - Output vector\n * `iovcnt` (direction in) - Number of buffers\n * `callback` (direction in) - Data callback (see decompressV())\n * `userdata` (direction in) - User data passed to callback (see decompressV())\n * `insize` (direction in) - Size of userdata (see decompressV())\n # Returns\n\nWhether succeeded"]
    pub fn decompressV_LZ11(
        iov: *const decompressIOVec,
        iovcnt: usize,
        callback: decompressCallback,
        userdata: *mut ::libc::c_void,
        insize: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Decompress LZ11\n # Arguments\n\n* `output` (direction in) - Output buffer\n * `size` (direction in) - Output size limit\n * `callback` (direction in) - Data callback (see decompressV())\n * `userdata` (direction in) - User data passed to callback (see decompressV())\n * `insize` (direction in) - Size of userdata (see decompressV())\n # Returns\n\nWhether succeeded"]
    #[link_name = "decompress_LZ11__extern"]
    pub fn decompress_LZ11(
        output: *mut ::libc::c_void,
        size: usize,
        callback: decompressCallback,
        userdata: *mut ::libc::c_void,
        insize: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Decompress Huffman\n # Arguments\n\n* `bits` (direction in) - Data size in bits (usually 4 or 8)\n * `iov` (direction in) - Output vector\n * `iovcnt` (direction in) - Number of buffers\n * `callback` (direction in) - Data callback (see decompressV())\n * `userdata` (direction in) - User data passed to callback (see decompressV())\n * `insize` (direction in) - Size of userdata (see decompressV())\n # Returns\n\nWhether succeeded"]
    pub fn decompressV_Huff(
        bits: usize,
        iov: *const decompressIOVec,
        iovcnt: usize,
        callback: decompressCallback,
        userdata: *mut ::libc::c_void,
        insize: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Decompress Huffman\n # Arguments\n\n* `bits` (direction in) - Data size in bits (usually 4 or 8)\n * `output` (direction in) - Output buffer\n * `size` (direction in) - Output size limit\n * `callback` (direction in) - Data callback (see decompressV())\n * `userdata` (direction in) - User data passed to callback (see decompressV())\n * `insize` (direction in) - Size of userdata (see decompressV())\n # Returns\n\nWhether succeeded"]
    #[link_name = "decompress_Huff__extern"]
    pub fn decompress_Huff(
        bits: usize,
        output: *mut ::libc::c_void,
        size: usize,
        callback: decompressCallback,
        userdata: *mut ::libc::c_void,
        insize: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Decompress run-length encoding\n # Arguments\n\n* `iov` (direction in) - Output vector\n * `iovcnt` (direction in) - Number of buffers\n * `callback` (direction in) - Data callback (see decompressV())\n * `userdata` (direction in) - User data passed to callback (see decompressV())\n * `insize` (direction in) - Size of userdata (see decompressV())\n # Returns\n\nWhether succeeded"]
    pub fn decompressV_RLE(
        iov: *const decompressIOVec,
        iovcnt: usize,
        callback: decompressCallback,
        userdata: *mut ::libc::c_void,
        insize: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Decompress run-length encoding\n # Arguments\n\n* `output` (direction in) - Output buffer\n * `size` (direction in) - Output size limit\n * `callback` (direction in) - Data callback (see decompressV())\n * `userdata` (direction in) - User data passed to callback (see decompressV())\n * `insize` (direction in) - Size of userdata (see decompressV())\n # Returns\n\nWhether succeeded"]
    #[link_name = "decompress_RLE__extern"]
    pub fn decompress_RLE(
        output: *mut ::libc::c_void,
        size: usize,
        callback: decompressCallback,
        userdata: *mut ::libc::c_void,
        insize: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Convert a UTF-8 sequence into a UTF-32 codepoint\n\n # Arguments\n\n* `out` (direction out) - Output codepoint\n * `in` (direction in) - Input sequence\n\n # Returns\n\nnumber of input code units consumed\n -1 for error"]
    pub fn decode_utf8(out: *mut u32, in_: *const u8) -> isize;
}
unsafe extern "C" {
    #[doc = "Convert a UTF-16 sequence into a UTF-32 codepoint\n\n # Arguments\n\n* `out` (direction out) - Output codepoint\n * `in` (direction in) - Input sequence\n\n # Returns\n\nnumber of input code units consumed\n -1 for error"]
    pub fn decode_utf16(out: *mut u32, in_: *const u16) -> isize;
}
unsafe extern "C" {
    #[doc = "Convert a UTF-32 codepoint into a UTF-8 sequence\n\n # Arguments\n\n* `out` (direction out) - Output sequence\n * `in` (direction in) - Input codepoint\n\n # Returns\n\nnumber of output code units produced\n -1 for error\n\n > **Note:** _out_ must be able to store 4 code units"]
    pub fn encode_utf8(out: *mut u8, in_: u32) -> isize;
}
unsafe extern "C" {
    #[doc = "Convert a UTF-32 codepoint into a UTF-16 sequence\n\n # Arguments\n\n* `out` (direction out) - Output sequence\n * `in` (direction in) - Input codepoint\n\n # Returns\n\nnumber of output code units produced\n -1 for error\n\n > **Note:** _out_ must be able to store 2 code units"]
    pub fn encode_utf16(out: *mut u16, in_: u32) -> isize;
}
unsafe extern "C" {
    #[doc = "Convert a UTF-8 sequence into a UTF-16 sequence\n\n Fills the output buffer up to _len_ code units.\n Returns the number of code units that the input would produce;\n if it returns greater than _len,_ the output has been\n truncated.\n\n # Arguments\n\n* `out` (direction out) - Output sequence\n * `in` (direction in) - Input sequence (null-terminated)\n * `len` (direction in) - Output length\n\n # Returns\n\nnumber of output code units produced\n -1 for error\n\n > **Note:** _out_ is not null-terminated"]
    pub fn utf8_to_utf16(out: *mut u16, in_: *const u8, len: usize) -> isize;
}
unsafe extern "C" {
    #[doc = "Convert a UTF-8 sequence into a UTF-32 sequence\n\n Fills the output buffer up to _len_ code units.\n Returns the number of code units that the input would produce;\n if it returns greater than _len,_ the output has been\n truncated.\n\n # Arguments\n\n* `out` (direction out) - Output sequence\n * `in` (direction in) - Input sequence (null-terminated)\n * `len` (direction in) - Output length\n\n # Returns\n\nnumber of output code units produced\n -1 for error\n\n > **Note:** _out_ is not null-terminated"]
    pub fn utf8_to_utf32(out: *mut u32, in_: *const u8, len: usize) -> isize;
}
unsafe extern "C" {
    #[doc = "Convert a UTF-16 sequence into a UTF-8 sequence\n\n Fills the output buffer up to _len_ code units.\n Returns the number of code units that the input would produce;\n if it returns greater than _len,_ the output has been\n truncated.\n\n # Arguments\n\n* `out` (direction out) - Output sequence\n * `in` (direction in) - Input sequence (null-terminated)\n * `len` (direction in) - Output length\n\n # Returns\n\nnumber of output code units produced\n -1 for error\n\n > **Note:** _out_ is not null-terminated"]
    pub fn utf16_to_utf8(out: *mut u8, in_: *const u16, len: usize) -> isize;
}
unsafe extern "C" {
    #[doc = "Convert a UTF-16 sequence into a UTF-32 sequence\n\n Fills the output buffer up to _len_ code units.\n Returns the number of code units that the input would produce;\n if it returns greater than _len,_ the output has been\n truncated.\n\n # Arguments\n\n* `out` (direction out) - Output sequence\n * `in` (direction in) - Input sequence (null-terminated)\n * `len` (direction in) - Output length\n\n # Returns\n\nnumber of output code units produced\n -1 for error\n\n > **Note:** _out_ is not null-terminated"]
    pub fn utf16_to_utf32(out: *mut u32, in_: *const u16, len: usize) -> isize;
}
unsafe extern "C" {
    #[doc = "Convert a UTF-32 sequence into a UTF-8 sequence\n\n Fills the output buffer up to _len_ code units.\n Returns the number of code units that the input would produce;\n if it returns greater than _len,_ the output has been\n truncated.\n\n # Arguments\n\n* `out` (direction out) - Output sequence\n * `in` (direction in) - Input sequence (null-terminated)\n * `len` (direction in) - Output length\n\n # Returns\n\nnumber of output code units produced\n -1 for error\n\n > **Note:** _out_ is not null-terminated"]
    pub fn utf32_to_utf8(out: *mut u8, in_: *const u32, len: usize) -> isize;
}
unsafe extern "C" {
    #[doc = "Convert a UTF-32 sequence into a UTF-16 sequence\n\n # Arguments\n\n* `out` (direction out) - Output sequence\n * `in` (direction in) - Input sequence (null-terminated)\n * `len` (direction in) - Output length\n\n # Returns\n\nnumber of output code units produced\n -1 for error\n\n > **Note:** _out_ is not null-terminated"]
    pub fn utf32_to_utf16(out: *mut u16, in_: *const u32, len: usize) -> isize;
}
unsafe extern "C" {
    #[doc = "Allocates a 0x80-byte aligned buffer.\n # Arguments\n\n* `size` - Size of the buffer to allocate.\n # Returns\n\nThe allocated buffer."]
    pub fn linearAlloc(size: usize) -> *mut ::libc::c_void;
}
unsafe extern "C" {
    #[doc = "Allocates a buffer aligned to the given size.\n # Arguments\n\n* `size` - Size of the buffer to allocate.\n * `alignment` - Alignment to use.\n # Returns\n\nThe allocated buffer."]
    pub fn linearMemAlign(size: usize, alignment: usize) -> *mut ::libc::c_void;
}
unsafe extern "C" {
    #[doc = "Reallocates a buffer.\n Note: Not implemented yet.\n # Arguments\n\n* `mem` - Buffer to reallocate.\n * `size` - Size of the buffer to allocate.\n # Returns\n\nThe reallocated buffer."]
    pub fn linearRealloc(mem: *mut ::libc::c_void, size: usize) -> *mut ::libc::c_void;
}
unsafe extern "C" {
    #[doc = "Retrieves the allocated size of a buffer.\n # Returns\n\nThe size of the buffer."]
    pub fn linearGetSize(mem: *mut ::libc::c_void) -> usize;
}
unsafe extern "C" {
    #[doc = "Frees a buffer.\n # Arguments\n\n* `mem` - Buffer to free."]
    pub fn linearFree(mem: *mut ::libc::c_void);
}
unsafe extern "C" {
    #[doc = "Gets the current linear free space.\n # Returns\n\nThe current linear free space."]
    pub fn linearSpaceFree() -> u32_;
}
unsafe extern "C" {
    #[doc = "Initializes the mappable allocator.\n # Arguments\n\n* `addrMin` - Minimum address.\n * `addrMax` - Maxium address."]
    pub fn mappableInit(addrMin: u32_, addrMax: u32_);
}
unsafe extern "C" {
    #[doc = "Finds a mappable memory area.\n # Arguments\n\n* `size` - Size of the area to find.\n # Returns\n\nThe mappable area."]
    pub fn mappableAlloc(size: usize) -> *mut ::libc::c_void;
}
unsafe extern "C" {
    #[doc = "Frees a mappable area (stubbed).\n # Arguments\n\n* `mem` - Mappable area to free."]
    pub fn mappableFree(mem: *mut ::libc::c_void);
}
pub const VRAM_ALLOC_A: vramAllocPos = 1;
pub const VRAM_ALLOC_B: vramAllocPos = 2;
pub const VRAM_ALLOC_ANY: vramAllocPos = 3;
pub type vramAllocPos = ::libc::c_uchar;
unsafe extern "C" {
    #[doc = "Allocates a 0x80-byte aligned buffer.\n # Arguments\n\n* `size` - Size of the buffer to allocate.\n # Returns\n\nThe allocated buffer."]
    pub fn vramAlloc(size: usize) -> *mut ::libc::c_void;
}
unsafe extern "C" {
    #[doc = "Allocates a 0x80-byte aligned buffer in the given VRAM bank.\n # Arguments\n\n* `size` - Size of the buffer to allocate.\n * `pos` - VRAM bank to use (see vramAllocPos).\n # Returns\n\nThe allocated buffer."]
    pub fn vramAllocAt(size: usize, pos: vramAllocPos) -> *mut ::libc::c_void;
}
unsafe extern "C" {
    #[doc = "Allocates a buffer aligned to the given size.\n # Arguments\n\n* `size` - Size of the buffer to allocate.\n * `alignment` - Alignment to use.\n # Returns\n\nThe allocated buffer."]
    pub fn vramMemAlign(size: usize, alignment: usize) -> *mut ::libc::c_void;
}
unsafe extern "C" {
    #[doc = "Allocates a buffer aligned to the given size in the given VRAM bank.\n # Arguments\n\n* `size` - Size of the buffer to allocate.\n * `alignment` - Alignment to use.\n * `pos` - VRAM bank to use (see vramAllocPos).\n # Returns\n\nThe allocated buffer."]
    pub fn vramMemAlignAt(size: usize, alignment: usize, pos: vramAllocPos) -> *mut ::libc::c_void;
}
unsafe extern "C" {
    #[doc = "Reallocates a buffer.\n Note: Not implemented yet.\n # Arguments\n\n* `mem` - Buffer to reallocate.\n * `size` - Size of the buffer to allocate.\n # Returns\n\nThe reallocated buffer."]
    pub fn vramRealloc(mem: *mut ::libc::c_void, size: usize) -> *mut ::libc::c_void;
}
unsafe extern "C" {
    #[doc = "Retrieves the allocated size of a buffer.\n # Returns\n\nThe size of the buffer."]
    pub fn vramGetSize(mem: *mut ::libc::c_void) -> usize;
}
unsafe extern "C" {
    #[doc = "Frees a buffer.\n # Arguments\n\n* `mem` - Buffer to free."]
    pub fn vramFree(mem: *mut ::libc::c_void);
}
unsafe extern "C" {
    #[doc = "Gets the current VRAM free space.\n # Returns\n\nThe current VRAM free space."]
    pub fn vramSpaceFree() -> u32_;
}
#[doc = "< Open authentication."]
pub const AC_OPEN: acSecurityMode = 0;
#[doc = "< WEP 40-bit authentication."]
pub const AC_WEP_40BIT: acSecurityMode = 1;
#[doc = "< WEP 104-bit authentication."]
pub const AC_WEP_104BIT: acSecurityMode = 2;
#[doc = "< WEP 128-bit authentication."]
pub const AC_WEP_128BIT: acSecurityMode = 3;
#[doc = "< WPA TKIP authentication."]
pub const AC_WPA_TKIP: acSecurityMode = 4;
#[doc = "< WPA2 TKIP authentication."]
pub const AC_WPA2_TKIP: acSecurityMode = 5;
#[doc = "< WPA AES authentication."]
pub const AC_WPA_AES: acSecurityMode = 6;
#[doc = "< WPA2 AES authentication."]
pub const AC_WPA2_AES: acSecurityMode = 7;
#[doc = "Wifi security modes."]
pub type acSecurityMode = ::libc::c_uchar;
#[doc = "< No access point/none allowed."]
pub const AC_AP_TYPE_NONE: _bindgen_ty_10 = 0;
#[doc = "< Slot 1 in System Settings."]
pub const AC_AP_TYPE_SLOT1: _bindgen_ty_10 = 2;
#[doc = "< Slot 2 in System Settings."]
pub const AC_AP_TYPE_SLOT2: _bindgen_ty_10 = 4;
#[doc = "< Slot 3 in System Settings."]
pub const AC_AP_TYPE_SLOT3: _bindgen_ty_10 = 8;
#[doc = "< All access point types allowed."]
pub const AC_AP_TYPE_ALL: _bindgen_ty_10 = 2147483647;
#[doc = "Wifi access point types (bitfield)."]
pub type _bindgen_ty_10 = ::libc::c_uint;
#[doc = "Struct to contain the data for connecting to a Wifi network from a stored slot."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct acuConfig {
    pub reserved: [u8_; 512usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of acuConfig"][::core::mem::size_of::<acuConfig>() - 512usize];
    ["Alignment of acuConfig"][::core::mem::align_of::<acuConfig>() - 1usize];
    ["Offset of field: acuConfig::reserved"][::core::mem::offset_of!(acuConfig, reserved) - 0usize];
};
impl Default for acuConfig {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Initializes AC."]
    pub fn acInit() -> Result;
}
unsafe extern "C" {
    #[doc = "Exits AC."]
    pub fn acExit();
}
unsafe extern "C" {
    #[doc = "Gets the current AC session handle."]
    pub fn acGetSessionHandle() -> *mut Handle;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Waits for the system to connect to the internet."]
    pub fn acWaitInternetConnection() -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Describes the access point the console is currently connected to with AC_AP_TYPE_* flags.\n # Arguments\n\n* `out` - Pointer to output the combination of AC_AP_TYPE_* flags describing the AP to."]
    pub fn ACU_GetWifiStatus(out: *mut u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the connected Wifi status.\n # Arguments\n\n* `out` - Pointer to output the connected Wifi status to. (1 = not connected, 3 = connected)"]
    pub fn ACU_GetStatus(out: *mut u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the connected Wifi security mode.\n # Arguments\n\n* `mode` - Pointer to output the connected Wifi security mode to. (0 = Open Authentication, 1 = WEP 40-bit, 2 = WEP 104-bit, 3 = WEP 128-bit, 4 = WPA TKIP, 5 = WPA2 TKIP, 6 = WPA AES, 7 = WPA2 AES)"]
    pub fn ACU_GetSecurityMode(mode: *mut acSecurityMode) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the connected Wifi SSID.\n # Arguments\n\n* `SSID` - Pointer to output the connected Wifi SSID to."]
    pub fn ACU_GetSSID(SSID: *mut ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the connected Wifi SSID length.\n # Arguments\n\n* `out` - Pointer to output the connected Wifi SSID length to."]
    pub fn ACU_GetSSIDLength(out: *mut u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Determines whether proxy is enabled for the connected network.\n # Arguments\n\n* `enable` - Pointer to output the proxy status to."]
    pub fn ACU_GetProxyEnable(enable: *mut bool) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the connected network's proxy host.\n # Arguments\n\n* `host` - Pointer to output the proxy host to. (The size must be at least 0x100-bytes)"]
    pub fn ACU_GetProxyHost(host: *mut ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the connected network's proxy port.\n # Arguments\n\n* `out` - Pointer to output the proxy port to."]
    pub fn ACU_GetProxyPort(out: *mut u16_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the connected network's proxy username.\n # Arguments\n\n* `username` - Pointer to output the proxy username to. (The size must be at least 0x20-bytes)"]
    pub fn ACU_GetProxyUserName(username: *mut ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the connected network's proxy password.\n # Arguments\n\n* `password` - Pointer to output the proxy password to. (The size must be at least 0x20-bytes)"]
    pub fn ACU_GetProxyPassword(password: *mut ::libc::c_char) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the last error to occur during a connection.\n # Arguments\n\n* `errorCode` - Pointer to output the error code to."]
    pub fn ACU_GetLastErrorCode(errorCode: *mut u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Gets the last detailed error to occur during a connection.\n # Arguments\n\n* `errorCode` - Pointer to output the error code to."]
    pub fn ACU_GetLastDetailErrorCode(errorCode: *mut u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Prepares a buffer to hold the configuration data to start a connection.\n # Arguments\n\n* `config` - Pointer to an acuConfig struct to contain the data."]
    pub fn ACU_CreateDefaultConfig(config: *mut acuConfig) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets something that makes the connection reliable.\n # Arguments\n\n* `config` - Pointer to an acuConfig struct used with ACU_CreateDefaultConfig previously.\n * `area` - Always 2 ?"]
    pub fn ACU_SetNetworkArea(config: *mut acuConfig, area: u8_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets the slot to use when connecting.\n # Arguments\n\n* `config` - Pointer to an acuConfig struct used with ACU_CreateDefaultConfig previously.\n * `type` - Allowed AP types bitmask, a combination of AC_AP_TYPE_* flags."]
    pub fn ACU_SetAllowApType(config: *mut acuConfig, type_: u8_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Sets something that makes the connection reliable.\n # Arguments\n\n* `config` - Pointer to an acuConfig struct used with ACU_CreateDefaultConfig previously."]
    pub fn ACU_SetRequestEulaVersion(config: *mut acuConfig) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Starts the connection procedure.\n # Arguments\n\n* `config` - Pointer to an acuConfig struct used with ACU_CreateDefaultConfig previously.\n * `connectionHandle` - Handle created with svcCreateEvent to wait on until the connection succeeds or fails."]
    pub fn ACU_ConnectAsync(config: *const acuConfig, connectionHandle: Handle) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Selects the WiFi configuration slot for further ac:i operations.\n # Arguments\n\n* `slot` - WiFi slot (0, 1 or 2)."]
    pub fn ACI_LoadNetworkSetting(slot: u32_) -> Result;
}
unsafe extern "C" {
    #[must_use]
    #[doc = "Fetches the SSID of the previously selected WiFi configuration slot.\n # Arguments\n\n* `ssid` (direction out) - Pointer to the output buffer of size 32B the SSID will be stored in."]
    pub fn ACI_GetNetworkWirelessEssidSecuritySsid(ssid: *mut ::libc::c_void) -> Result;
}
pub type MiiScreenName = [u16_; 11usize];
#[doc = "Shared Base Mii struct"]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MiiData {
    #[doc = "< Always 3"]
    pub version: u8_,
    pub mii_options: MiiData__bindgen_ty_1,
    pub mii_pos: MiiData__bindgen_ty_2,
    pub console_identity: MiiData__bindgen_ty_3,
    #[doc = "< Identifies the system that the Mii was created on (Determines pants)"]
    pub system_id: u64_,
    #[doc = "< ID of Mii"]
    pub mii_id: u32_,
    #[doc = "< Creator's system's full MAC address"]
    pub mac: [u8_; 6usize],
    #[doc = "< Padding"]
    pub pad: [u8_; 2usize],
    pub mii_details: MiiData__bindgen_ty_4,
    #[doc = "< Name of Mii (Encoded using UTF16)"]
    pub mii_name: [u16_; 10usize],
    #[doc = "< How tall the Mii is"]
    pub height: u8_,
    #[doc = "< How wide the Mii is"]
    pub width: u8_,
    pub face_style: MiiData__bindgen_ty_5,
    pub face_details: MiiData__bindgen_ty_6,
    pub hair_style: u8_,
    pub hair_details: MiiData__bindgen_ty_7,
    pub eye_details: MiiData__bindgen_ty_8,
    pub eyebrow_details: MiiData__bindgen_ty_9,
    pub nose_details: MiiData__bindgen_ty_10,
    pub mouth_details: MiiData__bindgen_ty_11,
    pub mustache_details: MiiData__bindgen_ty_12,
    pub beard_details: MiiData__bindgen_ty_13,
    pub glasses_details: MiiData__bindgen_ty_14,
    pub mole_details: MiiData__bindgen_ty_15,
    #[doc = "< Name of Mii's author (Encoded using UTF16)"]
    pub author_name: [u16_; 10usize],
}
#[doc = "Mii options"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MiiData__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MiiData__bindgen_ty_1"][::core::mem::size_of::<MiiData__bindgen_ty_1>() - 1usize];
    ["Alignment of MiiData__bindgen_ty_1"]
        [::core::mem::align_of::<MiiData__bindgen_ty_1>() - 1usize];
};
impl MiiData__bindgen_ty_1 {
    #[inline]
    pub fn allow_copying(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_allow_copying(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn allow_copying_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_allow_copying_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_private_name(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_private_name(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_private_name_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_is_private_name_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn region_lock(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_region_lock(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn region_lock_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_region_lock_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn char_set(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_char_set(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn char_set_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_char_set_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _pad(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set__pad(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _pad_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set__pad_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        allow_copying: bool,
        is_private_name: bool,
        region_lock: u8_,
        char_set: u8_,
        _pad: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let allow_copying: u8 = unsafe { ::core::mem::transmute(allow_copying) };
            allow_copying as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let is_private_name: u8 = unsafe { ::core::mem::transmute(is_private_name) };
            is_private_name as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let region_lock: u8 = unsafe { ::core::mem::transmute(region_lock) };
            region_lock as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let char_set: u8 = unsafe { ::core::mem::transmute(char_set) };
            char_set as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let _pad: u8 = unsafe { ::core::mem::transmute(_pad) };
            _pad as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "Mii position in Mii selector or Mii maker"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MiiData__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MiiData__bindgen_ty_2"][::core::mem::size_of::<MiiData__bindgen_ty_2>() - 1usize];
    ["Alignment of MiiData__bindgen_ty_2"]
        [::core::mem::align_of::<MiiData__bindgen_ty_2>() - 1usize];
};
impl MiiData__bindgen_ty_2 {
    #[inline]
    pub fn page_index(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_page_index(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn page_index_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_page_index_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn slot_index(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_slot_index(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn slot_index_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_slot_index_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(page_index: u8_, slot_index: u8_) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let page_index: u8 = unsafe { ::core::mem::transmute(page_index) };
            page_index as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let slot_index: u8 = unsafe { ::core::mem::transmute(slot_index) };
            slot_index as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "Console Identity"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MiiData__bindgen_ty_3 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MiiData__bindgen_ty_3"][::core::mem::size_of::<MiiData__bindgen_ty_3>() - 1usize];
    ["Alignment of MiiData__bindgen_ty_3"]
        [::core::mem::align_of::<MiiData__bindgen_ty_3>() - 1usize];
};
impl MiiData__bindgen_ty_3 {
    #[inline]
    pub fn unknown0(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_unknown0(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn unknown0_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_unknown0_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn origin_console(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_origin_console(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn origin_console_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                3u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_origin_console_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _pad(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set__pad(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _pad_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set__pad_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        unknown0: u8_,
        origin_console: u8_,
        _pad: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let unknown0: u8 = unsafe { ::core::mem::transmute(unknown0) };
            unknown0 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 3u8, {
            let origin_console: u8 = unsafe { ::core::mem::transmute(origin_console) };
            origin_console as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let _pad: u8 = unsafe { ::core::mem::transmute(_pad) };
            _pad as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "Mii details"]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MiiData__bindgen_ty_4 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MiiData__bindgen_ty_4"][::core::mem::size_of::<MiiData__bindgen_ty_4>() - 2usize];
    ["Alignment of MiiData__bindgen_ty_4"]
        [::core::mem::align_of::<MiiData__bindgen_ty_4>() - 1usize];
};
impl MiiData__bindgen_ty_4 {
    #[inline]
    pub fn sex(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sex(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sex_raw(this: *const Self) -> bool {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_sex_raw(this: *mut Self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn bday_month(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_bday_month(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bday_month_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                4u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_bday_month_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn bday_day(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_bday_day(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bday_day_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                5u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_bday_day_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn shirt_color(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_shirt_color(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn shirt_color_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                4u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_shirt_color_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn favorite(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_favorite(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn favorite_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_favorite_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _pad(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set__pad(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _pad_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set__pad_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        sex: bool,
        bday_month: u16_,
        bday_day: u16_,
        shirt_color: u16_,
        favorite: u16_,
        _pad: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let sex: u8 = unsafe { ::core::mem::transmute(sex) };
            sex as u64
        });
        __bindgen_bitfield_unit.set(1usize, 4u8, {
            let bday_month: u16 = unsafe { ::core::mem::transmute(bday_month) };
            bday_month as u64
        });
        __bindgen_bitfield_unit.set(5usize, 5u8, {
            let bday_day: u16 = unsafe { ::core::mem::transmute(bday_day) };
            bday_day as u64
        });
        __bindgen_bitfield_unit.set(10usize, 4u8, {
            let shirt_color: u16 = unsafe { ::core::mem::transmute(shirt_color) };
            shirt_color as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let favorite: u16 = unsafe { ::core::mem::transmute(favorite) };
            favorite as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let _pad: u16 = unsafe { ::core::mem::transmute(_pad) };
            _pad as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "Face style"]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MiiData__bindgen_ty_5 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MiiData__bindgen_ty_5"][::core::mem::size_of::<MiiData__bindgen_ty_5>() - 1usize];
    ["Alignment of MiiData__bindgen_ty_5"]
        [::core::mem::align_of::<MiiData__bindgen_ty_5>() - 1usize];
};
impl MiiData__bindgen_ty_5 {
    #[inline]
    pub fn disable_sharing(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_disable_sharing(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn disable_sharing_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_disable_sharing_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn shape(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_shape(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn shape_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                4u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_shape_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn skinColor(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_skinColor(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn skinColor_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                3u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_skinColor_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        disable_sharing: u16_,
        shape: u16_,
        skinColor: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let disable_sharing: u16 = unsafe { ::core::mem::transmute(disable_sharing) };
            disable_sharing as u64
        });
        __bindgen_bitfield_unit.set(1usize, 4u8, {
            let shape: u16 = unsafe { ::core::mem::transmute(shape) };
            shape as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let skinColor: u16 = unsafe { ::core::mem::transmute(skinColor) };
            skinColor as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "Face details"]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MiiData__bindgen_ty_6 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MiiData__bindgen_ty_6"][::core::mem::size_of::<MiiData__bindgen_ty_6>() - 1usize];
    ["Alignment of MiiData__bindgen_ty_6"]
        [::core::mem::align_of::<MiiData__bindgen_ty_6>() - 1usize];
};
impl MiiData__bindgen_ty_6 {
    #[inline]
    pub fn wrinkles(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_wrinkles(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn wrinkles_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                4u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_wrinkles_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn makeup(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_makeup(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn makeup_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                4u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_makeup_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(wrinkles: u16_, makeup: u16_) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let wrinkles: u16 = unsafe { ::core::mem::transmute(wrinkles) };
            wrinkles as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let makeup: u16 = unsafe { ::core::mem::transmute(makeup) };
            makeup as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "Hair details"]
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MiiData__bindgen_ty_7 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MiiData__bindgen_ty_7"][::core::mem::size_of::<MiiData__bindgen_ty_7>() - 1usize];
    ["Alignment of MiiData__bindgen_ty_7"]
        [::core::mem::align_of::<MiiData__bindgen_ty_7>() - 1usize];
};
impl MiiData__bindgen_ty_7 {
    #[inline]
    pub fn color(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_color(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn color_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                3u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_color_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn flip(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_flip(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn flip_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_flip_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _pad(&self) -> u16_ {
